{"data": [{"content": "My google account is hacked and Pokemon Go is using it I got a new email and I want to switch Pokemon go from my old one to my new one and two I'm scared that the hacker will have access to my Pokemon Go account I rated it 4 stars just because there isn't a in game option to switch accounts to a different email so you have to email niantic support which might not help me so if the debts see this help me please overall it's a great game just needs a I game option to switch email.", "rating": "4", "version": "1.27.4", "date": "2017-03-06T12:46:00-07:00", "title": "Question?"}, {"content": "The game is cool you can't go wrong with Pokémon but the customer service from NianticLabs and Pokémon trainer club is a joke, NianticLabs have not replied in 5 days and Pokémon trainer club hasn't replied in over a week, I have even tried getting a hold of them on Facebook and twitter and not one of them have replied in over 2 weeks, great game but because of the service I can't give it a higher rating", "rating": "1", "version": "1.27.4", "date": "2017-03-06T11:17:00-07:00", "title": "Very poor customer service"}, {"content": "This is rubbish cause at the start I tap one of the three Pokémon but it doesn't work hope you get this fixed soon thank you", "rating": "1", "version": "1.27.4", "date": "2017-03-06T10:59:00-07:00", "title": "Pokémon Go"}, {"content": "I play this game every day, to start with it was good fun in the way to work and back, but now I find myself going out at weekends to capture Pokemon, level up and take over gyms.\nI even walk different paths and longer distances to get to work just to hatch eggs and get more pokestops! This has helped with my fitness and I recommend it to everyone, I have even seen retired people out and about playing!", "rating": "5", "version": "1.27.4", "date": "2017-03-06T08:18:00-07:00", "title": "Brilliant game to get out and about"}, {"content": "I have been playing Pokémon Go since it first was released and it is enjoyable. You meet a lot of nice people but using it on a bus is basically pointless and it take ages to upload if it does it in the first try. I normally have to try and reload it 5 times before it works x", "rating": "5", "version": "1.27.3", "date": "2017-03-06T00:36:00-07:00", "title": "Overall game play"}, {"content": "Every time I go to the App Store this app just has a stop button where the download button should be making me unable to download it. I used to have the app", "rating": "1", "version": "1.27.3", "date": "2017-03-05T18:25:00-07:00", "title": "Can no longer download"}, {"content": "Can't get past Niantic screen without game autoclosing, not jailbroken, internet is fine, game is just broken.", "rating": "1", "version": "1.27.3", "date": "2017-03-05T18:08:00-07:00", "title": "Game is unplayable"}, {"content": "Can't login even though my information is correct. Anyone know if it's just the games fault or if it's actually an problem with Pokemon game accounts. If it is I can't play. \nLevel 22 and spent money on that account for nothing otherwise.", "rating": "1", "version": "1.27.3", "date": "2017-03-05T16:35:00-07:00", "title": "😭 help please"}, {"content": "You might as well take this game of the App Store as you can't sort out the tracking and have banned third party apps.I have been in gyms for several weeks now without fighting for them great for getting easy coins but suggests people are now bored with your so called number one game.by the way you have dropped to 66 in the charts in a very short time.", "rating": "1", "version": "1.27.3", "date": "2017-03-05T16:00:00-07:00", "title": "Go Pokémon"}, {"content": "What's happened?? Will no longer open. Just stays on a white screen.", "rating": "1", "version": "1.27.3", "date": "2017-03-05T15:40:00-07:00", "title": "Won't load"}, {"content": "Fix the white screen glitch and then I can catch gen 2 Pokémon", "rating": "2", "version": "1.27.3", "date": "2017-03-05T07:36:00-07:00", "title": "FIX THE WHITE SCREEN GLITCH"}, {"content": "Really disappointed in the last few updates. Constantly has a blank screen that doesn't load, or forces close.", "rating": "1", "version": "1.27.3", "date": "2017-03-05T06:27:00-07:00", "title": "Blank screen"}, {"content": "I normally play on samsung, this game is amazing although sometimes refusing to load and using way too much battery power. I never get much time to play this, when I do it's normally the highlight of my day, capturing a new Pokémon. 5 out of 5 stars for me.", "rating": "5", "version": "1.27.3", "date": "2017-03-05T06:20:00-07:00", "title": "Fabulous"}, {"content": "Glitches and glitches and glitches non stop", "rating": "1", "version": "1.27.3", "date": "2017-03-05T04:08:00-07:00", "title": "Bad bad bad"}, {"content": "I love the new generation 2 update, but I don't like that you need special items to evolve some Pokémon! And I don't like that you need 100 Dratini candies to get a Dragonite! Dratinis are so rare where I live and YOU ARE RUINING IT NIANTIC why can't it just be 25 candies? I love this game and I am playing it all the time! There's one catch though, My eggs say they're at 2k or 5k or 10k bit they don't hatch until the next day! Please fix this! \nAlso when it says that the game is for 9+ and when I'm in the car (and I'm 10) it say YOU ARE GOING TOO FAST when I can't even drive!", "rating": "3", "version": "1.27.3", "date": "2017-03-05T02:16:00-07:00", "title": "Love gen 2!"}, {"content": "Amazing waiting for breeding and trading can't wait #teamvalor love gen 2", "rating": "5", "version": "1.27.3", "date": "2017-03-05T02:14:00-07:00", "title": "Awesome"}, {"content": "Niantic have killed the game and the fan base. The newly updated version on my phone crashes more than the stock market and the only thing that you gain from playing this game is utter despair as there is no variety of Pokemon or pokestops where I live. UNISTALLED!!!!", "rating": "1", "version": "1.27.3", "date": "2017-03-05T01:57:00-07:00", "title": "No more Pokémon for me"}, {"content": "This game is amazing I would recommend this", "rating": "5", "version": "1.27.3", "date": "2017-03-05T00:45:00-07:00", "title": "Amazing totally get it"}, {"content": "I love playing the game! I love the gen 2 I caught a ditto only on Level 20 more Pokémon ( amazing Pokémon ) in England please !!", "rating": "5", "version": "1.27.3", "date": "2017-03-04T23:20:00-07:00", "title": "Awesome"}, {"content": "It is a great game I have been playing it since August 2016 when I got my phone and have not stopped playing and restart playing I have played it the whole time because the game is great.", "rating": "5", "version": "1.27.3", "date": "2017-03-04T22:59:00-07:00", "title": "Pokémon go"}, {"content": "It's such a good game and can't stop playing it everyday. It's a great way to keep me fit as well as I can go for walks and play the game at the same time!\n\nIf I could add one thing to Pokémon to make it even better, it would be this:\n\nI wish that everyday you could get the chance to duplicate one of your Pokémons you already have to get another one. So when you load up the app it's gives you a list of your Pokémons to choose from to get another one. For example I only have one Growlithe and I caught that 7 months ago and I haven't seen anymore. Therefore it's really hard for me to evolve it and having this duplication it would benefit people to evolve their Pokémons that they struggle to get hold of and can get the 3 candys.", "rating": "5", "version": "1.27.3", "date": "2017-03-04T14:47:00-07:00", "title": "I'm addicted"}, {"content": "Since this update the game crashes and closes on me at least 20 times a day. The worst so called performance update I have ever seen. Get it sorted please.", "rating": "1", "version": "1.27.3", "date": "2017-03-04T13:34:00-07:00", "title": "Love the game hate this update"}, {"content": "Since last update it keeps crashing and can be unplayable at times. Fix pls?", "rating": "2", "version": "1.27.3", "date": "2017-03-04T13:16:00-07:00", "title": "Keeps crashing"}, {"content": "When ever I try to spin the poke stop it sais please try again", "rating": "4", "version": "1.27.3", "date": "2017-03-04T13:08:00-07:00", "title": "Pokestops are broke"}, {"content": "#pokomongois dying out", "rating": "1", "version": "1.27.3", "date": "2017-03-04T12:55:00-07:00", "title": "Na na na na na"}, {"content": "App crashes every few minutes with go plus connected can't leave my iPhones 7 plus in my pocket and use go plus for more than a few minutes without loosing connection. When I check the app it has closed? Never had this issue until the last week or so of the game. Partner also has same issue on her 7 plus when using go plus. Over all the game is back to square one with its stability I'm really glad I have a go plus paperweight!!!", "rating": "1", "version": "1.27.3", "date": "2017-03-04T11:38:00-07:00", "title": "App constantly crashes with go plus connected"}, {"content": "Love the game but the last few updates have made it unplayable. Constantly dropping back out of game to home screen and not loading at all - very poor.", "rating": "1", "version": "1.27.3", "date": "2017-03-04T07:24:00-07:00", "title": "Updates are terrible"}, {"content": "Crashes after showing the loading screen. Running io9.2. Has done this for several months so haven't been able to play for a long time. \nAn enjoyable game when it works.", "rating": "1", "version": "1.27.3", "date": "2017-03-04T06:45:00-07:00", "title": "Doesn't work"}, {"content": "Great game, highly recommend to anyone of all ages. Some things you could add: when your walking/running your buddy could be beside you. And the other thing is that you could be able to see other players characters and you could be able to interact by chatting, trading, befriending them and just like having a non serious battle. But this game is my favourite🤙🏼🤙🏼", "rating": "5", "version": "1.27.3", "date": "2017-03-04T01:22:00-07:00", "title": "Luv it so muchh"}, {"content": "Besides the constant crashing, app freezing, not letting you into the app and just display a blank screen, I'd say thank you for getting Gen 2 out finally. Therefore I am giving this a 2 stars than the usual 1 this time.\n\nAnd oh yeah, one more thing. You increased the extra bag space and extra Pokemon space by 100 more pokedollars (was 100, now 200)????!!! With Gen 2 out and new items, there's no way our original item room was enough. Developers just want the players to spend real money, I know, but I just want to rant about it.", "rating": "2", "version": "1.27.3", "date": "2017-03-03T16:15:00-07:00", "title": "Gen 2 finally"}, {"content": "It works for about month at a time. Need to keep logging in. It's not great when you out looking for Pokémon when you get asked to log in. Don't waste your and your kids time. Was good up in till the new update.", "rating": "1", "version": "1.27.3", "date": "2017-03-03T16:11:00-07:00", "title": "Off and on"}, {"content": "Can you upgrade for more eggs space 9 is not enough", "rating": "5", "version": "1.27.3", "date": "2017-03-03T14:45:00-07:00", "title": "More space"}, {"content": "The new update logged me out and when I use google to sign in it take me to a webpage that is on an infinite loop of refreshing. Please help me to log in or fix this version asap.", "rating": "1", "version": "1.27.3", "date": "2017-03-03T14:09:00-07:00", "title": "Cannot login anymore"}, {"content": "So lately I got back into playing this game and it's been a lot better. So much has changed and for the better since I last properly played it which was last summer 😊", "rating": "5", "version": "1.27.3", "date": "2017-03-03T14:05:00-07:00", "title": "Very good"}, {"content": "I started playing pokemon go when it came out in around July and i have loved it ever since! There are some flaws and the updates have been slow but i think it's great! I'm level 29 near 30, team VALOR🔴 i like how they finally put gen2 in and gave new berries and evolution items however, i hate how they took away the guarenteed 7 day streak item😓 TO IMPROVE: Make the gyms more better by having it more similar to the actual pokemon games and stop level10 gyms from staying in there for ages! I would also like trading to come out, friends on pokemon so you can see what they catch and those things, and when you see a pokemon in a gym, then it doesn't show up in your pokedex !Also, I hope they fix how long the screen loads and fix the bugs!   I do love this game and i hope it improves😊", "rating": "4", "version": "1.27.3", "date": "2017-03-03T10:16:00-07:00", "title": "LOVED IT FROM THE START"}, {"content": "This version of the game has broken and will not let me log into any account. I have tried with several accounts but still no response. There is no official support page so I am complaining through this review. Niantic please fix ur game.", "rating": "2", "version": "1.27.3", "date": "2017-03-03T10:04:00-07:00", "title": "Broken but other ways a great game"}, {"content": "Get I life and play an actual pokemon game like Pokemon moon", "rating": "1", "version": "1.27.3", "date": "2017-03-03T08:50:00-07:00", "title": "RUBBISH"}, {"content": "Did the most recent update which stated to give performance improvements - instead completely killed the app for me.\n\nNow won't even let me log in even though I know my details are correct. Please sort this out soon niantic", "rating": "1", "version": "1.27.3", "date": "2017-03-03T03:49:00-07:00", "title": "Useless update"}, {"content": "When I load onto the game it says... \"if you wish to continue there is another update available, would you like to update now?.\" Things that are wrong with this\n1) it doesn't even give you an option to just play the game without the update\n2) it takes so long to load the game and then you get this popping up on your screen when it does load\n3) and three when I press \"update to continue\" it takes me into the App Store and just gives me the option to open the game but doesn't let me update it.\nSo in conclusion the game is broken and I can't play the game", "rating": "1", "version": "1.27.3", "date": "2017-03-02T23:41:00-07:00", "title": "Can't even play it"}, {"content": "Such an amazing game!", "rating": "5", "version": "1.27.3", "date": "2017-03-02T15:27:00-07:00", "title": "GREAT GAME!"}, {"content": "I've never been so addicted to walking so much and also an app. It was always one of my dreams to be in the Pokemon world as a kid and this app has given me the chance to experience it in a similar way.\n \nUpdate: Still loving Pokemon Go but realised that every now and then when I boot the app it crashes or freezes with a white screen.", "rating": "5", "version": "1.27.3", "date": "2017-03-02T15:25:00-07:00", "title": "New favourite app!"}, {"content": "can you add more pokémon please", "rating": "5", "version": "1.27.3", "date": "2017-03-02T13:06:00-07:00", "title": "please"}, {"content": "The last three updates have not solved the issue of me not even being able to load the game. The niantic screen shows for a split second before the app closes. Sort it out mannnnnnnn!", "rating": "2", "version": "1.27.3", "date": "2017-03-02T12:49:00-07:00", "title": "Still not working.."}, {"content": "I can't get a starter Pokemon because the game crashes every time I tap on one of the three starter Pokemon.Please FIX this bug so I can actually play the game.", "rating": "1", "version": "1.27.3", "date": "2017-03-02T11:10:00-07:00", "title": "CANT GET A STARTER"}, {"content": "What had happened? Latest update has rendered this unusable.", "rating": "1", "version": "1.27.3", "date": "2017-03-02T11:09:00-07:00", "title": "Latest update has ruined this game"}, {"content": "GPS doesn't work anymore. Whenever I open the app (wherever I am) my avatar never moves. She's always at home on the map, even if I'm nowhere near home. I have a pretty signal and use public wifi where I can, but I still get nothing!", "rating": "2", "version": "1.27.3", "date": "2017-03-02T05:58:00-07:00", "title": "Still love it, but..."}, {"content": "The game has improved massively since Gen two being added it has brought new items and Pokemon. It is epic. Must play.", "rating": "5", "version": "1.27.3", "date": "2017-03-01T23:33:00-07:00", "title": "Amazing new update Gen 2"}, {"content": "Had this on my other iPhone 6 Plus (9.3.2) back in August and originally it worked great a JB devices, until they patched it and it would crash. There was methods around it back then.. came back to this game and was enjoying the game after gen 2 update and then I jailbroke my \"New\" iPhone 6 (10.2) and now it doesn't load no more.. and there's no way around they have patched everything. Even downgrading by a tweak, doesn't work as they make you update. If you see this Nitanic please reconsider the choice you've made :-)\n\nFrom a legit non location spoofer player. Been a fan of Pokémon all my life.", "rating": "1", "version": "1.27.3", "date": "2017-03-01T21:44:00-07:00", "title": "No Love To Jailbreakers :("}, {"content": "I'm not really sure why so many people are leaving negative reviews. \"Loading screen is long\" at least you can play. \"Crashes\" your phone must be broken a lot. I'm on a 5, and the graphics are amazing, works fine, good enough range of Pokémon for MY area (not a lot 😂), and loads of fun! If the game crashes, then something's wrong with YOU. What my phone does: \n\nOpen app\nImmediately crashes\nOpen again\nLoads 20 seconds \nGet blue screen with white outlines\nRestart game\nFine.\n\nIf you really want to play, you'd be willing to do that. You're meant to to it walking. No pokestops? Go for a drive. They refresh every 5 minutes. GET USED TO IT. \nThis game is PERFECT considering that a massive update has just come out, of course there'll be some bugs. Keep it up Niantic!!", "rating": "5", "version": "1.27.3", "date": "2017-03-01T14:14:00-07:00", "title": "AWESOME ⚡⚡⚡"}, {"content": "If app is in background the battery drains completely in an 8 hour period from 90-95% (iphone 7). Second day in row this has happened. Before update could still expect over 60% left. Poor.", "rating": "1", "version": "1.27.3", "date": "2017-03-01T13:39:00-07:00", "title": "Drains battery in background"}, {"content": "I have downloaded the app but when I go to Sign up with google it doesn't load ☹️", "rating": "1", "version": "1.27.3", "date": "2017-03-01T13:38:00-07:00", "title": "Not working 😕"}, {"content": "the price of items increase making it harder to play the game", "rating": "1", "version": "1.27.3", "date": "2017-03-01T13:33:00-07:00", "title": "Problem"}, {"content": "Really addictive game and fun to play, but should have a select item and select more Pokémon to transfer because it takes too long to just favourite them and then un favourite and then transfer. Takes too long! Add this in (should be a good idea)", "rating": "5", "version": "1.27.3", "date": "2017-03-01T12:45:00-07:00", "title": "Good game but add this..."}, {"content": "Introduced an incredible amount of bugs this version. Loading screen light blue and never continues, or reach Pokemon Go login screen but login buttons don't show, or crashes after ~30 minutes of usage, almost without fail. (Memory leak?) Very unfortunate - such an enjoyable game to play but app doesn't help encourage it.", "rating": "1", "version": "1.27.3", "date": "2017-03-01T12:45:00-07:00", "title": "Most Buggy Version Yet!"}, {"content": "By far my favourite mobile game of all time. Could use improvements such as trading and a friends list of some sort but other than that it's great.", "rating": "5", "version": "1.27.3", "date": "2017-03-01T12:08:00-07:00", "title": "Best app out there"}, {"content": "App used to work perfectly and never crashed prior to the latest update on 28th February 2017. Now I just get a plain blue screen almost every time you load the app. If you close and open the app three or four times it eventually shows the map, but even then the PokéStops and Gyms only load one time out of every five. The majority of PokéStops now say \"try again later\" and don't give out any items. I wish there was a way to roll back the app to the previous version that worked! Awful, just awful!!", "rating": "1", "version": "1.27.3", "date": "2017-03-01T10:02:00-07:00", "title": "Latest update breaks everything"}, {"content": "I accidentally logged out my account and I usually forget my password so I reset password but I can't because I don't even understand what you mean by a \"player id\" and every time I try to put my date of birth in it will always glitch out and not let me re-type my date of birth, please fix the password reset thing.", "rating": "1", "version": "1.27.3", "date": "2017-03-01T09:28:00-07:00", "title": "I hope you read reviews"}, {"content": "Shuts down on its own all the time. Closes Pokémon capture screen for no reason. Takes me out of the Pokémon screen all the time back to my home screen on my iPhone 7 for no apparent reason. If this is an upgrade it is a joke", "rating": "2", "version": "1.27.3", "date": "2017-03-01T08:51:00-07:00", "title": "Worst update ever"}, {"content": "I caught a larvitar with nanab berry and only got 5 candie my friend caught a charmeleon with nanab berry and got 10 candy", "rating": "3", "version": "1.27.3", "date": "2017-03-01T08:21:00-07:00", "title": "I want my larvitar candie"}, {"content": "I love Pokémon, I've played it all my life and this app was great, I've spend too much money on it and I'm not proud of it but for the last 2 months I've had a glitch where when the screen loads it's just white, nothing comes up and I can't interact with anything, I've reported this but still months later no fix. Absolutely horrible", "rating": "1", "version": "1.27.3", "date": "2017-03-01T05:57:00-07:00", "title": "Useless Customer Support"}, {"content": "Whenever I open the app it seems to crash when I'm at home and even when I'm outside of the house. Needs improvement to stop the game crashing.😡😡😡😡😡", "rating": "1", "version": "1.27.3", "date": "2017-03-01T05:02:00-07:00", "title": "Game keeps crashing"}, {"content": "Just made a purchase to get more coins and no coins! This app is terrible and runs like a donkey with 3 legs. \n\nPlease fix the crashing/quitting!!", "rating": "1", "version": "1.27.3", "date": "2017-03-01T00:31:00-07:00", "title": "Rubbish"}, {"content": "Recently updated lost all the new. Berries and revives", "rating": "1", "version": "1.27.3", "date": "2017-02-28T20:42:00-07:00", "title": "Lost items"}, {"content": "The Gen2 patch and subsequent performance fixes patch is crashing my game out constantly. I have an iPhone SE with the Pokemon go plus and an Apple Watch. It's seemingly random, sometimes it's when spinning a pokestop, other times it's just running the app or after evolving a Pokemon. It only occurs when the Apple Watch is running, the Pokemon Go Plus is paired and the iPhone is being used. The next patch must resolve this as it's a blemish on an otherwise fantastic game!", "rating": "1", "version": "1.27.3", "date": "2017-02-28T16:20:00-07:00", "title": "Latest bug fix patch still hasn't fixed it"}, {"content": "Was good before update now I sign in and it works first time, I close the app and reopen it and I just get a blue screen, please fix as this was a good game", "rating": "2", "version": "1.27.3", "date": "2017-02-28T16:16:00-07:00", "title": "Was good but...."}, {"content": "When ever i open the app, it loads the game however the screen go white and all it shows is my avatar on the bottom left with my level and the pokemon home button and nothing else, no map nothing...just white screen.", "rating": "2", "version": "1.27.3", "date": "2017-02-28T15:58:00-07:00", "title": "Blank Screen"}, {"content": "This is a very good game. Please stop confusing YOUR phone issues with in game issues. Just because it crashes for YOU it doesn't mean the game is broken. Get a better phone. iPhone 4s is not recommended. Don't follow the crowd. It's not fair on Niantic. Valor.", "rating": "5", "version": "1.27.3", "date": "2017-02-28T14:12:00-07:00", "title": "Just because it crashes for YOU..."}, {"content": "Really fun! Generation 2 has also really improved the fun!!!", "rating": "5", "version": "1.27.3", "date": "2017-02-28T13:35:00-07:00", "title": "Pokémon Go!"}, {"content": "Maybe change the sounds of the Pokémon e.g. Cubone says cubone instead of noises the noises of the Pokémon af annoying", "rating": "5", "version": "1.27.3", "date": "2017-02-28T13:26:00-07:00", "title": "Amazing but...."}, {"content": "Since the new update game has got better ! Would be good if you could swap Pokémon with friends! Would be a good way to evolve harder Pokémon", "rating": "4", "version": "1.27.3", "date": "2017-02-28T13:15:00-07:00", "title": "New update"}, {"content": "It was at first absolutely fab honestly couldn't stop playing but now I keep seeing the same Pokémon over and over and it's getting really repetitive I don't think it will be long before I uninstall the app but it's probably just where I live so yeah good but now it's repetitive. :/", "rating": "3", "version": "1.27.3", "date": "2017-02-28T11:25:00-07:00", "title": "Moderately good"}, {"content": "I got a Pokemon go plus for Christmas AND WITH YESTERDAY'S UPDATE IT NO LONGER WORKS! For crying out loud. I have friends who can no longer play because the Christmas update has basically made it so they can no longer load the game, let alone play. I know someone who checks once a week, redownloading and installing but it just refuses to work. That's because they haven't got the latest install of the iOS. But it is ludicrous and ridiculous and poor customer service and business sense to break an overpriced piece of kit that encourages you to spend more money and time on the game. Please fix it now.", "rating": "1", "version": "1.27.3", "date": "2017-02-28T10:59:00-07:00", "title": "How have you broken it so much?"}, {"content": "I have a PTC account (Pokémon training club account) and it crashes at least twice a day for several hours at a time so over all I'm only getting an hour or two playing time each day. I'm a very high level with multiple rares and extremely strong Pokémon. However I fear that I will lose them all cause the PTC can not stop it from crashing!!! Please either fix the issue or intergrate with the google accounts!!", "rating": "1", "version": "1.27.3", "date": "2017-02-28T09:50:00-07:00", "title": "IF YOU GET THIS DO NOT USE A PTC ACCOUNT!!"}, {"content": "I love Pokémon go but it doesn't sync your data from phone keeps saying level 1 on watch", "rating": "2", "version": "1.27.3", "date": "2017-02-28T09:35:00-07:00", "title": "Not syncing"}, {"content": "Worst game ever would not download waist of time still haven't put trading in don't do anything the advert says", "rating": "1", "version": "1.27.3", "date": "2017-02-28T08:33:00-07:00", "title": "Pokemon"}, {"content": "What a joke", "rating": "1", "version": "1.27.3", "date": "2017-02-28T08:02:00-07:00", "title": "Keeps crashing"}, {"content": "The new version takes ages to login and then crashes.", "rating": "1", "version": "1.27.3", "date": "2017-02-28T07:38:00-07:00", "title": "Keeps crashing"}, {"content": "Love it! Gives me something to do in my spare time and gets me outdoor far more than I used to! The nostalgia isn't bad either!", "rating": "5", "version": "1.27.3", "date": "2017-02-28T06:21:00-07:00", "title": "Love it!"}, {"content": "Sorry for the trump pun... but Pokemon go really does just make your walk to the shops way better and even inspires you to walk a bit every day. I am a lazy mo fo and i get excited to walk to the park to see whats there, the game is phenomenal!", "rating": "5", "version": "1.27.3", "date": "2017-02-28T04:26:00-07:00", "title": "Making outside great again!"}, {"content": "Since the recent update I've not been able to play the game due to \"no gps\". Hopefully they can fix soon", "rating": "1", "version": "1.27.3", "date": "2017-02-28T04:25:00-07:00", "title": "No gps"}, {"content": "Great for commuting, brings me back to my childhood days and lets me escape the harsh reality that is life.", "rating": "5", "version": "1.27.3", "date": "2017-02-28T02:40:00-07:00", "title": "Lots of fun"}, {"content": "Still comes up with a fixed light blue screen when I load up the app then it automatically closes and will keep doing this even if I restart the app several times. Very rarely the app will load but still time consuming and frustrating just to get the app working. I love this game and find it a blast to play so please fix these issues. Thank you", "rating": "2", "version": "1.27.3", "date": "2017-02-28T02:27:00-07:00", "title": "Still not working"}, {"content": "Basic but fantastic game. Very entertaining.", "rating": "5", "version": "1.27.3", "date": "2017-02-28T00:17:00-07:00", "title": "Great game"}, {"content": "Since this new update the only way I can get the game to load is by uninstalling and reinstalling the game!😡\nI absolutely love this game too, but now it won't even load normally!", "rating": "1", "version": "1.27.3", "date": "2017-02-28T00:05:00-07:00", "title": "CONSTANTLY CRASHES!😡😠😤"}, {"content": "Now that niantic have finally released the new gen 2 I highly recommend playing the game again.", "rating": "5", "version": "1.27.3", "date": "2017-02-27T23:55:00-07:00", "title": "Gen 2"}, {"content": "This game no longer fun as before, waste of time now. It's not like the Pokemon Go from the beginning.", "rating": "1", "version": "1.27.3", "date": "2017-02-27T19:36:00-07:00", "title": "Sad update"}, {"content": "Normally a good game but since the generation two update I can't even get past a blank screen. Disappointing.", "rating": "2", "version": "1.27.3", "date": "2017-02-27T18:05:00-07:00", "title": "Decent but glitchy atm"}, {"content": "Game used to be good now all I get is a grey screen and a frozen spinning wheel in the top left corner :/", "rating": "1", "version": "1.27.3", "date": "2017-02-27T14:47:00-07:00", "title": "Grey screen"}, {"content": "Open app and it always says log in has failed.", "rating": "1", "version": "1.27.3", "date": "2017-02-27T14:44:00-07:00", "title": "Can't even log in anymore!"}, {"content": "Good graphics", "rating": "3", "version": "1.27.3", "date": "2017-02-27T13:45:00-07:00", "title": "Go go"}, {"content": "You wasted this great game of our childhood..Full of weak Pokémons a boring world full of pidgy and ratatta.. I thought it was gonna be like the game in game boy ! Level up by fights and fight your friends around you .  Nintendo for ever !", "rating": "1", "version": "1.27.3", "date": "2017-02-27T13:43:00-07:00", "title": "Boring"}, {"content": "Yet another update that completely fails to fix any of the problems with this game.\n\nSTILL have to close and open the game 5-6 time before a map shows.\n\nSTILL have to then close and reopen the game 3-4 times for any anything to appear on the map.\n\nSTILL crashes a lot.\n\nApple need to remove this game from the App Store, it's an absolute disgrace of a game.", "rating": "1", "version": "1.27.3", "date": "2017-02-27T13:24:00-07:00", "title": "Should be zero stars."}, {"content": "Please take back this update, can't play at all atm. Don't update!", "rating": "1", "version": "1.27.3", "date": "2017-02-27T12:17:00-07:00", "title": "Such a great game"}, {"content": "When I downloaded it it was amazing but I deleted it. When I tried to download it again it would not work. I would put my date of birth in and then I clicked on google account. When it went to the internet it would take forever to load (because it never did load). Hope u can fix this as it is an amazing game but it just won't work.", "rating": "1", "version": "1.27.3", "date": "2017-02-27T11:45:00-07:00", "title": "Terrible..."}, {"content": "Amazing game", "rating": "5", "version": "1.27.3", "date": "2017-02-27T11:04:00-07:00", "title": "Awesome"}, {"content": "I play Pokemon go everyday", "rating": "5", "version": "1.27.3", "date": "2017-02-27T10:41:00-07:00", "title": "I play Pokemon go everyday"}, {"content": "Keeps crashing on me", "rating": "3", "version": "1.27.3", "date": "2017-02-27T10:40:00-07:00", "title": "Keeps crashing on me"}, {"content": "Keeps crashing on load up and I have to restart my phone", "rating": "3", "version": "1.27.2", "date": "2017-02-27T10:11:00-07:00", "title": "Good but"}, {"content": "I re downloaded this game as I heard about gen 2 but it won't load the google account screen. I can't log in to my old account!!!!!!", "rating": "2", "version": "1.27.2", "date": "2017-02-27T08:37:00-07:00", "title": "Logging in??!!??!??"}, {"content": "To start with, the app barely loads. It gets stuck on the screen just before it loads the map. It took me nearly an hour the other day to get it on. The distance tracker doesn't work properly. It logs distance on my eggs (sometimes) but doesn't change my Buddy distance. I barely get eggs from stops anymore. I'm hatching constant Paras and Nidoran's when I do get them. It freezes and says error when I try to transfer things. The bugs are ruining this. Please fix things before bringing out new features. Make the game actually playable first. That should be your priority. No wonder no one plays it anymore.", "rating": "1", "version": "1.27.2", "date": "2017-02-27T07:58:00-07:00", "title": "Too many bugs."}, {"content": "Was a great game but since the last update I haven't been able to get on to play I just get a white screen", "rating": "5", "version": "1.27.2", "date": "2017-02-27T07:26:00-07:00", "title": "Was great"}, {"content": "Still good game, I get out loads n walk far playing it but ratio of new to old is bit ridiculous now. I've been 2 candys away from a nidoking and ain't see a male nidoran in days. Also still same common Pokémon all the time in my area. No variety only seen charmander 3 times since game started.", "rating": "3", "version": "1.27.2", "date": "2017-02-27T06:06:00-07:00", "title": "Far to many new Pokemon"}, {"content": "Add trading and a friends option where u can view their pokedex and stuff. What would be cool too is if u could see other players characters and buddies walking around", "rating": "5", "version": "1.27.2", "date": "2017-02-27T03:39:00-07:00", "title": "Perfect just keep updating"}, {"content": "👍🏻👍🏻👍🏻", "rating": "5", "version": "1.27.2", "date": "2017-02-27T02:25:00-07:00", "title": "Pokemon is life"}, {"content": "says 'gps signal not found'", "rating": "1", "version": "1.27.2", "date": "2017-02-26T23:10:00-07:00", "title": "Doesnt work"}, {"content": "This app is very exciting, needs more update and needs legendary Pokemon's and options. Please fix every time it crashes", "rating": "5", "version": "1.27.2", "date": "2017-02-26T15:10:00-07:00", "title": "😊"}, {"content": "Since I updated the app cannot get past loading screen! I hope they will reward us for this inconvenience", "rating": "1", "version": "1.27.2", "date": "2017-02-26T14:59:00-07:00", "title": "Do not install latest update!"}, {"content": "Regularly crashes on launch and even when you go to catch a Pokémon. \n\nRidiculously slow at finding your location and loading everything. (4G lte on iPhone 7 plus)\n\nWatch app slow and crashes and often doesn't record. \n\nStill no tracking in Japan - home of the Pokémon.", "rating": "1", "version": "1.27.2", "date": "2017-02-26T14:47:00-07:00", "title": "Almost unplayable"}, {"content": "Just wanted to put this out there, very dissappointed that since the update the data usage has gone up. This is unfair as now I need to buy more data to last a month playing for the same amount of time. Please fix this Niantic!!!", "rating": "2", "version": "1.27.2", "date": "2017-02-26T14:30:00-07:00", "title": "Data hungry since update"}, {"content": "This game is great. There is a problem, however. The game crashes every few minutes. It is very annoying and needs to be fixed. Gen 2 is good tho.", "rating": "4", "version": "1.27.2", "date": "2017-02-26T14:21:00-07:00", "title": "Great game, but ruined by a big problem."}, {"content": "Since the last update, it's seriously glitchy. Always kicking me out of the game. Freezes. Won't load and so on. Real shame as I'm a proper addict and have quite literally put hundreds on pounds into the game already...\nAlso since the update the games data usage has sky rocketed, and others I know playing the game are finding the same. Niantic needs to sort that out asap as it burnt through my hefty months allowance within just a few days of playing! :/", "rating": "1", "version": "1.27.2", "date": "2017-02-26T14:14:00-07:00", "title": "Needs fixing"}, {"content": "I love Pokemon and I love this app. It's brilliant. \nOnly problem is the latest update has made it bug out and crash but not loads.\nI think being able to battle opponents would be awesome. And trade items/Pokemon with others. I know it probably won't ever happen but it'd be really cool. :)", "rating": "5", "version": "1.27.2", "date": "2017-02-26T14:09:00-07:00", "title": ":)"}, {"content": "The new update has many glitches but the one that bothers me the most is that I can't open the app. Sometimes it glitches out straight away and other times it loads and then crashes and freezes. NOT helpful - please fix 😡", "rating": "3", "version": "1.27.2", "date": "2017-02-26T14:03:00-07:00", "title": "Glitches"}, {"content": "Pokemon go keeps freezing and i cant catch Pokemon or spin pokistops and this is also happening to a lot of my friends so if not fit reporting to app stores ok Plz fix because it is a really good game.", "rating": "1", "version": "1.27.2", "date": "2017-02-26T09:50:00-07:00", "title": "Cant do things"}, {"content": "SH1T", "rating": "1", "version": "1.27.2", "date": "2017-02-26T05:54:00-07:00", "title": "Dog poo"}, {"content": "Game won't load after the new update! Total joke!", "rating": "1", "version": "1.27.2", "date": "2017-02-26T04:30:00-07:00", "title": "Lame"}, {"content": "The Watch app has stopped picking up Pokéstops. It often doesn't register km's walked and when it does it highly inaccurate. I have to reinstall it almost daily to get it to work on my Gen2 Apple Watch. Please fix!", "rating": "1", "version": "1.27.2", "date": "2017-02-26T04:16:00-07:00", "title": "Watch app is next to useless"}, {"content": "Pokémon go is a great game and when generation two came out, me and some of my family were going in Walks, the only exceptions are there's a few bugs that make the game crash from time to time and also I use a tracker app to find good Pokemon but it won't work anymore because of Pokémon go updating, I'm a level 31 and I would not have 2 dragonite's, 7 snorlax's, 2 lapras', and a lot more. I'd only have about 20 dratini candies if I never had the tracker. Overall this is a great game and don't listen to the 1 star reviews from people who sometimes don't know how to use grammar correctly.", "rating": "4", "version": "1.27.2", "date": "2017-02-26T02:50:00-07:00", "title": "Great game"}, {"content": "You can't even get into the game", "rating": "1", "version": "1.27.2", "date": "2017-02-26T02:41:00-07:00", "title": "Bad game"}, {"content": "I love this game so much. It's amazing. But it would be much better if there was a wider variety of Pokemon to catch in an area as it gets boring once you've evolved the same Pokemon around you.", "rating": "4", "version": "1.27.2", "date": "2017-02-25T17:44:00-07:00", "title": "Love"}, {"content": "i got pokemon go for gen 2 but on ios i cant sign in....... on andriod i can but fix ur stuff", "rating": "2", "version": "1.27.2", "date": "2017-02-25T15:28:00-07:00", "title": "Gen 2 great but"}, {"content": "Awesome, but an idea could me moves that you unlock from 'mega pokestops' there could be 2 of these in every town, and you get a chance to teach your Pokemon new moves, it could make battleing better, ADD TRADING !!!!", "rating": "5", "version": "1.27.2", "date": "2017-02-25T12:32:00-07:00", "title": "Awesome"}, {"content": "Hello! I love Pokemon go and played since release! My fave Pokemon are mew snorlax and areodactyal! I would love it if you could add in a team change  option like the nickname one as I chose my team wrong🙁. I hope you read this review !\nThanks!", "rating": "5", "version": "1.27.2", "date": "2017-02-25T11:02:00-07:00", "title": "TEAM CHANGE PLEASE"}, {"content": "So since the last update of the next 80 Pokemon or of my already caught have disappeared Inc my buddy vulpex:-(", "rating": "3", "version": "1.27.2", "date": "2017-02-25T10:29:00-07:00", "title": "Ok"}, {"content": "Can't even log in...", "rating": "1", "version": "1.27.2", "date": "2017-02-25T10:25:00-07:00", "title": "Bad Game"}, {"content": "😃😃👍👍👍👍👍", "rating": "5", "version": "1.27.2", "date": "2017-02-25T10:06:00-07:00", "title": "😃😃😃"}, {"content": "I USED TO HAVE AN ACOINT AN I ACIDENNTLY DELETED THE APP. I THEN GOT IT AGAIN AND TROES TO LOG IN BUT THERE WAS NOT A GOOGLE OPPTION AS THAT WAS WHAT I WAS IN ORINGANLY. PLEASE FIX THIS BUT OTHER THAN THAT GREAT GAME", "rating": "4", "version": "1.27.2", "date": "2017-02-25T09:33:00-07:00", "title": "PLEASE HELP"}, {"content": "I love this game but can you add trading with other players nearby as sometimes my friends want to trade", "rating": "5", "version": "1.27.2", "date": "2017-02-25T09:19:00-07:00", "title": "Yass"}, {"content": "I am trying to play it on my I pod and will glitch on to the home screen when I want to sign in and sometimes I cry and get mad so please fix it please please please 😰😰", "rating": "2", "version": "1.27.2", "date": "2017-02-25T08:50:00-07:00", "title": "Mean"}, {"content": "This is a good game for anyone interested in pokèmon but it won't let you buy coins and it deletes all of your pokèmon when you're away for more than a week so please fix that. Sometimes when you upgrade your bag, it takes the coins but doesn't upgrade. Also please fix.", "rating": "4", "version": "1.27.2", "date": "2017-02-25T07:19:00-07:00", "title": "Good Game for Pokèmon lovers! But..."}, {"content": "Usually working but today makes everything run away even pidgeys using Pokeballs,Greatballs,Ultraballs and won't let me access stops and gyms", "rating": "3", "version": "1.27.2", "date": "2017-02-25T06:43:00-07:00", "title": "Broken"}, {"content": "Buggy doesn't load up properly", "rating": "1", "version": "1.27.2", "date": "2017-02-25T06:02:00-07:00", "title": "Buggy"}, {"content": "I have been playing this game since July and am still impressed. Yes, it makes you go searching for Pokémon, but that's the aim of the game. Love that the new generation has just been added. Can't wait for fresh updates. Events need to start happening on a more frequent basis and last a little longer. Maybe once a month for a week where certain types of Pokémon are more common and you have to walk less to hatch eggs. Either way, this is still a great game.", "rating": "5", "version": "1.27.2", "date": "2017-02-25T05:44:00-07:00", "title": "Brilliant game"}, {"content": "This game is very good and very detailed and also I love this game but it lost all my progress everything got deleted when I went on holiday as they thought I was cheating", "rating": "5", "version": "1.27.2", "date": "2017-02-25T05:26:00-07:00", "title": "Pokémon"}, {"content": "Thanks for adding gen 2 don't listen to that gen wanna in the reviews it's one of the best games I've ever played", "rating": "5", "version": "1.27.2", "date": "2017-02-25T04:29:00-07:00", "title": "Great game"}, {"content": "It is addictive and not in a good way it is a rubbish game and takes up all your storage and makes your battery die really quick.", "rating": "1", "version": "1.27.2", "date": "2017-02-25T03:57:00-07:00", "title": "Rubbish💩"}, {"content": "I got ran over", "rating": "1", "version": "1.27.2", "date": "2017-02-25T03:49:00-07:00", "title": "Bs"}, {"content": "Got a new contract phone, downloaded app, had to start from the beginning as it had lost my log in details, went to catch a Pokemon and it flashed up with an 'error' message.\nVery disappointed with this app as I previously enjoyed using it. Please fix!!", "rating": "1", "version": "1.27.2", "date": "2017-02-25T03:15:00-07:00", "title": "Downloaded to new phone, doesn't work"}, {"content": "Pokémon go is a good game but PokéTracker makes it so much better because you get to see what's around us not like every where pointless playing Pokémon go now as not as interesting we need some help finding them!! 😡😡😡😡😡😡😡", "rating": "1", "version": "1.27.2", "date": "2017-02-25T02:38:00-07:00", "title": "Frustrating"}, {"content": "It's a great game especially now gen2 is out but I have a problem, when I load the game it freezes the screen and I can't do anything.plz fix", "rating": "4", "version": "1.27.2", "date": "2017-02-25T01:29:00-07:00", "title": "Plz fix"}, {"content": "I have to delete the app most of the time and reinstall it as it keeps on crashing when it starts.", "rating": "1", "version": "1.27.2", "date": "2017-02-25T00:40:00-07:00", "title": "Pokemon go crashes"}, {"content": "Needs more pokestops in the countryside and further out...", "rating": "1", "version": "1.27.2", "date": "2017-02-25T00:30:00-07:00", "title": "Meh"}, {"content": "Lol you put comers instead of corners on the gym paragraph", "rating": "1", "version": "1.27.2", "date": "2017-02-24T23:49:00-07:00", "title": "You put comers instead of corners on the gym paragraph😂😂"}, {"content": "Can we have the option to remove Gen 2 Pokemon? \n\nThis cash-grab ruined the entire franchise, as did subsequent generations as well. \n\nJust let us capture ALL the 150 originals.", "rating": "1", "version": "1.27.2", "date": "2017-02-24T16:00:00-07:00", "title": "Pokemon Go (Away!)"}, {"content": "When ever I get past the loading screen the game freezes never allowing me to do anything more than sit on a pure white", "rating": "1", "version": "1.27.2", "date": "2017-02-24T15:51:00-07:00", "title": "Won't load"}, {"content": "Since the last update it loads but the whole screen turns blue and none of the buttons work", "rating": "3", "version": "1.27.2", "date": "2017-02-24T11:02:00-07:00", "title": "Ok"}, {"content": "I typed in my account and it came up with \" please activate your account in order to play Pokemon go\"  I keep trying tell me what to do because I can't get mail SORT THIS OUT PLEASE", "rating": "2", "version": "1.27.2", "date": "2017-02-24T10:36:00-07:00", "title": "WTF happened"}, {"content": "Good game! I love it, but in local areas you don't get much Pokemon and only one poke stop. Please upgrade this.", "rating": "3", "version": "1.27.2", "date": "2017-02-24T09:51:00-07:00", "title": "Local Areas"}, {"content": "Every time you put out an update, I can't play the game! Seriously, I've worked in IT for 3 years and this isn't even hard to fix! I literally have to load the app no less than 5 times, I just tried 7 times and got bored after getting nothing but a white screen! I cant report it on the game as I can't get onto it! Pull your finger out and fix the game!!", "rating": "1", "version": "1.27.2", "date": "2017-02-24T09:26:00-07:00", "title": "Updates!!!!"}, {"content": "Great game gen 2 is a bit buggy but I don't care the only thing I want is trading so far so goooooooood it's such a good game it makes everyone walk and get exercise even my favourite YouTuber plays Pokemon GO it's the best game I know", "rating": "5", "version": "1.27.2", "date": "2017-02-24T07:54:00-07:00", "title": "I LOVE THE GAME"}, {"content": "The accuracy of distant walked in the game is a joke, walked over 5km with game open today and it says I walked under 2! Plus the egg hatching tables have been completely ruined since they added these 'baby' pokemon- now the 2km eggs are better than half the 10km ones! And they gradually made the Pokémon act more erratic so they can add a berry to prevent reduce and take up additional space in the limited bag we were given!", "rating": "1", "version": "1.27.2", "date": "2017-02-24T05:40:00-07:00", "title": "Getting worse and worse"}, {"content": "Whilst trying to make a purchase for pokecoins an error message came up saying something went wrong and could not be processed and to try again later. However the money for the purchase has been deducted from my account balance and I have not received the pokecoins I wanted to purchase. Needless to say as an every day player I am very disappointed and would either like my money returned or my game account credited with purchase I have paid for.", "rating": "4", "version": "1.27.2", "date": "2017-02-24T05:21:00-07:00", "title": "Poke coin purchase issue"}, {"content": "The tracker could be better found a snorlax other day couldn't find it at all there was no pokestops around so no tracker", "rating": "4", "version": "1.27.2", "date": "2017-02-24T05:01:00-07:00", "title": "Tracker issue"}, {"content": "App constantly crashing on the phone, and after the update never receive notifications of any nearby poke stops or Pokémon 😩😩\nHopefully they'll be an update to iron out the bugs soon.", "rating": "2", "version": "1.27.2", "date": "2017-02-24T00:27:00-07:00", "title": "Needs work"}, {"content": "First launch is fine, second launch, character doesnt load in and white frozen page, please fix!!", "rating": "2", "version": "1.27.2", "date": "2017-02-23T23:46:00-07:00", "title": "Crashing on iPhone 5"}, {"content": "The app isn't opening and I am quite annoyed and I have heard that this has happened too a lot of people please fix this fast!!!", "rating": "1", "version": "1.27.2", "date": "2017-02-23T17:23:00-07:00", "title": "App isn't opening"}, {"content": "I have updated the Pokemon app and it has deleted off everything we had and started from the beginning. Thank you. We have spent quite a bit of money on this.", "rating": "1", "version": "1.27.2", "date": "2017-02-23T15:05:00-07:00", "title": "Update"}, {"content": "Amazing game well thought out but this game has killed people and lead people to a near death. I am not bothered about the glitches but I am bothered about people's life. The good part is it will get people out of their houses and walk about and get healthy and fit.", "rating": "3", "version": "1.27.2", "date": "2017-02-23T14:18:00-07:00", "title": "It's a good game but..."}, {"content": "Same", "rating": "5", "version": "1.27.2", "date": "2017-02-23T13:39:00-07:00", "title": "Same"}, {"content": "Great game new gen 2 released which is great although I don't know when they are going to add trading and a few bugs but other than that it's great", "rating": "5", "version": "1.27.2", "date": "2017-02-23T12:48:00-07:00", "title": "A-M-A-Z-I-N-G 🙃🙃🙃"}, {"content": "Only for people who don't know how to live their life.", "rating": "1", "version": "1.27.2", "date": "2017-02-23T12:16:00-07:00", "title": "De-Press-ing"}, {"content": "I do enjoy playing this game. But an early the release of the generation 2 Pokémon the game crashes and freezes a lot. Now I can barely get on it", "rating": "3", "version": "1.27.2", "date": "2017-02-23T09:41:00-07:00", "title": "Freezes and crashes"}, {"content": "It is good fun for everyone because me and me mum go on walks catching Pokemon which makes us fit and when generation 2 came out we went straight out", "rating": "5", "version": "1.27.2", "date": "2017-02-23T09:34:00-07:00", "title": "Pokemon go"}, {"content": "This game wont stop glitching out when i load it up. The screen goes blue and i cant press anything, so i deleted the game and got i back and it worked once and then just went back to normal with the blue screen. Ive tried restarting the game but that doesn't work either.", "rating": "1", "version": "1.27.2", "date": "2017-02-23T09:20:00-07:00", "title": "Stupid Game"}, {"content": "Dosnt open on IPhone 4s it loads the game and when you get to walking around catching Pokemon etc it dosnt load it just kicks of the game", "rating": "4", "version": "1.27.2", "date": "2017-02-23T08:38:00-07:00", "title": "DISNT OPEN ON IPHONE 4s"}, {"content": "I've had very few problems with the new update - I may have to restart the app to get the map to load properly, but no other problems. It's great to have even more Pokémon to catch!! And having regular events like the Valentines & Christmas events adds an exciting dynamic.\nI'm hoping that breeding & PvP battling will be implemented within the next year, as well as the elusive legendary Pokémon!", "rating": "4", "version": "1.27.2", "date": "2017-02-23T07:13:00-07:00", "title": "Works fine & gen 2 is great!"}, {"content": "Excellent", "rating": "5", "version": "1.27.2", "date": "2017-02-23T07:10:00-07:00", "title": "Excellent"}, {"content": "When I start the game it doesn't load so every time I want to play it I always have to re download the app needs to be fixed", "rating": "1", "version": "1.27.2", "date": "2017-02-23T06:53:00-07:00", "title": "Doesn't load when I start it"}, {"content": "Need to bring in where people can change teams if they wanna", "rating": "5", "version": "1.27.2", "date": "2017-02-23T05:43:00-07:00", "title": "Good"}, {"content": "I like the idea of catching Pokemon in the real world it's a better chance for going out more, I want more games like this", "rating": "5", "version": "1.27.2", "date": "2017-02-23T05:34:00-07:00", "title": "Great game"}, {"content": "I played for like a month, caught some rare mons, spent some money on items and then yesterday I opened the app and all my progress has been deleted. I've checked how to fix it and it doesn't work. \ncan't believe these bugs still exist, how long have they had to sort this out? \nAlso I've contact Pokémon's help desk and they haven't been any help whatsoever.", "rating": "1", "version": "1.27.2", "date": "2017-02-23T04:59:00-07:00", "title": "All my progress was deleted"}, {"content": "App not opening only", "rating": "1", "version": "1.27.2", "date": "2017-02-23T04:53:00-07:00", "title": "Crashes"}, {"content": "I hate this game", "rating": "1", "version": "1.27.2", "date": "2017-02-23T02:51:00-07:00", "title": "Complain"}, {"content": "The only disappointment is as a passenger in a car I can't spin any poker stop", "rating": "4", "version": "1.27.2", "date": "2017-02-23T01:36:00-07:00", "title": "I like this game"}, {"content": "I just got the game and it wouldn't let me do anything on it I couldn't even get the starter Pokemon. It is also extremely slow and all it does is uses your mobile data.", "rating": "1", "version": "1.27.2", "date": "2017-02-23T01:29:00-07:00", "title": "Terrible"}, {"content": "When I look at all the reviews three quarters of them are it's a broken game but I've started playing again since gen 2 came out and not one freeze crash lag or any bug for that matter has happened.  \n\nPeople should be happy they can play Pokemon go again because gen 2 is out. But what do they do instead complain and ignore the fact their are over 80 new Pokemon to catch, clothing options, new berries and lots more new things added in the latest update.", "rating": "5", "version": "1.27.2", "date": "2017-02-23T01:22:00-07:00", "title": "Not as buggy as everybody says it is"}, {"content": "New ones are cool, and rotate the regionals!", "rating": "5", "version": "1.27.2", "date": "2017-02-23T01:12:00-07:00", "title": "New ones!"}, {"content": "Hey guys I have been playing a lot of Pokemon go on iPad but one day I was playing with my friend and a snorlax appeared but the app restarted and when I try to sign in to Google or Pokemon trainer club it restarts over and over and over again I need some help and niantic please fix this bug great game 4 stars. :)!", "rating": "2", "version": "1.27.2", "date": "2017-02-23T00:48:00-07:00", "title": "iPad version bug"}, {"content": "I got my 7th day streak and no evolution item", "rating": "1", "version": "1.27.2", "date": "2017-02-22T23:40:00-07:00", "title": "The worst game ever"}, {"content": "I had stopped playing this game due to these reasons and decided to give it another go and it was working nicely then new update hits and crashes everything again you really need to learn how to get your servers ready and update only when it will work and not annoy everyone", "rating": "2", "version": "1.27.2", "date": "2017-02-22T23:37:00-07:00", "title": "Issues loading logging in"}, {"content": "Please please please fix the watch app, forever cuts off, and you dont realise until ages after, by then youve missed out on so much, and when youre out of range of your phone then come back into its range, it should reconnect automatically", "rating": "4", "version": "1.27.2", "date": "2017-02-22T22:54:00-07:00", "title": "Very good game with too many bugs"}, {"content": "New update works fine now, everyone moaning about it not working before needs to get a grip. It's a huge update that would have a few problems because of the type of game. There is no lagging now and loads perfectly fine! \n\nSo glad I've stuck with it, as a user from the beginning. Have had many walks with my husband and friends, taken us back to our youth", "rating": "5", "version": "1.27.2", "date": "2017-02-22T22:08:00-07:00", "title": "Gen 2"}, {"content": "After I update new version, I can't log in, I try reset password but it said my detail not match, can help me?", "rating": "2", "version": "1.27.2", "date": "2017-02-22T21:57:00-07:00", "title": "New Version lost my Pokémon"}, {"content": "I'm a 90s child, watching the original series and having all the merchandise. However, just as before, the new pokemon spoil it for me! Wish there was an option to turn off the new set of Pokemon! Lost out with me until I see that option!", "rating": "2", "version": "1.27.2", "date": "2017-02-22T18:19:00-07:00", "title": "Was great before, I hate the new Pokemon!"}, {"content": "I've been playing daily since it came out last summer and still love this game, gets me moving like nothing else and Gen2 is out now :)", "rating": "5", "version": "1.27.2", "date": "2017-02-22T16:56:00-07:00", "title": "Brilliant game :)"}, {"content": "I have been trying to get into the game for days now but it doesn't work", "rating": "1", "version": "1.27.2", "date": "2017-02-22T15:41:00-07:00", "title": "I can't get into the game"}, {"content": "When it works great... but constant crashing and retarded log in process are killing this game...", "rating": "2", "version": "1.27.2", "date": "2017-02-22T15:19:00-07:00", "title": "Glitchy-puff"}, {"content": "It's true that the hype behind this game was amazing and the bad rap is unreasonable. \n\nThe fact this game is free to play makes the glitches a little more reasonable...and there are no Ads! \n\nThe battle system is different from the classic way, but it's innovation...it's a different game. \n\nThere have been some questionable updates and Gyms are now easier to build up as well as take down. It becomes a constant battle like your typical capture the flag/hill. \n\nThe new update with Gen II Pokémon is a welcomed one, coming in at the right time. It would of been really nice if we got increased item and Pokémon capacity.", "rating": "5", "version": "1.27.2", "date": "2017-02-22T15:18:00-07:00", "title": "A lot of negativity for no real reason"}, {"content": "It's awesome game that is ideal for a boring walk :D", "rating": "5", "version": "1.27.2", "date": "2017-02-22T14:53:00-07:00", "title": "Finally I GO out!"}, {"content": "Basically I try get into my account but it doesn't work it just says unable to authenticate yet my password is right. SORT IT OUT", "rating": "1", "version": "1.27.2", "date": "2017-02-22T14:20:00-07:00", "title": "0 if possible"}, {"content": "I accidentally signed out of the game and I can't sign back in with my Pokemon trainer account. Plz fix because I had a level 24 account. Plz fix", "rating": "1", "version": "1.27.2", "date": "2017-02-22T14:18:00-07:00", "title": ":("}, {"content": "if you dislike pokemon go, i personally think that you dont like pokemon altogether.", "rating": "5", "version": "1.27.2", "date": "2017-02-22T14:15:00-07:00", "title": "you have to like pokemon"}, {"content": "Keep getting banned on all the accounts I make and I do nothing wrong WORST GAME EVER", "rating": "1", "version": "1.27.2", "date": "2017-02-22T14:13:00-07:00", "title": "Terrible BANNED"}, {"content": "I love the game but it keeps freezing every time I go on the game so I have to reinstall the game and sign back in all the time", "rating": "4", "version": "1.27.2", "date": "2017-02-22T13:20:00-07:00", "title": "Pokémon go"}, {"content": "Takes a few goes to load then crashes on startup", "rating": "1", "version": "1.27.2", "date": "2017-02-22T12:50:00-07:00", "title": "App crashes on startup"}, {"content": "All Round Terrible App😡", "rating": "1", "version": "1.27.2", "date": "2017-02-22T12:46:00-07:00", "title": "Logged Me Out For No Reason😡😡"}, {"content": "Gg niantic", "rating": "5", "version": "1.27.2", "date": "2017-02-22T12:26:00-07:00", "title": "Really entertaining but regional Pokemon annoying as I'm never going to Asia to just get a farfeched"}, {"content": "Love the game but keeps signing me out", "rating": "2", "version": "1.27.2", "date": "2017-02-22T12:18:00-07:00", "title": "Confused"}, {"content": "Im looking at these 1 star reviews and I'm dying a little bit on the inside. What?!. This app is a dream come true! Sure it's had a few MINOR issues, but what app doesn't? Let's review the game itself. I can find bulbasaur in my garden, staryu on the beach, I might find a ghastly in the dark of night. I can hatch eggs by walking! WALKING! How many games make you want to get up and do some exercise? Not many. And this is absolutely brilliant for sightseeing. I was in Whitby the other weekend and I walked past a boulder in the road many times without a second thought, it wasn't until I decided to catch a few pokes till I discovered that this boulder was once used as a step to mount horses (thank you Pokémon go). I haven't known a world without Pokemon and this app brings them even closer in the most brilliant way. Even if you're not a pokegeek like me I recommend giving this app a whirl.", "rating": "5", "version": "1.27.2", "date": "2017-02-22T12:11:00-07:00", "title": "BEST GAME EVER!"}, {"content": "Unhappy with this app. I have spent money on this game for incubators. 4 times now the app has frozen whilst an egg has been hatching and i recieved nothing. Basically i have been stolen from.", "rating": "1", "version": "1.27.2", "date": "2017-02-22T12:02:00-07:00", "title": "Glitchy"}, {"content": "Good game but the only problem is in isolated places like where i live near theres no poke-stops, gyms or Pokemon\nIf more stuff could spawn or be around isolated placed that would be great", "rating": "4", "version": "1.27.2", "date": "2017-02-22T11:41:00-07:00", "title": "AWESOME"}, {"content": "The special evolution items has a POOR appearance rate... Also couldn't load in the game is desperate...", "rating": "1", "version": "1.27.2", "date": "2017-02-22T11:40:00-07:00", "title": "What they want for the game?"}, {"content": "I like peanut brunch bars, they are tasty", "rating": "5", "version": "1.27.2", "date": "2017-02-22T11:16:00-07:00", "title": "Tasty"}, {"content": "This game is such an incredible game that is addictive and gets you outside. Love it and will continue to play it!", "rating": "5", "version": "1.27.2", "date": "2017-02-22T11:09:00-07:00", "title": "Pokèfun"}, {"content": "Bad technical support!!!!\n\nIf you have any problems with your account, don't suspect a reply apart from an automated email that repeats itself!!!", "rating": "1", "version": "1.27.2", "date": "2017-02-22T11:05:00-07:00", "title": "Bad technical support"}, {"content": "So I have been playing Pokémon since the British release and it has been great until now!\nAs of now if I want to hear a Pokémon's cry it sounds like the audio is muffled, especially pikachu as it sounds like it is saying \"PIKA..U\" instead of the cute \"pikachu\" cry please sort this!!", "rating": "4", "version": "1.27.2", "date": "2017-02-22T10:54:00-07:00", "title": "Audio 🎧"}, {"content": "Every time I log on to pòkemon go I get banned for no reason", "rating": "1", "version": "1.27.2", "date": "2017-02-22T10:28:00-07:00", "title": "Banned"}, {"content": "You should add more pokestops/gyms for players in rural areas because the only way for me to get mire pokeballs and battle in gyms is walking an hour away.\nAnd maybe make it so you can remove the speed limit because during car rides or train trips it slightly bothers me , if its there in the first place means your saying people are dumb enough to play it will driving (even if they are . ) But anyways does are some recently asked questions and thanks again for G2 !", "rating": "4", "version": "1.27.2", "date": "2017-02-22T10:17:00-07:00", "title": "Thanks for G2 but..."}, {"content": "Ive been playing since it cam out and now it decides to forget my login details i nearly finished gen 1", "rating": "1", "version": "1.27.2", "date": "2017-02-22T10:15:00-07:00", "title": "Forgot login"}, {"content": "Hello , my starter  Pokémon have been spawning on top of each other and I can not catch them and it says there is no GPS signal although I am right next to the box in my house😰😰😰😰😰can u please help I really want to play .", "rating": "3", "version": "1.27.2", "date": "2017-02-22T09:04:00-07:00", "title": "Help"}, {"content": "I keep hoping that this will be fixed every time a new update comes out but it never fixes it. I have to reload a minimum of 10 times.", "rating": "1", "version": "1.27.2", "date": "2017-02-22T08:55:00-07:00", "title": "Blank screen"}, {"content": "I cannot even login", "rating": "1", "version": "1.27.2", "date": "2017-02-22T05:44:00-07:00", "title": "Can't login"}, {"content": "One I can't go on my account second I forgot my password and now can't get it back\n\nI don't like this game that much", "rating": "2", "version": "1.27.2", "date": "2017-02-22T04:33:00-07:00", "title": "Big fat problems"}, {"content": "Love the new gen 2 when i can get on my game, takes me hours to load game up play for a bit then kicks me off and takes hours again to load...please sort this out as i am missing playing the game 😞", "rating": "3", "version": "1.27.2", "date": "2017-02-22T04:32:00-07:00", "title": "Updated now crashs"}, {"content": "Best game ever , now gen2 come out it's really fun and enjoyable👍", "rating": "5", "version": "1.27.2", "date": "2017-02-22T03:59:00-07:00", "title": "LOVE IT"}, {"content": "I sat there fighting my gym wanting to put my Pokemon there and when I could put it there someone else put it there!! Can you at least put something like \"winners have priority\" over all the game is fun I'm upset that you nerfed down all my three lapras which I used my candies to power them up and everything. Chansey and Blissey is just too OP and I know it's good to have one but it's hard to knock em out, back when I had a iPhone 4s which was two months ago the game did not load on the phone so I want someone to fix it so all iPhone 4 & 4s are able to play.", "rating": "3", "version": "1.27.2", "date": "2017-02-22T02:37:00-07:00", "title": "Gym"}, {"content": "I always enjoyed this game and since the gen 2 is out I can't because it keeps saying gps not found all the time so now I can't see the new update and all the different Pokemon added so please fix it ☹️", "rating": "1", "version": "1.27.2", "date": "2017-02-22T02:34:00-07:00", "title": "Fix it please ☹️☹️"}, {"content": "Sort it Pokémon can't catch any more pokemon", "rating": "1", "version": "1.27.2", "date": "2017-02-22T01:59:00-07:00", "title": "Sort it"}, {"content": "Can't get it to load and it breaks. I managed to get to the part where you get your first Pokemon but it crashes when you zoom in. Please sort this out", "rating": "3", "version": "1.27.2", "date": "2017-02-22T01:53:00-07:00", "title": "Sadly broken"}, {"content": "Game very poor unable to play as game keeps shutting down also had a lot of problems downloading the game much more I will remove game as getting fed up with it", "rating": "2", "version": "1.27.2", "date": "2017-02-22T01:24:00-07:00", "title": "Mrs"}, {"content": "Ipad: GPS signal not found (But is on!!)\nIphone: at the first start the app is turn off it self after randomly...", "rating": "1", "version": "1.27.2", "date": "2017-02-22T01:10:00-07:00", "title": "Rubbish"}, {"content": "As someone who's had Pokemon Go (and tbf deleted it as I did get bored) since the beginning the improvements they have now made make it so much more fun especially now they've released the second generation woo! Ok, it now crashes a lot but hopefully once they fix it it'll just be better. Give it a chance :)", "rating": "4", "version": "1.27.2", "date": "2017-02-22T01:02:00-07:00", "title": "Chill out moaning about it"}, {"content": "I am LOVING the new Pokémon not to mention there are less rattatas e.t.c and I have a lot of pokeballs!! This does need a few bug fixes but I still love this update!!\nPokémon Go is back, boi!!!", "rating": "5", "version": "1.27.2", "date": "2017-02-22T00:39:00-07:00", "title": "Amazing gen 2 update!!"}, {"content": "For the past few weeks my 7 day streak hasn't been working on pokestops, it hasn't even acknowledged it's the 7th day. It acknowledges all other days but day 7 and gives me no bonuses! The next day it resets to day 1! Getting really annoyed now", "rating": "1", "version": "1.27.2", "date": "2017-02-21T23:59:00-07:00", "title": "7 days streak isn't working"}, {"content": "A lot of people says it freezes and crashed but it hasn't done that since the update... I hope near summer they add friends or something to start up the hype again! My only problem is the way it looks and it takes a couple of seconds to fight Pokemon. Also you should be able to search for Pokemon with your camera so it's like the Pokemon are there!", "rating": "4", "version": "1.27.2", "date": "2017-02-21T23:34:00-07:00", "title": "I don't know why people are saying it crashes..."}, {"content": "I'm happy to say I recently updated the Pokémon GO app with the new UI and many different bugs was fixed \n\nexcept for one that issue that's iOS has been dealing with the one that's when you load up the Pokémon game once it goes past the loading screen and what appears we have all the icons but the loading icon is frozen in the moment and the rest of the white screen its pure white this particular bug has been going on for since four weeks now that's a month and I'm currently using the iPhone 5s this Will affect iPhone 5S upwards this bike came from three previous updates Ago and it still affected\n\nI hope the future updates will hopefully fix this issue\n\nBut there is a issues that hasn't been fixed since June 2015 that issue is how many Pokémon you can't hold in a gym because most people have between 15 to 24 and it's not fair for new player and old but I am happy that you put a cap on how much coins you can collect from the gym that is now  a hundred coins for 10 Gyms", "rating": "2", "version": "1.27.2", "date": "2017-02-21T21:48:00-07:00", "title": "I love the new Pokémon GO but..."}, {"content": "Since the last up date it has non stop crashed on start up or not loaded at all.\nPlease bring a fix out soon. Xxx", "rating": "1", "version": "1.27.2", "date": "2017-02-21T19:50:00-07:00", "title": "Crashing : an update fix needed"}, {"content": "This game is so boring like they try and add new things and it just becomes appalling.\n\nYours sincerely \nDisappointed Janis", "rating": "1", "version": "1.27.2", "date": "2017-02-21T17:34:00-07:00", "title": "It's irrelevant"}, {"content": "I am chronically ill and disabled so going out is challenging. Using Pokémon Go helps take my mind off the pain and motivates me to go out that much more often.\nIt's a lot of fun no matter who you are and is a great way to meet other players.", "rating": "5", "version": "1.27.2", "date": "2017-02-21T17:28:00-07:00", "title": "Exercise without boredom"}, {"content": "The game is much better now than in release but Niantic need to communicate and value their customers more", "rating": "4", "version": "1.27.2", "date": "2017-02-21T16:25:00-07:00", "title": "Need more stops and gyms in rural areas"}, {"content": "Pre gen 2 release the game was virtually bug free for me.. now the update has come there's too many things wrong. Firstly the gen 2 Pokemon were only on high spawn for around 24 hours, now I'm back to pidgeys and zubats non stop on my finder. The GPS location is almost always inaccurate with my avatar \"going too fast\" despite me being standstill. The glitch of KM roundup is still bad (where your km walked is not accurately tracked and jumps from say 0 - 3 in one go, not progressive.) Constantly slow when loading or even trying to load a Pokemon, half the time you select the Pokemon to catch and it says there's an 'Error' and the Pokemon disappears. This is more annoying when you re open the app and that same Pokemon is still available but you can't select it. \nI love this game but please do a bug fix soon or you'll end up losing players again as the bugs for gen 2 put people off.", "rating": "3", "version": "1.27.2", "date": "2017-02-21T16:05:00-07:00", "title": "Great Game but constant bug fixes needed"}, {"content": "The update is awesome but can have some improvements to the game sometimes people's glitches because of their phone or something keep it up the work don't worry about the bad reviews.", "rating": "4", "version": "1.27.2", "date": "2017-02-21T16:04:00-07:00", "title": "The update"}, {"content": "Judging by the speed of this thing, u should probably have iOS 1,000,000 for it to work smoothly. Oh hang on, IT HASNT BEEN INVENTED!!!\nUve ruined a good game niantic.", "rating": "1", "version": "1.27.2", "date": "2017-02-21T15:46:00-07:00", "title": "Crashes. All the time"}, {"content": "Current version crashes continually. I love Pokemon go but this is unbearable!", "rating": "1", "version": "1.27.2", "date": "2017-02-21T15:40:00-07:00", "title": "Crashing"}, {"content": "Since the update, it takes longer to load up and keeps freezing. I love playing this game but really frustrated that it keeps freezing. Please get it sorted😁\nU would of got 5 stars if u can get onto it without no problems", "rating": "3", "version": "1.27.2", "date": "2017-02-21T15:39:00-07:00", "title": "Keeps freezing😡"}, {"content": "After one of the Christmas updates the app would no longer work on IOS8 despite it still claiming it was supported. After updating recently it opens again now. Occasionally. Very occasionally! It is incredibly infuriating that this far into the game's life cycle it is still the glitchiest game I have ever tried.\nGood base game but shocking support", "rating": "1", "version": "1.27.2", "date": "2017-02-21T15:20:00-07:00", "title": "Temp review"}, {"content": "Games great apart from the white screen I keep getting repeatedly and random kick outs", "rating": "2", "version": "1.27.2", "date": "2017-02-21T15:14:00-07:00", "title": "When's the white screen getting fixed"}, {"content": "Worst think that could happen for now its add that new silly pokemons , the only person its like it now is my 4 year old daughter ..", "rating": "3", "version": "1.27.2", "date": "2017-02-21T15:08:00-07:00", "title": "New pokemons useless"}, {"content": "Really good game, love the new gen 2. \nBut the Apple Watch app doesn't seem to update KM it's says at 0 whilst walking. The only way to tell it's working is to keep checking the eggs. Please fix it!", "rating": "4", "version": "1.27.2", "date": "2017-02-21T15:01:00-07:00", "title": "Apple Watch isn't working"}, {"content": "Watch app now doesn't work for more than 30 seconds.", "rating": "1", "version": "1.27.2", "date": "2017-02-21T13:23:00-07:00", "title": "Watch app still broken"}, {"content": "Good game but crashes frequently; recently lost all my progress w buddy when did this which is frustrating", "rating": "3", "version": "1.27.2", "date": "2017-02-21T13:17:00-07:00", "title": "Buggy"}, {"content": "I love the game but the new update is so glitchy", "rating": "2", "version": "1.27.2", "date": "2017-02-21T12:58:00-07:00", "title": "Good but glitchy"}, {"content": "Like the new pokemon but far too many swinubs", "rating": "4", "version": "1.27.2", "date": "2017-02-21T12:21:00-07:00", "title": "too many swinubs"}, {"content": "Pokemon go is a very entertaining game. I highly recommend that you download it.", "rating": "5", "version": "1.27.2", "date": "2017-02-21T11:53:00-07:00", "title": "Incredible"}, {"content": "Since this latest update the app won't load up....it needs to be fixed asap", "rating": "1", "version": "1.27.2", "date": "2017-02-21T11:51:00-07:00", "title": "New Update doesn't work"}, {"content": "...every time I open the app, it crashes or doesn't load at all. Takes several attempts before it runs properly. Sort in the next update please!", "rating": "2", "version": "1.27.2", "date": "2017-02-21T11:29:00-07:00", "title": "Love the new Pokémon, but..."}, {"content": "I've updated the app and it doesn't load...I've put a second star because it's a great game, but please sort this problem out, I tried re-installing it and after one time I opened it, it wasn't working anymore :(", "rating": "2", "version": "1.27.2", "date": "2017-02-21T11:23:00-07:00", "title": "It won't load -_-)"}, {"content": "Is there a reason that the app doesn't open, since the new update?", "rating": "1", "version": "1.27.2", "date": "2017-02-21T11:21:00-07:00", "title": "App won't open..."}, {"content": "Absolutely brilliant game ignore the people that say it's slow and crashes It doesn't so definitely get", "rating": "5", "version": "1.27.2", "date": "2017-02-21T10:11:00-07:00", "title": "Brilliant"}, {"content": "It's quite unfair to rate the App 1 star when just because you're having that problem, it does not mean it's the games fault. My group of friends from work and I have had no issues since the update came out, the game runs smoothly. For that I give it 5 stars, hoping it makes Niantic keeps investing their money on this well created game.\nRegards", "rating": "5", "version": "1.27.2", "date": "2017-02-21T09:42:00-07:00", "title": "Unfair to rate 1*"}, {"content": "Gave me cancer! After all the poor updates and lack of community awareness I come back to see if any things changed and nope, the app is still getting worse. Simply adding some overdue gen2 and the app won't stay open longer than 10 seconds now. Developers are on crack with all the money their cancer patients have been tricked into giving them. \n\nFINALLY a watch app.... but we can't catch Pokèmon like advertised at the original announcement!! Wow, Niantic are great at finding ways to disappoint everyone, false advertising at its finest. \nIf they're still fixing 'minor text' issues this late into development I think they should hand this over to a responsible dev team. \n\nNo effort being put into this game at all, still no watch app. \nWorst developer ever, takes months to add simple features like multiple candy selection or km count but still can't fix the audio issue or implement a tracking system that is actually usable. ALSO NO APPLE WATCH APP YET!!!! Despite Niantic making the announcement on the biggest stage they could find, absolute money grabbers. \n\nNew edit: \nToo little, too late! Pretty poor nearby system, gyms are still useless and no development of the game has happened at all. No Apple Watch app either which is half the reason I bought one, thanks Niantic, the least community based company ever. If you can't develop a decent app or understand your actual audience give this to somebody else. Screw Niantic for ruining my favourite franchise and being money grabbing trolls. \n\nHALLOWEEN UPDATE WHY!\nSo this months useless update has not only not added any useful features, it's made the app worse. Battery saver renders my screen useless and remains black and having the app open makes my audio like Spotify and SoundCloud too quiet too hear, even though I have all audio off in the game :( if I'm doing my usual 10km commutes I 100% choose music and podcasts over the cancer that is Pokémon go. \n\nNo updates are better than these useless 'updates'. If it's taken this long to simply change egg colours I doubt we'll see any useful updates in our lifetimes. \nRuined a lot of people's childhoods and the massive potential of the IP. \n\nSell outs who've spent all this time taking Apples money instead of fixing the one thing that made this game playable (nearby/sightings).  \nSo much potential with one of the biggest fan followings to date and it's all being destroyed by poor/non existent communication and foolish choices in updates. \nThey don't deserve the audience they've gathered.", "rating": "1", "version": "1.27.2", "date": "2017-02-21T09:39:00-07:00", "title": "Always getting worse - Money Grabbers"}, {"content": "Constantly crashing! App stays open in background even after I've closed it down completely. So annoying, please fix!", "rating": "3", "version": "1.27.2", "date": "2017-02-21T09:34:00-07:00", "title": "Crashes!"}, {"content": "Excellent update! It would be awesome if there were quests to do during the day.", "rating": "5", "version": "1.27.2", "date": "2017-02-21T09:07:00-07:00", "title": "Love the new Pokémon!"}, {"content": "It doesn't let me open the app and it really pisses me off cause I can't use it on my phone please fix it 😓", "rating": "1", "version": "1.27.2", "date": "2017-02-21T08:55:00-07:00", "title": "Not working"}, {"content": "Just evolved an Eevee to a Umbreon and it's given me a Rainer. Not impressed at all", "rating": "1", "version": "1.27.2", "date": "2017-02-21T07:16:00-07:00", "title": "No good Pokémon"}, {"content": "Was a good game until the latest update, since the update the app closes on its own about 5-10 times and crashes repeatedly, starting to get a hassle and annoying to play the game now, spend money on the in app purchases and can't even play the game properly due to it closing all the time.", "rating": "1", "version": "1.27.2", "date": "2017-02-21T06:56:00-07:00", "title": "Crashing and app closing all the time"}, {"content": "I would rate it zero hut I can't I don't see the point in this game it is rubbish and a complete whaste of space.", "rating": "1", "version": "1.27.2", "date": "2017-02-21T06:55:00-07:00", "title": "SO BAD"}, {"content": "My map screen goes blank very often after the update. Also, there is a bug where the ball disappears into the ground after one or two failed catches. You can only see it when it bobs up. Please fix these bugs!!!", "rating": "1", "version": "1.27.2", "date": "2017-02-21T06:51:00-07:00", "title": "Please fix bugs"}, {"content": "The app is good but 4/5 times the app force closes to home screen. The apple watch integration has got sloppy. It doesn't stay connected and crashes the iPhone app if you load it at same time. Both these issues need fixing and maybe even beta testing before going live.", "rating": "3", "version": "1.27.2", "date": "2017-02-21T06:22:00-07:00", "title": "Good but crashes on iPhone and watch"}, {"content": "This app started downloading and has been stuck on waiting for about a week now! What a joke. I want it off my phone but it won't delete!! Seriously Pokemon go. You need to get off my phone! Now I just have a dead app taking up memory and unable to get rid. Brilliant.", "rating": "1", "version": "1.27.2", "date": "2017-02-21T06:12:00-07:00", "title": "Broke & unable to delete"}, {"content": "In defence of Pokemon you don't have to hate on a game just because it's not trending or fashionable anymore. I personally think that this game is great. It brings people together again.  It is a light hearted game that is looked upon in shame. I love it.", "rating": "5", "version": "1.27.2", "date": "2017-02-21T05:18:00-07:00", "title": "Great."}, {"content": "The GPS Signal can u fix it it always says GOS SIGNAL NOT FOUND I'm in the car right now and trying to play Pokémon Go and guess what pops up GPS SIGNAL NOT FOUND just fix it otherwise I will put 3 star rating so step up ur game", "rating": "3", "version": "1.27.2", "date": "2017-02-21T04:49:00-07:00", "title": "GPS Signal"}, {"content": "Every time I try to catch a Pokemon it turns of I absolutely hate it so I hope you could fix then please", "rating": "1", "version": "1.27.2", "date": "2017-02-21T04:44:00-07:00", "title": "BUGS NEED FIXING"}, {"content": "Very well , nice improvement since last time I did play. Thanks a lot .", "rating": "5", "version": "1.27.2", "date": "2017-02-21T04:04:00-07:00", "title": "Pokémon go update"}, {"content": "Gen 2 is great and it runs perfectly for me no lag or anything but it might just be people with iPhone 5s who experience these issues", "rating": "5", "version": "1.27.2", "date": "2017-02-21T03:37:00-07:00", "title": "Why is everyone moaning"}, {"content": "After the new update Pokemon Go won't load!! Can you sort an update out to fix it", "rating": "3", "version": "1.27.2", "date": "2017-02-21T03:00:00-07:00", "title": "BUG FIX"}, {"content": "I used to love playing this game; however, now my game won't load. Please fix this problem", "rating": "2", "version": "1.27.2", "date": "2017-02-21T01:33:00-07:00", "title": "My game won't load"}, {"content": "Just gives me a blank screen whenever I launch the app, can't even play it. Fix this.", "rating": "1", "version": "1.27.2", "date": "2017-02-21T01:04:00-07:00", "title": "Can't play it"}, {"content": "Every time I go on Pokemon go after the loading screen it freezes and im wondering what's going on", "rating": "5", "version": "1.27.2", "date": "2017-02-21T00:57:00-07:00", "title": "Is it a bug?"}, {"content": "Ok til last update - keeps crashing - realised now also that crashes when have something else open or in background", "rating": "1", "version": "1.27.2", "date": "2017-02-21T00:46:00-07:00", "title": "Keeps crashing"}, {"content": "Lit", "rating": "5", "version": "1.27.2", "date": "2017-02-21T00:40:00-07:00", "title": "Great game"}, {"content": "I've been playing since it came out and if I could change 1 thing it would be getting incubators every level except from that it's addicting af", "rating": "5", "version": "1.27.2", "date": "2017-02-20T23:56:00-07:00", "title": "Amazing"}, {"content": "Lots of bugs in this new version. I constantly find it either crashing on me, or opening and loading a blank white screen. Very disappointing. But given Niantic's previous responses, sure this will be rectified soon.", "rating": "1", "version": "1.27.2", "date": "2017-02-20T23:50:00-07:00", "title": "New version is very buggy and crashy"}, {"content": "This game has completely changed my life and has made me an all round healthier person. Since last summer this game has got me to go out and walk 500km to keep me physically fit and to help clear my head (while having fun). Before second generation came out my progress was getting slow, however with a new batch of Pokemon I don't see myself completely the game anytime soon so shall have a whole host more of fun.", "rating": "5", "version": "1.27.2", "date": "2017-02-20T23:34:00-07:00", "title": "Best game"}, {"content": "It's really great how we've gotten a G2 update but people in rural areas are still massively missing out! The nearest pokestop is up an enormous hill and through the woods which I'm fine with me as an adult but for my 7 year old brother it's a death sentence. Please please please remove the speed limit on pokestops or open pokestop suggestions. It's really not hurting anyone to remove the limit", "rating": "2", "version": "1.27.2", "date": "2017-02-20T20:17:00-07:00", "title": "Please remove the speed limit on pokestops"}, {"content": "This game is very addictive!!", "rating": "5", "version": "1.27.2", "date": "2017-02-20T16:34:00-07:00", "title": "Review"}, {"content": "stop being delusional guys, what do you expect when a massive update drops and loads of people want to get on, of course it will lag. i have great walks playing this game", "rating": "5", "version": "1.27.2", "date": "2017-02-20T16:23:00-07:00", "title": "pokemon go is sick"}, {"content": "Great to mace new Pokemon but why do I get so many requests to log in? The message reads 'login failure' before the game opens??", "rating": "4", "version": "1.27.2", "date": "2017-02-20T15:20:00-07:00", "title": "Latest version"}, {"content": "The game had so much potential but niantic managed to avoid fixing the poor parts and introduce gimmicks to purely to milk more cash from it. Really shameful how badly niantic have managed to ignore the user base, must be a bunch of execs sat in an ivory tower running the show there.", "rating": "1", "version": "1.27.2", "date": "2017-02-20T14:56:00-07:00", "title": "So disappointing"}, {"content": "I redownloaded the app yesterday and it worked fine until earlier. I go through the \"be aware of your surroundings\" screen and it goes on to the actual map but there's no map, person, ANYTHING!", "rating": "3", "version": "1.27.2", "date": "2017-02-20T14:46:00-07:00", "title": "Map in App not loading"}, {"content": "The game inself is still fun and the new Pokémons bring back the initial excitement into the games. However. The fact that many people hasn't even gotten all the first generation Pokémon (mostly likely because Niantics is being an uptight conservative company that is making a lot of money) and they have already released new Pokémon really really annoys me. I am sure they have collected plenty of information from us already, since many of us are using our gmail account as the login, I don't understand why the system is not physically possible to scan the pokedex and offer the ones that hasn't been caught as a rare treat to keep you going.", "rating": "3", "version": "1.27.2", "date": "2017-02-20T14:12:00-07:00", "title": "Missing something really obvious"}, {"content": "I read all these reviews of people complaining of glitches, game crashing etc, but I've yet to experience these issues. My Pokemon Go experience has been amazing so far and the game has still to let me down! Keep it coming 😁", "rating": "5", "version": "1.27.2", "date": "2017-02-20T14:10:00-07:00", "title": "Top Notch Game"}, {"content": "Love having the Gen2 Pokémon but there are some glitches ... when game opens frequently freezes on a white screen", "rating": "4", "version": "1.27.2", "date": "2017-02-20T14:09:00-07:00", "title": "Some glitches"}, {"content": "I think I was Softbanned, and as far as I know I haven't done anything wrong. I have missed out on a high level Grimer and Meowth and wasted Pokecoins and incense. I would really like a refund for all of the above.\nI sent a tweet but I thought this would be more suitable. Please please unban me. I really wanted the Grimer and Meowth.", "rating": "3", "version": "1.27.2", "date": "2017-02-20T12:55:00-07:00", "title": "REALLY?!"}, {"content": "Its a great game, gen 2 is out, its not \"dead\". You just follow trends and because hundreds of thousands dont play it anymore you choose not to well either way it never crashes for me or my friends or anyone i know so if yours apparently freezes... then i think your lying", "rating": "5", "version": "1.27.2", "date": "2017-02-20T12:24:00-07:00", "title": "What are you talking about ?"}, {"content": "Pokémon Go is an amazing game but people keep complaining about the game crashing and glitching It crashes for me too but I just reload the game instead of going on a rant while not even trying to fix the game I think that they will fix the game but until then stop complaining it's not like the game is 100% broken anyway I think this game is amazing and anyone that has an iPhone should get it!", "rating": "5", "version": "1.27.2", "date": "2017-02-20T11:48:00-07:00", "title": "Stop Complaining!!! 😡😫😩"}, {"content": "Very poor update. Performance is very bad. Constant freezing and crashing", "rating": "1", "version": "1.27.2", "date": "2017-02-20T11:38:00-07:00", "title": "New Pokemon but crashes and freezes"}, {"content": "Because I have always been a gamer and have always loved Pokemon I am very happy and excited with this game. I don't expect it to be perfect and without its glitches from time to time as with every game that is high on demand, but as far as the speed in fixing those issues I am very happy with how it's being looked into. \n\nEven more excited by the new changes and the new Pokemon generation additions and other holiday events which has made this game even more exciting. \n\nI feel that this is not just entertaining but also great for the health considering the amount of walking, it has also made socialising with friends more fun when you can go for walks together and share your insights on the game. \n\nI am not surprised that people that just played it for the hype have stopped playing just as fast as they started, but I'm glad that many of us have stayed loyal because we have hopes that this game will be incredible. It has truly made my dream as a Pokemon master to be coming true. Hehehe", "rating": "5", "version": "1.27.2", "date": "2017-02-20T11:16:00-07:00", "title": "Awesome game for Pokemon lovers"}, {"content": "I've loved playing this game and today it kept saying cannot find gprs and I clicked try again to let me enter the game and now it's logged me out and won't allow me to log back in why is this!?", "rating": "2", "version": "1.27.2", "date": "2017-02-20T10:34:00-07:00", "title": "Poor"}, {"content": "I feel that the gps is more accurate,there are new pokemons and something that maked me laugh a lot (is not from this update)is the fact that some of the pokemon you catch could be dittos hahahah didnt expected that at all.\nStill living pokemon go <3", "rating": "4", "version": "1.27.2", "date": "2017-02-20T10:33:00-07:00", "title": "Ok"}, {"content": "This game is great, I play it on my aunties phone all the time however every time after I fill in the birth the game freezes and lags me off, please fix it I wanna play pokèmon go its one of my favourite games 😊", "rating": "5", "version": "1.27.2", "date": "2017-02-20T10:19:00-07:00", "title": "Login"}, {"content": "After playing the game for a few seconds I am always getting the GPS Location not Found bar even though I am being tracked perfectly.", "rating": "4", "version": "1.27.2", "date": "2017-02-20T09:31:00-07:00", "title": "A Great Game but..."}, {"content": "Every since the new update had to reinstore and now can't get on it at all keeps tellin me that my email address not avoided little girl well upset as we both use to play it 2gether wen went out and about", "rating": "1", "version": "1.27.2", "date": "2017-02-20T09:18:00-07:00", "title": "Crashes"}, {"content": "Since the update it constantly crashes. Gen 2 Pokémon is good though.", "rating": "3", "version": "1.27.2", "date": "2017-02-20T09:08:00-07:00", "title": "Crashes all the time"}, {"content": "I love this game but I chose the wrong team so I keep trying again and again but it won't let me make a new acc this could all be fixed if u could change teams once after choosing my friend was on my phone and chose instinct when I wanted to be mistic NOW I CANT MAKE A NEW ACC", "rating": "2", "version": "1.27.2", "date": "2017-02-20T09:03:00-07:00", "title": "WHY"}, {"content": "Loving the new featured.  However every time I load the game it freezes worha. While screen.  The o lay way I can resolve this is to completely rest my phone.  I do g know if I'm the only one with this issue but it's becoming frustrating.  If it could be fixed that would be amazing", "rating": "3", "version": "1.27.2", "date": "2017-02-20T08:20:00-07:00", "title": "Needs improvements"}, {"content": "The app crashes with the new update, please fix !", "rating": "1", "version": "1.27.2", "date": "2017-02-20T08:11:00-07:00", "title": "App crashes!!"}, {"content": "GEN 2!!!!!!!!!", "rating": "5", "version": "1.27.2", "date": "2017-02-20T08:02:00-07:00", "title": "Finally!!!"}, {"content": "It won't let me log in with anything or its saying my password is wrong", "rating": "1", "version": "1.27.2", "date": "2017-02-20T07:09:00-07:00", "title": "Not letting me log in"}, {"content": "Struggles to open, now it won't recognise my log in, have one disappointed little boy 😐", "rating": "2", "version": "1.27.2", "date": "2017-02-20T07:03:00-07:00", "title": "Crashing"}, {"content": "I love this game, but so many bugs and issues, most of which have been present since day one, mar the experience.  Niantic would do well to have a couple of updates that focus on game stability.", "rating": "3", "version": "1.27.2", "date": "2017-02-20T05:54:00-07:00", "title": "A brilliant game in an awful state"}, {"content": "Was ok till the last update game either jumps out or freezes", "rating": "4", "version": "1.27.2", "date": "2017-02-20T05:27:00-07:00", "title": "Glitches"}, {"content": "This is a fun way to pass the time when out and about, but the app is terribly unstable, with repeated crashes. The update was also meant to bring stability between the Apple Watch app version and iPhone version connection, but again it's plagued with crashes on both devices and syncing is unreliable.", "rating": "3", "version": "1.27.2", "date": "2017-02-20T04:27:00-07:00", "title": "Unstable app, fun when it works"}, {"content": "A bit buggy on loading screen but that would probably get fixed soon but 2nd GEN!", "rating": "5", "version": "1.27.2", "date": "2017-02-20T04:14:00-07:00", "title": "2nd GEN!"}, {"content": "I still want to play game but it just won't stay in game keeps throwing me out n crashing I was obsessed with game but now it keeps freezing and throwing me out every few minutes I have an iPhone 4s so thought it was gonna work but it not and I really want to play it again", "rating": "2", "version": "1.27.2", "date": "2017-02-20T03:59:00-07:00", "title": "Used to love it"}, {"content": "Constantly crashes along with the Apple Watch app - even on the iPhone 7 plus it's doing it. Not good!", "rating": "1", "version": "1.27.2", "date": "2017-02-20T03:39:00-07:00", "title": "Apple Watch app and IPhone app keep crashing"}, {"content": "To think, i never thought pokemon go would become better but from the new gen 2 update, You will never find me of the game. But it is not just a regular game where you sit down all day doing nothing and just tapping a screen, you need to walk out side meaning it can be healthy! A healthy videogame where my parents wont tell me of for being in all day, wow just wow 😂😃👍", "rating": "5", "version": "1.27.2", "date": "2017-02-20T03:39:00-07:00", "title": "Best game ever"}, {"content": "Gen 2 Pokémon should be optional!", "rating": "1", "version": "1.27.2", "date": "2017-02-20T03:34:00-07:00", "title": "Update"}, {"content": "There needs to be an improvement as when you go on the game it can just go to blueish white screen which then you have to turn the game off and then go back on it and if your lucky it won't do it again and will go to the normal game.", "rating": "4", "version": "1.27.2", "date": "2017-02-20T03:22:00-07:00", "title": "It's good and addictive but"}, {"content": "Since the update the game keeps crashing, does it about 5 times in a row before working for a little while and then repeats the same process.", "rating": "1", "version": "1.27.2", "date": "2017-02-20T03:17:00-07:00", "title": "Crashes"}, {"content": "Watch app is very buggy. \nOpen app, press start and it starts counting. Works for about 30 seconds look back down and it's back on the start screen. Press start again and it does the same thing. Then I get the screen saying 'open Pokémon go on phone'.\nSince app has launched I've used it successfully twice.\nEnd up just using phone...\nPlease fix.\n\nUpdate 20/02/17\nWatch app still doesn't work after new update... I think it's worse if that is possible...", "rating": "2", "version": "1.27.2", "date": "2017-02-20T03:02:00-07:00", "title": "Watch app needs work..."}, {"content": "Pokemon go is a great game but saps my battery a lot and frequently crashes, but in the end it's a good game!", "rating": "4", "version": "1.27.2", "date": "2017-02-20T02:49:00-07:00", "title": "Battery"}, {"content": "Pokemon go is allot better now with all these Pokemon but it freeze's on the same screen ?", "rating": "5", "version": "1.27.2", "date": "2017-02-20T02:03:00-07:00", "title": "Niantic"}, {"content": "I can't log on with gmail anymore 😭😭😭😭😭😭😭😭😭😭😭", "rating": "1", "version": "1.27.2", "date": "2017-02-20T01:49:00-07:00", "title": "Gmail?"}, {"content": "Don't know wether this is a glitch in my game but I had a lot of my Pokémon erased?", "rating": "1", "version": "1.27.2", "date": "2017-02-20T00:07:00-07:00", "title": "Pokémon"}, {"content": "Gets to the play screen, freezes and shuts down. iPad mini", "rating": "1", "version": "1.27.2", "date": "2017-02-19T22:44:00-07:00", "title": "Loads then crashes"}, {"content": "I AM WARNING EVERYONE NOT TO DOWNLOAD THIS GAME AS IT CAUSES SO MANY ACCIDENTS WHEN CROSSING ROADS WHILE ON YOUR PHONE PLAYING THIS SHITTY GAME SO I AM WARNING YOU NOT TO DOWNLOAD!!!!!!!!!!!!", "rating": "5", "version": "1.27.2", "date": "2017-02-19T18:11:00-07:00", "title": "DONT DOWNLOAD THIS GAME😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡"}, {"content": "Although I like the new generation of Pokémon that has been added to the game, for some reason all of the Pokéstops on my map have disappeared. Otherwise, I love this experience of Pokémon.", "rating": "4", "version": "1.27.2", "date": "2017-02-19T17:31:00-07:00", "title": "I love the update but.."}, {"content": "Top notch! Lots of fun catching Pokemon with friends", "rating": "5", "version": "1.27.2", "date": "2017-02-19T16:38:00-07:00", "title": "Fun game"}, {"content": "I'm happy that gen 2 is finally out but now when I try run the app, it crashes and before I updated it, it worked just fine. Please fix this!", "rating": "2", "version": "1.27.2", "date": "2017-02-19T16:13:00-07:00", "title": "Keeps crashing!!!"}, {"content": "The game has broken after the update and now I can't sign in with my gmail account and I lost my level 27 account!", "rating": "3", "version": "1.27.2", "date": "2017-02-19T15:54:00-07:00", "title": "BAROKE"}, {"content": "Apart from everytime i load up the game the game goes white, freezes and then crashes, I completely love gen 2!", "rating": "1", "version": "1.27.2", "date": "2017-02-19T15:11:00-07:00", "title": "White Screen of Death"}, {"content": "I personally hate the new generation pokemon!! Im really gutted and will probably now stop playing the game as I grew up with the first generation, ive also not yet completed the first generation which is something I was very very keen on doing and I feel now with the extra god knows how many pokemon in this game will be increasiny harder! I think you should have an option on the inclusion of the second generation pokemon for us old schoolers who prefer the first 152!", "rating": "3", "version": "1.27.2", "date": "2017-02-19T14:46:00-07:00", "title": "Old school!!"}, {"content": "Don't take it seriously. All they care is people spending real money buying fancy sunglasses to wear in the game. No matter how good you play, they can screw all overnight just change everything. Don't waste you time walking around hunting, not worthy. Only make you feel like a joke.", "rating": "1", "version": "1.27.2", "date": "2017-02-19T14:30:00-07:00", "title": "Terrible game experience 7 months on"}, {"content": "I haven't been able to open the app since December 22nd. When I click on the app it crashes and closes without even getting to a loading screen. I have tried everything to resolve this issue. It has been months and nothing has been done to fix this problem. This is ridiculous!", "rating": "1", "version": "1.27.2", "date": "2017-02-19T14:12:00-07:00", "title": "Please fix this bug!!"}, {"content": "Very needed new variety, but the update broke the Apple Watch companion app", "rating": "3", "version": "1.27.2", "date": "2017-02-19T13:55:00-07:00", "title": "Mixed feelings"}, {"content": "When 10 seconds loaded up the game it says location not found and sometimes it don't load up. Getting bit fed up with now!!! 😡", "rating": "1", "version": "1.27.2", "date": "2017-02-19T13:36:00-07:00", "title": "No Working with new up date"}, {"content": "Two words sum this game up: \n1. Tedious \n2. Boring", "rating": "2", "version": "1.27.2", "date": "2017-02-19T13:26:00-07:00", "title": "Out of date gaming concept"}, {"content": "The game designed to get the creeps out their basements to find kids. I used to play all the time but it gets boring after a while so i uninstalled it.", "rating": "3", "version": "1.27.2", "date": "2017-02-19T13:14:00-07:00", "title": "Alright"}, {"content": "Spent £10 which they took but never received the coins for them. Refund me or sort out the purchase", "rating": "3", "version": "1.27.2", "date": "2017-02-19T13:10:00-07:00", "title": "In app purchases don't work..."}, {"content": "This game is one of my fravourite games ever. Without this game I wouldn't have become the Pokemon master I am now.\nPS:\nMy best Pokemon is Espeon.\nWoofTheDog.", "rating": "5", "version": "1.27.2", "date": "2017-02-19T13:04:00-07:00", "title": "ONE OF THE BEST GAMES EVER!!"}, {"content": "Good concept poor execution. Constantly crashing pokiestops not loading. Slow loading if at all!!!! Hopefully development on this will be quick and then adding to game play pvp create.\n\nAt the moment the game is really poor due to the os. Try it then bin it a load again in 6 months after all the hype and the game has time to be fixed 6 months on game still unstable very poor 1 update is stable and works well next can be very poor time is now against you namteck if not already to late", "rating": "2", "version": "1.27.2", "date": "2017-02-19T13:04:00-07:00", "title": "Oh well"}, {"content": "Cannot believe how angry this game has made me ! My iPhone 6 broke so had to use my iPhone 5 I reinstalled the app and it worked fine, once I closed the app and left it a while it won't come back on, just a blue screen that's constantly loading!! I used to live and breath this game but I'm so upset at how awful it performs now !", "rating": "1", "version": "1.27.2", "date": "2017-02-19T12:53:00-07:00", "title": "Best game ever...pfft it was !!!!"}, {"content": "For the password you have to have a number capital letter and a symbol which is ridiculous I'm 12 and found it to hard to set the stupid password up", "rating": "1", "version": "1.27.2", "date": "2017-02-19T12:33:00-07:00", "title": "Worst game ever"}, {"content": "I love this game, especially now that generation 2 is out. Any chance of a whole new game next with something else? Like that rumour about Harry Potter go, like collecting spells and potions, or just something like that. Amazing game anyway 👍", "rating": "5", "version": "1.27.2", "date": "2017-02-19T12:29:00-07:00", "title": "Great game"}, {"content": "I can use the app perfectly but when I go off the game I can't go back on it it's just a white screen and I need to delete it and get it again to go back on it. \n\nPlease read Niantic and fix this bug!!!!", "rating": "3", "version": "1.27.2", "date": "2017-02-19T12:25:00-07:00", "title": "Ok"}, {"content": "once i log in i am stuck on the loading screen forever....\niPhone 6", "rating": "1", "version": "1.27.2", "date": "2017-02-19T12:13:00-07:00", "title": "What are these servers???"}, {"content": "Every Time I try and load it it crashes, which is a super poop because I really wanted to play :( I hope the fix it soon", "rating": "1", "version": "1.27.2", "date": "2017-02-19T11:04:00-07:00", "title": "Crashes on loading"}, {"content": "Please!  \n\n        \\(0-0)/", "rating": "5", "version": "1.27.2", "date": "2017-02-19T10:58:00-07:00", "title": "Gen 2 pls!"}, {"content": "However, with each update the app becomes a battery rinser even with power save on & low power mode on...", "rating": "3", "version": "1.27.2", "date": "2017-02-19T09:56:00-07:00", "title": "Yay for Gen 2"}, {"content": "Constantly crashes since the last update. The watch crashes all the time but especially when you have the app open also. When you do get it going after many restarts if you spin a pokestop on the phone the watch crashes again.\nThe app also goes through a cycle of crashes and often has to be restarted up to 8 times to get it to finally work.\nI love the game but it's really hard work keeping it all going the last few days. Really need a bug fix update asap.", "rating": "3", "version": "1.27.2", "date": "2017-02-19T09:37:00-07:00", "title": "Constant crashes from both app and Watch"}, {"content": "A NOTE TO ALL YOU PEOPLE COMPLAINING  ON IPHONE 4. THIS GAME ISNT MADE FOR THAT IPHONE IT CLEARLY SAYS IN THE DESCRIPTION IPHONE 5 AND UP SO STOP COMPLAINING THIS GAME IS AMAZING", "rating": "5", "version": "1.27.2", "date": "2017-02-19T09:09:00-07:00", "title": "Brilliant game"}, {"content": "I love Pokémon as soon as I got the game I was obsessed with it now gen 2 has came out I'm too obsessed with it", "rating": "5", "version": "1.27.2", "date": "2017-02-19T08:37:00-07:00", "title": "GENERRATION 2"}, {"content": "The game won't load and keeps crashing for iPhone5, also, dead game", "rating": "2", "version": "1.27.2", "date": "2017-02-19T08:24:00-07:00", "title": "Crashes"}, {"content": "I love this game so much and the new update is so cool and makes the game even more enjoyable I defiantly recommend it", "rating": "5", "version": "1.27.2", "date": "2017-02-19T08:13:00-07:00", "title": "Amazing"}, {"content": "I think Pokémon go is a great game but it has to much errors a magmar spawned it said error and at the start it stays on a white screen when it finished loading up I still think it is an awesome game", "rating": "4", "version": "1.27.2", "date": "2017-02-19T07:40:00-07:00", "title": "Pokemon go"}, {"content": "This game is so much fun", "rating": "5", "version": "1.27.2", "date": "2017-02-19T07:35:00-07:00", "title": "Pokémon is awesome"}, {"content": "iPhone Review: 4/5\n\nPokémon GO is a great concept. You encounter familiar characters in the open world and it even gives us an incentive to go out and get some exercise. As a game, it's done far more than any other mobile game has done; it's helped us become more social, I've seen more people join up and play the game together than ever.\n\nAs someone who has played the original handheld games from Nintendo, I've found it to be a pleasant change. The new mechanics are easy to learn, and the gameplay stays largely faithful to the original material. It's something that both newcomers to the franchise and veteran players can enjoy. Barring from the very occasional login glitch, it's been a great experience as a whole.\n\nSo why the 2-star rating then? Well, there's the other side of the story.\n\n---\n\nApple Watch Review: 0/5\n\nThe experience on the Apple Watch is completely different, for the worse. For one, the game is the most unstable app I have ever had the displeasure to test. I open the app, start a play session, then check the device again after a while to find that ten times out of ten the app has crashed back to the watch screen, erasing all play progress up to that point. I have never finished a single play session that did not involve force-crashing and loss of data. And that's when the app can be launched properly in the first place.\n\nUsually when opening the app on Apple Watch one of three things can happen - either the app stays on the loading screen perpetually until the watch auto-sleeps (whereby it crashes back to the Home Screen upon wake), the app launches but fails to sync my data and displays a blank profile, or very occasionally it launches normally and loads my profile only to crash mid-gameplay. Crashing on the Apple Watch will also carry over to the iPhone, if I have the game running on both devices and it crashes on my watch, the process will also be forcilby terminated on the iPhone and any progress will be lost.\n\nThis issue can be replicated on a newly restored Apple Watch running on stock settings, and appears to be due to coding issues and not because of system resource limitations. It's very clear that Pokémon GO for the Apple Watch was rushed in development to make it in time for the iPhone 7 launch keynote appearance, and rushed once again for release in the 2016 holiday season. Without proper stability testing, the users are now paying the price for a rushed product.\n\n---\n\nOverall Rating: 2/5\n\nPokémon GO is a great idea to begin with. It helps us be more active, more social, and is generally a very enjoyable game in itself. Sadly, this is hampered by serious performance and stability issues that ruin the gameplay and interrupt the positive experience with frustration. If you want a social game that can be enjoyed by everyone, both novice and experienced in Pokémon, then look no further. However if you want to play on the go with the Apple Watch, give this a miss - it's not worth the frustration.\n\n---\n\nTested on:\niPhone 7 (iOS 10.2.1)\nApple Watch (WatchOS 3.1.3)", "rating": "2", "version": "1.27.2", "date": "2017-02-19T07:34:00-07:00", "title": "It's a Love-Hate Relationship."}, {"content": "All in all I think with the release of generation 2 of Pokemon the game has been saved.\nThings I don't understand!\n1: why didn't you increase the Pokémon storage by around 100 to account for the new Pokémon?\n2: why (still) have we still not got the full 151 of Pokémon and other legendaries as well?\n\nDon't get me wrong the game is better now and a lot of people are satisfied me being among them but with the major delay on legendaries and trading features the public would like a little more insight into why these features haven't been released. \n\nGood game tho anyone can and should play.", "rating": "4", "version": "1.27.2", "date": "2017-02-19T07:28:00-07:00", "title": "Good but!?"}, {"content": "Since the new update the game wont let me load on!! It just goes to an white screen😡😡please fix", "rating": "2", "version": "1.27.2", "date": "2017-02-19T07:20:00-07:00", "title": "New update"}, {"content": "Everytime I try to open the app the screen goes blue... I can hear the music but that is all!! :/ poor times!! Please sort:D", "rating": "2", "version": "1.27.2", "date": "2017-02-19T06:33:00-07:00", "title": "Will not load!"}, {"content": "Don't have 2g 3G or 4g so can't play", "rating": "5", "version": "1.27.2", "date": "2017-02-19T06:24:00-07:00", "title": "Great game if I could play it"}, {"content": "Wow gen 2 release, maybe I'll check it out for first time in ages...oh wait, crashes everytime I open it.", "rating": "1", "version": "1.27.2", "date": "2017-02-19T06:21:00-07:00", "title": "Crashes since update"}, {"content": "I was playing it this morning and when I got home it lagged and went of and I can't sign in with my trainer club account which has an almost complete Pokedex 😭Please make me able to sign in to my account", "rating": "4", "version": "1.27.2", "date": "2017-02-19T06:18:00-07:00", "title": "Good but.."}, {"content": "I would rate this game 5 stars if you added Pokémon centres 😍😜😝😂", "rating": "4", "version": "1.27.2", "date": "2017-02-19T06:17:00-07:00", "title": "Cool game"}, {"content": "I was getting sooo fed up of the previous version (gen 1) finally they added gen 2 now I can enjoy more adventures!!", "rating": "5", "version": "1.27.2", "date": "2017-02-19T05:50:00-07:00", "title": "Yaaaahooo!!😁👌"}, {"content": "This game is good because it has good graphics and it is so fun when I am bored This game should be game of the year and it is so good to play", "rating": "5", "version": "1.27.2", "date": "2017-02-19T05:35:00-07:00", "title": "Excellent game 👍🏻👍🏻👍🏻👍🏻"}, {"content": "Ever since Gen2 came out I've played the game every day for 1hr minimum!!\nThank You Niantic!!", "rating": "5", "version": "1.27.2", "date": "2017-02-19T05:10:00-07:00", "title": "The best game on the App Store!!"}, {"content": "Was so excited for gen 2 and had been anticipating it for so long but as soon as I re-downloaded the game it kept freezing and shutting off so I can't even play it! Super disappointed and really hope it gets fixed. Loved the game but now I can't play.", "rating": "2", "version": "1.27.2", "date": "2017-02-19T05:05:00-07:00", "title": "Was so excited, now so disappointed."}, {"content": "This is a great game I totally recommend it but sometimes it can be annoying because there a no rare spons and when you run out of Pokéballs that is annoying to", "rating": "4", "version": "1.27.2", "date": "2017-02-19T04:58:00-07:00", "title": "I love it 😍"}, {"content": "I think the new update is great however all of a sudden the poke stops aren't working and every time I try to catch a pokemon it flees! Even if it's a 10cp", "rating": "3", "version": "1.27.2", "date": "2017-02-19T04:49:00-07:00", "title": "Lagging a lot"}, {"content": "The game is good but does not work on iPad still. GPS signal not found. I'm using an iPad without a sim for reference.", "rating": "2", "version": "1.27.2", "date": "2017-02-19T04:32:00-07:00", "title": "Good games but not for iPad"}, {"content": "Whenever the Ts and Cs come up, I press accept, then my game crashes. I've uninstalled and reinstalled, but same problem", "rating": "2", "version": "1.27.2", "date": "2017-02-19T04:28:00-07:00", "title": "Crash after crash"}, {"content": "You need to make it compatible for iPhone 4 and below. All my friends have it and it makes me jealous how they always talk about it but I'm unable to play because the app keeps crashing, lagging and it freezes when you try to catch a Pokemon- I can't even catch my starter! Please fix! :(", "rating": "1", "version": "1.27.2", "date": "2017-02-19T04:09:00-07:00", "title": "Needs to be compatible"}, {"content": "So the game loads up most of the time but it never shows any Pokémon. It vibrates and shows me glowing white orbs on my map where Pokémon should be appearing but they never do :/", "rating": "2", "version": "1.27.2", "date": "2017-02-19T04:05:00-07:00", "title": "New update :/"}, {"content": "I love this game but since the update it just crashes endlessly. Every single time!", "rating": "3", "version": "1.27.2", "date": "2017-02-19T03:48:00-07:00", "title": "Freezes"}, {"content": "THIS APP TELLS ME TO WRITE EMAIL I DO IT OVER AND OVER AGAIN IT NOT LET ME!!!", "rating": "2", "version": "1.27.2", "date": "2017-02-19T03:35:00-07:00", "title": "Wth is this!?!!!?"}, {"content": "Since the update I've struggled to actually play, it crashes and has failed to load almost every time. Such a shame.", "rating": "1", "version": "1.27.2", "date": "2017-02-19T03:28:00-07:00", "title": "Was fun, now just crashes!"}, {"content": "Yet again won't even open up on my data or wifi???", "rating": "1", "version": "1.27.2", "date": "2017-02-19T03:24:00-07:00", "title": "Rubbish"}, {"content": "Gets past the loading new year screen then screen glows a blue colour and just won't load past that", "rating": "2", "version": "1.27.2", "date": "2017-02-19T03:23:00-07:00", "title": "Not loading"}, {"content": "The game will only run once. After closing it down and reopening it, it will simply freeze after the loading screen. The HUD is visible and so is the Pokeball loading screen. The screen will remain white until the app is deleted and re-installed. Please fix this bug.", "rating": "1", "version": "1.27.2", "date": "2017-02-19T03:19:00-07:00", "title": "Good game, But..."}, {"content": "Played it the other day for an hour perfectly now it won't even load up sort it out or you're loss what players you have left", "rating": "5", "version": "1.27.2", "date": "2017-02-19T02:40:00-07:00", "title": "Won't load up right"}, {"content": "amazing game love playing it but would be better if you can play with no wifi", "rating": "5", "version": "1.27.2", "date": "2017-02-19T02:34:00-07:00", "title": "amazing"}, {"content": "It keeps on asking me to send an email to my mum which I did but when she went to make an account it was great until it asked her for a password which she entered multiple times and it constantly said that the password was already taken!!!😡 NOT HAPPY!😡😡😡😡😡😡😡😡😡😡😠😡😡😡", "rating": "1", "version": "1.27.2", "date": "2017-02-19T02:34:00-07:00", "title": "Can't even play the damm thing!!!😡😡😡"}, {"content": "I have 4G wifi,doesn't work.when it does,first 2 mins crashes.Improve PLZ.Or i will delete the app and let it suffer", "rating": "1", "version": "1.27.2", "date": "2017-02-19T02:04:00-07:00", "title": "IMPROVE PLEASE"}, {"content": "An incredible game, needs a lot of new features and the present ones need adjusting, but overall highly recommended.", "rating": "5", "version": "1.27.2", "date": "2017-02-19T02:03:00-07:00", "title": "Amazing but buggy"}, {"content": "Gen 2 is out and I finally got my account back can't wait to catch new Pokemon !!", "rating": "5", "version": "1.27.2", "date": "2017-02-19T01:50:00-07:00", "title": "So happy (:"}, {"content": "It's nice to see new Pokémon but I'm still trying to collect the original set..... my only issue with the update is the support for the Apple Watch, the game app crashes when using the watch app. Quite frustrating!!! Hopefully they will patch it in an update so I can carry on collecting Odish & Magikarp", "rating": "2", "version": "1.27.2", "date": "2017-02-19T01:19:00-07:00", "title": "Apple Watch issues"}, {"content": "Pokémon GO is an amazing app that has taken me out to lots of new places, and I would recommend it. It, like anything else, has flaws, but you have to remember that it is still in its beta stages; the main game isn't finished yet. Plus, most of the bugs that were in the original release have been fixed or eradicated -- I haven't had the game crash since its launch month!\n\nAll of the updates are amazing. We should be glad that Niantic continue updating this game, people! 😀\n\nGen 2 was an excellent way to hype things up again. I'm loving all of the new Pokémon.", "rating": "5", "version": "1.27.2", "date": "2017-02-19T01:07:00-07:00", "title": "Great App, Definitely Recommended"}, {"content": "With Gen 2 release it seems the Apple Watch hasn't been updated with Gen 2 yet. This causes the watch to crash the mobile app when encountering Gen 2 Pokemon in the app. Either don't start a workout on the watch or don't play the app for now. I'm sure a patch for this will be released soon.", "rating": "4", "version": "1.27.2", "date": "2017-02-19T01:04:00-07:00", "title": "Apple Watch crashes iPhone app"}, {"content": "Would have been four star but the update that put a speed limit on everything ruined the game for passengers.", "rating": "2", "version": "1.27.2", "date": "2017-02-19T00:22:00-07:00", "title": "The speed limit ruins it for passengers"}, {"content": "Keeps crashing like the previous version(s). Takes a few attempts to load before you can play and by then you would've lost interest.", "rating": "2", "version": "1.27.2", "date": "2017-02-18T23:52:00-07:00", "title": "No good"}, {"content": "This app is brilliant true a times the game can have a mini freak out when say 4G drops to 3G but it's not a game breaker at all", "rating": "5", "version": "1.27.2", "date": "2017-02-18T19:07:00-07:00", "title": "A game all Pokemon fans can enjoy"}, {"content": "It doesn't work, and hasn't worked for months. It crashes on opening every time.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T18:45:00-07:00", "title": "Crashes"}, {"content": "In a few places there are very little to no pokestops around some people and I only have one and then other places have like a million. So please to make it more fun add a few more pokestops to places like Branston England", "rating": "4", "version": "1.27.2", "date": "2017-02-18T18:32:00-07:00", "title": "Good but"}, {"content": "The game constantly freezes on opening. Fix what's wrong. Stop taking people's money until you fix your game. I will continue to give this negative reviews until you do something.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T17:14:00-07:00", "title": "Frozen blue screen = unplayable game"}, {"content": "Although the new updates are awesome, and trust me I'm loving it. I'm having some bugs when opening the app that I never encountered before, it just closes it straight away after clicking. Also has just quit randomly. If you'd be able to fix this asap that would be great!", "rating": "5", "version": "1.27.2", "date": "2017-02-18T17:14:00-07:00", "title": "Bugs"}, {"content": "I love this game, I really do but this current version has so many bugs and 95% of the time wont even open now which is very annoying and I've lost all my streaks because of it. It irritates me (as many other players have mentioned) that Niantic have added the second gen before fixing all the other bugs. Not happy.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T16:14:00-07:00", "title": "Great concept, terrible version"}, {"content": "I love this game, but this version of the app crashes every 10 minutes. If you are looking for frustration, rather than Pokemon you are in the right place", "rating": "1", "version": "1.27.2", "date": "2017-02-18T15:47:00-07:00", "title": "How many times can one app crash?"}, {"content": "I got 10 Pokémon in about 1hr and this app is great from the 80 new one great job guys", "rating": "5", "version": "1.27.2", "date": "2017-02-18T15:30:00-07:00", "title": "Amazingly amazing"}, {"content": "Really not good update game keeps freezing when trying to load. Please fix the bug issues it makes for disappointing gameplay", "rating": "1", "version": "1.27.2", "date": "2017-02-18T15:25:00-07:00", "title": "Update17 feb 2017"}, {"content": "GOOᗪ ᗷᑌT YOᑌ ᑎEᖇᗪ TᖇᗩᗪIᑎG Tᕼᗩᑎ TᕼIᔕ GᗩᗰE ᗯIᒪᒪ ᗷE GᖇEᗩTEᖇ Tᕼᗩᑎ ᗷEᖴOᖇE", "rating": "5", "version": "1.27.2", "date": "2017-02-18T15:13:00-07:00", "title": "GOOᗪ"}, {"content": "TERRIBLE. Stuck on white screen every time you load the game. Awful. How can apple put this on the App Store when it's so broken?", "rating": "1", "version": "1.27.2", "date": "2017-02-18T14:44:00-07:00", "title": "iPhone 5C loading problems"}, {"content": "I can play once but when i close off the app i cant get back on", "rating": "1", "version": "1.27.2", "date": "2017-02-18T14:10:00-07:00", "title": "Glitchy"}, {"content": "Amazing game, really enjoyable it's such an exhilarating feeling when you catch a new Pokemon! Now Gen 2 is out is even better, quite a lot overdue and Niantic are not the best company but the Fun you can have playing this makes up for it! The only problem is Server Issues at the start of the game it wouldn't load well and thing kept freezing and now Gen 2 is out and the hype is fresh again there is a little server issues but it's ok! Just beware is Highly Addictive!", "rating": "5", "version": "1.27.2", "date": "2017-02-18T14:04:00-07:00", "title": "Pokemon Go So Much Fun"}, {"content": "Pokémon go in 2017 has been amazing I've caught so many pokemon from gen 2 now but please add a way to get easier coins it's too difficult now to beat a gym at low lvl please I'm lvl 23 and my CP1936 Arcanine can't beat a CP1100 Gyrados", "rating": "4", "version": "1.27.2", "date": "2017-02-18T13:45:00-07:00", "title": "Best year of Pokémon Go!"}, {"content": "I really enjoy the game but I'm really disappointed about the cp of umbreon it really should be higher.", "rating": "4", "version": "1.27.2", "date": "2017-02-18T13:21:00-07:00", "title": "Good game but......"}, {"content": "I love the new update and I personally have no glitches that I have yet seen and no error messages. I like the new berries and the clothing but i would like it if the clothing was lesser coins and more different types of festival things for the holidays. Overall I'm absolutely okay and happy with the update", "rating": "5", "version": "1.27.2", "date": "2017-02-18T13:11:00-07:00", "title": "My Personal Opinion"}, {"content": "This game PHENOMENAL,with the new update the Jonto region theres more pokemon to catch so no one get bored.For me the game doesn't crash,no bugs. and it very clean cut, the new music is great.", "rating": "5", "version": "1.27.2", "date": "2017-02-18T13:09:00-07:00", "title": "100% AMAZING"}, {"content": "This game is great for exercise and it's a lot of fun and It gets you out of the house and there is more reasons for me to get out the house now since they have added 80 new Pokémon such as Chicorita cyndaquil todadle Noctowl hoothoot siccor kingdra and slowking many more Pokémon to register to the pokedex and great for fitness", "rating": "5", "version": "1.27.2", "date": "2017-02-18T12:16:00-07:00", "title": "Download Pokémon go"}, {"content": "You let it die.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T11:59:00-07:00", "title": "To late"}, {"content": "The game is good and all, but my only problem is bugs and glitches. My problem is that whenever I try to load up Pokemon, it just freezes, and it can do this for multiple times in a row, maybe 20 times. So if there is a good Pokemon that just spawned, I will try time and time again to make the game load. And the one time the game actually decides not to freeze, the Pokemon's gone, so basically I can't play Pokemon, Niantic claim to fix bugs in nearly every update, when I am still getting those same glitches over and over again.", "rating": "3", "version": "1.27.2", "date": "2017-02-18T11:36:00-07:00", "title": "Bugs & Glitches"}, {"content": "This game is great but I have to mess around to get the game to work because when it has loaded the screen is white", "rating": "4", "version": "1.27.2", "date": "2017-02-18T11:34:00-07:00", "title": "Good game but still some bugs"}, {"content": "Crashes about every 30secs. Unusable now", "rating": "1", "version": "1.27.2", "date": "2017-02-18T11:30:00-07:00", "title": "Unusable"}, {"content": "❤❤", "rating": "5", "version": "1.27.2", "date": "2017-02-18T11:27:00-07:00", "title": "AMAZING✨"}, {"content": "I have loved this game since it first came out i am a huge fan of Pokemon and this game has boosted my love for pokemon. Now that gen2 !! Has been released I went crazy play, I could play this for the rest of my life.\n\nMany thanks niantic", "rating": "5", "version": "1.27.2", "date": "2017-02-18T11:27:00-07:00", "title": "Pokemon Go"}, {"content": "I don't want more Pokemon, I just want to catch gen1 pokemen, should be able to opt out", "rating": "1", "version": "1.27.2", "date": "2017-02-18T11:25:00-07:00", "title": "Opt out of new Pokémon"}, {"content": "Really enjoying the new update but when I load the app it kicks me off firstly and then I get on to a frozen laggy game.", "rating": "3", "version": "1.27.2", "date": "2017-02-18T11:22:00-07:00", "title": "Decent"}, {"content": "Won't load, keep getting a blue screen.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T11:13:00-07:00", "title": "😡"}, {"content": "Why can't sign in with Gmail. Outrageous", "rating": "2", "version": "1.27.2", "date": "2017-02-18T10:53:00-07:00", "title": "Gmail?"}, {"content": "Good when i can get onto the app, but since the update i try multiple times to get on and the screen just goes white and i have to turn my phone off and on again every time. This is very inconvenient when someone finds a new Pokemon and i want to quickly get on the app to catch it", "rating": "2", "version": "1.27.2", "date": "2017-02-18T10:29:00-07:00", "title": "Good but..."}, {"content": "App keeps crashing and causing me not able to get into the app! Get it fixed please.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T10:23:00-07:00", "title": "Rubbish"}, {"content": "So addicting and so happy gen 2 is here, would love legendaries to come though!", "rating": "5", "version": "1.27.2", "date": "2017-02-18T10:08:00-07:00", "title": "Amazing!!"}, {"content": "Seriously?! Lapras deserved to be stronger but instead.. you made it worse?!", "rating": "1", "version": "1.27.2", "date": "2017-02-18T09:59:00-07:00", "title": "Lapras nerf"}, {"content": "The addition of Gen 2 is great, but we NEED the footprint tracking system back! If you're in urban areas it's almost IMPOSSIBLE to find the Pokémon you want without it! So please put it back in the game", "rating": "2", "version": "1.27.2", "date": "2017-02-18T09:58:00-07:00", "title": "Missing something VERY needed"}, {"content": "Good game but I can't even get on it because as soon as it loads the app closes and goes to the home screen!😡", "rating": "4", "version": "1.27.2", "date": "2017-02-18T09:22:00-07:00", "title": "I can't even get on the game👎🏾"}, {"content": "I tried upgrading this app but it's not letting me very annoying worst app get it fixed mate", "rating": "1", "version": "1.27.2", "date": "2017-02-18T09:18:00-07:00", "title": "CANT UPGRADE THIS APP"}, {"content": "Just updated Pokemon and my app keeps freezing to play it I have to deleted and reinstalled it please help", "rating": "1", "version": "1.27.2", "date": "2017-02-18T09:13:00-07:00", "title": "Help"}, {"content": "Whenever I try to open up the app it seems to freeze and I can't get rid of it. Apart from that I is a great game but need to fix this problem", "rating": "4", "version": "1.27.2", "date": "2017-02-18T08:42:00-07:00", "title": "Problem with gen 2 update"}, {"content": "Amazing game that gets you outside but there are very few updates but I don't mind", "rating": "5", "version": "1.27.2", "date": "2017-02-18T08:28:00-07:00", "title": "Amazing Game Bur Slow Updates"}, {"content": "Best game I've ever played", "rating": "5", "version": "1.27.2", "date": "2017-02-18T08:26:00-07:00", "title": "Really good"}, {"content": "How to get 🌯", "rating": "5", "version": "1.27.2", "date": "2017-02-18T08:16:00-07:00", "title": "Poke"}, {"content": "Normally a great game, but since the update it won't open.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T08:13:00-07:00", "title": "Won't open"}, {"content": "Can not open the app at all. It's crashing.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T08:01:00-07:00", "title": "App crash"}, {"content": "Good but crashes after I encounter a Pokemon", "rating": "2", "version": "1.27.2", "date": "2017-02-18T07:27:00-07:00", "title": "Crashes"}, {"content": "New update doesn't work on apple watch now, please fix", "rating": "1", "version": "1.27.2", "date": "2017-02-18T07:23:00-07:00", "title": "Could be better"}, {"content": "I was getting really bored of Pokémon go until they released gen 2 it is now brilliant. Don't doubt it. 😄😄👍", "rating": "5", "version": "1.27.2", "date": "2017-02-18T06:17:00-07:00", "title": "The new update did it"}, {"content": "New update constantly crashes so can't play anymore please fix this problem asap please 😢😢😢", "rating": "3", "version": "1.27.2", "date": "2017-02-18T06:03:00-07:00", "title": "Update"}, {"content": "Since the new update the game fails to load, so them new Pokemon you said you added have never been seen let alone caught! Used to love this game but it's s**t", "rating": "1", "version": "1.27.2", "date": "2017-02-18T05:54:00-07:00", "title": "Oh dear"}, {"content": "Brilliant", "rating": "5", "version": "1.27.2", "date": "2017-02-18T05:41:00-07:00", "title": "Pokémon go"}, {"content": "So to be honest with you it's a decent game but it crashes too much and you can't even play it because it crashes in 20seconds so if they make it not crash as much then get this game but if you have a iPhone 4or5 don't bother trying to make it work it will crash👎🏻👎🏻👎🏻👎🏻", "rating": "1", "version": "1.27.2", "date": "2017-02-18T05:36:00-07:00", "title": "It crashes on iPhone 4 and 5👎🏻👎🏻👎🏻"}, {"content": "A lot better with the Gen 2 out!", "rating": "5", "version": "1.27.2", "date": "2017-02-18T05:20:00-07:00", "title": "Amazing"}, {"content": "It is", "rating": "5", "version": "1.27.2", "date": "2017-02-18T05:00:00-07:00", "title": "Best game ever"}, {"content": "I love this game it's really addictive and it's the best. If someone asked me what's your favourite game I would say Pokémon Go! And thanks for gen 2 and the other bit of the new update! KEEP IT UP!!!!!!!!💩💩💩💩💩", "rating": "5", "version": "1.27.2", "date": "2017-02-18T04:47:00-07:00", "title": "Wow best game ever!!!!!!!!!"}, {"content": "I have not been able to get any gen two Pokemon yet because the game doesn't load poke stops, gyms or nearby Pokemon! Please fix it", "rating": "1", "version": "1.27.2", "date": "2017-02-18T04:44:00-07:00", "title": "All great with gen two buuuuuut...."}, {"content": "I had a dragonit", "rating": "5", "version": "1.27.2", "date": "2017-02-18T04:08:00-07:00", "title": "Pokemon"}, {"content": "This game was great at first, at least until it wouldn't stop crashing. Even with the new update, it still crashes, leaving me unable to play the game. This may be because I cannot get iOS 10 because my phone is incompatible with it. I hope that the glitches will stop but I am not too sure because the updates are not working. \nWhen I got a new phone, it worked great. The graphics were faster and it did not crash. \nThere is also some new features like the buddy feature that I like and I have found with the gen 2 release, which is pretty nice on its own, there has been some new clothing features. This is nice, but there is not much choice unless you want to blow out at least 100 Pokècoins to look good. This is not aplicible to all people, because some are fine with the things they have on. \nThere is still some issues with the game, e.g. Pokèstops not working or the \"You're going too fast\" pop up when you are walking or even sat on a bench in the park, which I think should be fixed. \nOverall this game is great, unless you don't have iOS 10 or above, then the game freezes a lot and is a great disappointment.", "rating": "4", "version": "1.27.2", "date": "2017-02-18T04:07:00-07:00", "title": "Pretty good, but..."}, {"content": "I think the new update for Pokemon go is good especially now we have Pokémon from the johto region. But I don't get why they haven't changed the loading screen back to the way it was. Because it's still new year themed.", "rating": "4", "version": "1.27.2", "date": "2017-02-18T03:54:00-07:00", "title": "GREAT"}, {"content": "Keeps saying that they have fixed minor things but every time I go on it doesn't load properly", "rating": "2", "version": "1.27.2", "date": "2017-02-18T03:36:00-07:00", "title": "Minor fixes?"}, {"content": "This game is the best game in the history of games.    I love Pokémon irl and I love Pokémon go. This game has made my day every day. I recommend this to any Pokémon fans. Gotta catch em all.  Pokémon", "rating": "5", "version": "1.27.2", "date": "2017-02-18T03:29:00-07:00", "title": "Legendary"}, {"content": "Before this update I had almost collected all the Pokémon and now I have a lot more to catch and they seem to be more common. Previously you could only get series 2 through eggs but now I see them around more often.", "rating": "5", "version": "1.27.2", "date": "2017-02-18T03:17:00-07:00", "title": "Better 👏🏼👏🏼👏🏼"}, {"content": "Game just constantly crashes, would be nice to see new Pokémon but app just tends to close down, white screen or load map and be stuck in loading mode.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T03:08:00-07:00", "title": "Crash, crash and crash again"}, {"content": "This is great! The new Pokémon are finally added, and hopefully the game will be more stable. \nWhen it's working, it's one of the most awesome games I've ever played and I really want it to keep being awesome!", "rating": "5", "version": "1.27.2", "date": "2017-02-18T03:07:00-07:00", "title": "Yay! New Pokémon!"}, {"content": "The only thing that would be good if you could see other players but this is my fav game", "rating": "5", "version": "1.27.2", "date": "2017-02-18T02:50:00-07:00", "title": "Love it"}, {"content": "This game is overrated and rubbish. It is not well made, glitchy and a disgrace to the Pokemon franchise. I think it is a disappointment to Pokemon.", "rating": "1", "version": "1.27.2", "date": "2017-02-18T02:29:00-07:00", "title": "Rubbish"}, {"content": "The only reason it is laggy is because people are just on it 24/7 now my game crashes now and then but I can deal with it, thanks for gen 2 Niantic!", "rating": "5", "version": "1.27.2", "date": "2017-02-18T01:51:00-07:00", "title": "For all the people who don't like"}, {"content": "Delete the game then reinstall it. To all 'it takes too long to load things' people. The servers blew up when gen 2 came out so don't expect it to be loading easily. Thank you Niantic for the new update it is great. :D", "rating": "5", "version": "1.27.2", "date": "2017-02-18T01:43:00-07:00", "title": "To all 'crashing' people."}, {"content": "Plz update no crashes", "rating": "1", "version": "1.27.2", "date": "2017-02-18T01:01:00-07:00", "title": "It always keeps crashing"}, {"content": "It in courages us to get up off our buts and walk", "rating": "5", "version": "1.27.2", "date": "2017-02-18T00:57:00-07:00", "title": "Amazing"}, {"content": "All I have to say is that this app is rubbish", "rating": "1", "version": "1.27.2", "date": "2017-02-18T00:53:00-07:00", "title": "This app is rubbish"}, {"content": "I hate this game so much it's the worst game I've ever played.The Pokémon I catch are good but they NEVER go into my pokedex and it's ANNOYING AS HELL\n\nThe other thing is that it signed me out and now I cannot sign back in so now I'm never playing this again\n\nSincerely yours...Kayden", "rating": "1", "version": "1.27.2", "date": "2017-02-18T00:39:00-07:00", "title": "Absolutely crap"}, {"content": "This game is fun and adventurous, it gets people outside more and keeps them happy. But the game has let itself down, new updates are lacking and they are taking a longer time then they should. I still think it's three stars because of good things but no higher because of the bad.", "rating": "3", "version": "1.27.2", "date": "2017-02-18T00:14:00-07:00", "title": "Improving Needed"}, {"content": "Good recent update which has restored battery saver option for iOS users (hurrah!) - am hoping it's a sign of continued improvements.  Agree with others that unless you're in an urban area/city, it will be slim pickings re pokestops and Pokemon.\n\nFeb 2017 - recent update would be great if only I could get it to load.  Constant \"GPS not found\" error makes game unusable. Nothing wrong with my connection or phone settings....2 stars docked from original 3 star rating", "rating": "1", "version": "1.27.2", "date": "2017-02-17T23:50:00-07:00", "title": "Recent updates suggest continued improvements"}, {"content": "The game does not load properly and so I have to uninstall it every time I want to play it.", "rating": "1", "version": "1.27.2", "date": "2017-02-17T23:34:00-07:00", "title": "Loading the game"}, {"content": "This game was great when it came out; revolutionary even, and it still is. But I notice a lot of people saying that there are loads of bugs and that it is a crappy game because of that, and also that Niantic don't care about how good their customers' experiences of their games are as long as they make money. Well, come on people, it's a free game!!! What annoys me is the fact that so many people just look at the negatives of the app; look at all the positives and your mind will be changed easily!\n\nFor example:\n\nSometimes the game crashes or things don't load- that is probably because your phone is a too old model or you don't have the most recent iOS update!\nAlso sometimes when you get to higher levels you can't catch Pokémon as easily- why do you need the common Pokémon if you already have the final evolution and you are obviously already a high level?\n\nThere are loads of positives, like:\nHave you ever seen a game where you explore the real world catching fantasy monsters that everyone loves? Have you ever explored the world and collected Pokéballs from famous landmarks before? It seems stupid, but it's revolutionary! The tracking; think about how long this game took to code! I bet most of you people saying that this is a bad game would never even be able to code the Pokémon making sounds when you tap them!\n\nAnyway, I have one point, and one point only... think about the effort put into this game, and then you'll see why Niantic DO care about their customers.\nOh, and I almost forgot to mention... IT's FREE!!!!!", "rating": "5", "version": "1.27.2", "date": "2017-02-17T23:25:00-07:00", "title": "IT'S FREE!!!"}, {"content": "Not everytime bt quite a few time i load game the map part of the game is blank", "rating": "3", "version": "1.27.2", "date": "2017-02-17T23:19:00-07:00", "title": "Bug fix"}, {"content": "I love playing this game on my iPhone but for some reason I still can't play it on my Ipad but overall this game is great", "rating": "5", "version": "1.27.2", "date": "2017-02-17T18:27:00-07:00", "title": "I love this game but..."}, {"content": "I absolutely love each of the new Pokemon! I've been waiting for so long to catch some new and exciting Pokemon to get me back into the game. It's hard to do this though considering the amount of times that my game crashes when I try to load it up😩 apart from this, the update is stellar👍👌", "rating": "4", "version": "1.27.2", "date": "2017-02-17T18:23:00-07:00", "title": "New pokemon😃new bugs😩"}, {"content": "I love Pokemon and I've had it since day one. The app it's self is good, the game has hardly any bugs ATM. The events help, otherwise it can become a bit monotonous daily. \nLoving the 70 new Pokemon for gen 2 though 👍🏻", "rating": "5", "version": "1.27.2", "date": "2017-02-17T17:39:00-07:00", "title": "Getting better 👍🏻"}, {"content": "It was good until the recant update witch has loads of Pokémon that I've never seen before I got one that looked like a sausage before! The games going downhill", "rating": "1", "version": "1.27.2", "date": "2017-02-17T17:24:00-07:00", "title": "Used to be good"}, {"content": "Every time I log it has a spas and asks to change my password", "rating": "1", "version": "1.27.2", "date": "2017-02-17T15:28:00-07:00", "title": "Hate"}, {"content": "All but twice when I open the game, it won't work or anything", "rating": "1", "version": "1.27.2", "date": "2017-02-17T15:07:00-07:00", "title": "Game won't work"}, {"content": "This is honestly one of the best mobile games I've ever played. :D", "rating": "5", "version": "1.27.2", "date": "2017-02-17T15:05:00-07:00", "title": "Awesome Game"}, {"content": "Sick game", "rating": "5", "version": "1.27.2", "date": "2017-02-17T14:59:00-07:00", "title": "I play Pokemon go everyday"}, {"content": "First Gen so far seems better", "rating": "2", "version": "1.27.2", "date": "2017-02-17T14:56:00-07:00", "title": "first gen was better"}, {"content": "This is the best game in the whole of the app store", "rating": "5", "version": "1.27.2", "date": "2017-02-17T14:13:00-07:00", "title": "I love this game"}, {"content": "Pokemon go has realistic graphics 😂😂 and it also has great poke catching gameplay 😂😂....I give up on life JK", "rating": "5", "version": "1.27.2", "date": "2017-02-17T13:26:00-07:00", "title": "Hey that's pretty good"}, {"content": "I have played since day one and I have been looking forward to gen 2 . I love it !", "rating": "5", "version": "1.27.2", "date": "2017-02-17T13:21:00-07:00", "title": "Gen 2"}, {"content": "After lates upgrade \nGame its stuck,total blank page \nI've installed 2 times to but nothing happened", "rating": "1", "version": "1.27.2", "date": "2017-02-17T13:18:00-07:00", "title": "Bug"}, {"content": "I'm really enjoying gen 2. But there needs to be a migration of the region exclusive Pokémon, perhaps as a event?", "rating": "4", "version": "1.27.2", "date": "2017-02-17T13:03:00-07:00", "title": "Latest update"}, {"content": "This appz iz fuckingz gayz", "rating": "1", "version": "1.27.2", "date": "2017-02-17T12:44:00-07:00", "title": "Gayzzzz"}, {"content": "Gen 2 finally yeesss", "rating": "5", "version": "1.27.2", "date": "2017-02-17T12:38:00-07:00", "title": "GEN 2!!!!"}, {"content": "I was really enjoying this game as it took me back to my childhood with the original Pokemon that started the whole popularity of Pokemon. After the recent update I must say I am very disappointed that the newer Pokemon have been added. I believe that this game should be kept to the original Pokemon as there are far too many new ones that original fans don't like or recognise.", "rating": "2", "version": "1.27.2", "date": "2017-02-17T12:38:00-07:00", "title": "Disappointed"}, {"content": "I wish you could give Pokemon to other people", "rating": "4", "version": "1.27.2", "date": "2017-02-17T12:37:00-07:00", "title": "Good"}, {"content": "Before G2 Pokemon Go In My Opinion Got A Bit Boring, But Now G2 Is Out I Am Playing It Non Stop, More Pokemon To Catch, More Fun And Addicting To Play With! ✨", "rating": "5", "version": "1.27.2", "date": "2017-02-17T12:25:00-07:00", "title": "✨Pokémon G2✨"}, {"content": "Thank you for dropping gen2 please add pvp and trading", "rating": "5", "version": "1.27.2", "date": "2017-02-17T12:07:00-07:00", "title": "Finally"}, {"content": "This is the second time I have had to update, no choice, this is also the second time I have not been able to get on the game.  It just takes you round and round.  Fed up with having to start again with the daily streak, if I am ever lucky enough to get back into the game, two days now!  Sort it out", "rating": "1", "version": "1.27.2", "date": "2017-02-17T11:50:00-07:00", "title": "Rubbish, useless"}, {"content": "I cannot believe you have forced on the next generation of Pokemon on us, without us choosing to do so. I have played this game since day one, trying to catch the 151 ORIGINAL POKEMON. You haven't even brought out Mew/Mewtwo or the legendaries....yet you've brought out the pathetic next generations. I will not be playing this again, until you make an option to just do the 151!", "rating": "1", "version": "1.27.2", "date": "2017-02-17T11:39:00-07:00", "title": "Lost a player"}, {"content": "It's just actually...rename for eevee 'Sakura' keep be evolved Jolteon 4 times it.\n\nWhy didn't add about Legendary Pokemon Moltres, Articuno, Zapdos, Mewtwo, Mew, Lugia, Celebi, Ho-Oh, etc\nYou should must be update event.", "rating": "3", "version": "1.27.2", "date": "2017-02-17T11:34:00-07:00", "title": "Good! But"}, {"content": "Love this game!! I have been getting a bit bored lately. then yesterday generation 2 came out they are everywhere.", "rating": "5", "version": "1.27.2", "date": "2017-02-17T11:33:00-07:00", "title": "Generation 2!!"}, {"content": "I cannot update with this new version and now cannot play the game, am going round in circles and it just keeps going to log in page then to upgrade then to App Store then to log in page then to upgrade then to App Store and on and on and on.................", "rating": "1", "version": "1.27.2", "date": "2017-02-17T11:15:00-07:00", "title": "Disappointed"}, {"content": "They finally got it right!", "rating": "5", "version": "1.27.2", "date": "2017-02-17T10:57:00-07:00", "title": "Disappointed"}, {"content": "How do I update", "rating": "3", "version": "1.27.2", "date": "2017-02-17T10:42:00-07:00", "title": "Pokémon go"}, {"content": "I got this game when it came out and it was amazing, I got all he gen 1 pokemon so then it got bad and there were stories about new Pokémon coming and FINALLY they are here and now I'm back into a game that saved itself from dying. If you haven't played before then you have twice the fun as I had because you have to get all of both gens, i recommend this game to anyone who got bored of it or anyone new as it is good again.", "rating": "5", "version": "1.27.2", "date": "2017-02-17T10:41:00-07:00", "title": "Good again"}, {"content": "On Iphone 7 tried to upgrade but it's stuck in a loop asking me to upgrade but not doing so when directed.. so annoying \nPlease fix!!", "rating": "1", "version": "1.27.2", "date": "2017-02-17T10:28:00-07:00", "title": "Can't upgrade"}, {"content": "Hi I just won't to say that after Christmas when you put out an update I can no longer get into the game", "rating": "3", "version": "1.27.2", "date": "2017-02-17T10:15:00-07:00", "title": "I can't into the game"}, {"content": "I am enjoying catching the new Pokémon but gyms have been heavily nerfed. You used to be able to attack quickly using stuff like Bite but it has been slowed and kills the point of gym battles.\n\nPlease change and I will give 5 stars!", "rating": "4", "version": "1.27.2", "date": "2017-02-17T10:12:00-07:00", "title": "Gyms have been nerfed, please fix!!!"}, {"content": "Quite a good game but keeps locking me out and it won't even let me create a new account or click 'forgot my password'", "rating": "2", "version": "1.27.2", "date": "2017-02-17T10:10:00-07:00", "title": "Anne"}, {"content": "They dont make that good updates\nNobody plays it\nIn overall this app was a craze that has moved on\n1 star", "rating": "1", "version": "1.27.2", "date": "2017-02-17T10:05:00-07:00", "title": "Worst App"}, {"content": "Yay, finally. Gen 2 is out! Im so happy and but fixes are also here!", "rating": "5", "version": "1.27.2", "date": "2017-02-17T10:01:00-07:00", "title": "Gen two!"}, {"content": "It won't load despite trying several times", "rating": "1", "version": "1.27.2", "date": "2017-02-17T09:55:00-07:00", "title": "App won't work"}, {"content": "Money grabbing.", "rating": "1", "version": "1.27.2", "date": "2017-02-17T09:54:00-07:00", "title": "Pathetic"}, {"content": "I've had this game for 5 months now, and I'm starting to play it once again. The new update has made a BIG difference in this whole Pokemon go community. I would definitely give the new update a 5 star rating because of new Pokemon and new additional features added into the game. I will look forward into them adding new Pokemon in the future...", "rating": "5", "version": "1.27.2", "date": "2017-02-17T09:40:00-07:00", "title": "Great update"}, {"content": "With the newest update, niantic has revitalised this game with around 80 brand new Pokémon and UI updates, this is an extremely good update. However niantic has decided to add in clothing options for your character which cost poke coin. There are only two ways to get coins, have a Pokémon constantly in a gym or, BUYING them. This is an unwise decision on niantic part, and it is harmful to the game", "rating": "3", "version": "1.27.2", "date": "2017-02-17T09:35:00-07:00", "title": "New Pokémon"}, {"content": "New update is great!", "rating": "5", "version": "1.27.2", "date": "2017-02-17T09:33:00-07:00", "title": "Yay"}, {"content": "Every time I try and play it just says the gps signal hasn't been found??!!!!", "rating": "1", "version": "1.27.2", "date": "2017-02-17T08:52:00-07:00", "title": "Rubbish"}, {"content": "This is the best game ever and sometimes it reminds me when Pokémon first started", "rating": "5", "version": "1.27.2", "date": "2017-02-17T08:48:00-07:00", "title": "Best game ever"}, {"content": "It asks me is I want to update to the new version and only allows me select yes then it goes to the App Store and this repeats on a loop", "rating": "1", "version": "1.27.2", "date": "2017-02-17T08:45:00-07:00", "title": "You've broken it"}, {"content": "Ever since the update my game keep getting stuck on the loading screen", "rating": "2", "version": "1.27.2", "date": "2017-02-17T08:43:00-07:00", "title": "Unknown Bug or problem"}, {"content": "this game started off well and up to the hype but after 3 weeks it got boring and unexciting.", "rating": "2", "version": "1.27.2", "date": "2017-02-17T08:30:00-07:00", "title": "started off exciting then..."}]}