{"data": [{"content": "The layout of this Ap is horrible. It looks messy and is awkward to navigate unlike how it used to be. \nThe camera keeps popping up too. \nIt used to be straightforward and simple.", "rating": "3", "version": "107.0", "date": "2017-03-06T10:28:00-07:00", "title": "Awkward"}, {"content": "The alert sound is very very very annoying you should be able to change the stupid ding noise to something else as if sounds annoying & very irritating. Thanks please do something about this.", "rating": "1", "version": "107.0", "date": "2017-03-06T09:32:00-07:00", "title": "Alerts 🚨"}, {"content": "The messenger app is, on the whole, useable. Chats seem to take an age to send but get there eventually. The worst problem though is the camera within messenger. If you try to take a photo to send, the app just crashes! Please fix this ASAP!", "rating": "2", "version": "107.0", "date": "2017-03-06T09:05:00-07:00", "title": "Okay but..."}, {"content": "It's just pointless having a deprecate app for messages, put it back on the Facebook app, it takes less space.", "rating": "1", "version": "107.0", "date": "2017-03-06T02:19:00-07:00", "title": "Pointless"}, {"content": "Very good app lets me socialize with my friends and video call good job messenger👍🏼👍🏼", "rating": "5", "version": "107.0", "date": "2017-03-05T23:00:00-07:00", "title": "Great app"}, {"content": "Messages just coming up blank now! Nice one! Make the app as pointless as possible", "rating": "1", "version": "107.0", "date": "2017-03-05T08:21:00-07:00", "title": "Every update just makes it worse!"}, {"content": "I think as well as the shared photos, there should be shared videos too because you have to scroll all the way through a chat to find a video when you can just find it easier in shared photos (shared media for example).", "rating": "4", "version": "107.0", "date": "2017-03-04T09:14:00-07:00", "title": "Shared videos"}, {"content": "Hated when this became a separate app, but put up with it. Accidentally added someone and couldn't find a way of removing them so I just deleted the whole thing. Good riddance to a clunky slow messenger.A classic case of if it ain't broke leave well alone.", "rating": "1", "version": "107.0", "date": "2017-03-04T08:06:00-07:00", "title": "Dump it"}, {"content": "I love using this app, however, recently I've noticed parts of ongoing conversations are disappearing suddenly as if they've been deleted then a few weeks later they return. It's confusing at the time because you lose the thread of conversation. Very annoying so been using other messaging apps instead", "rating": "3", "version": "107.0", "date": "2017-03-04T07:57:00-07:00", "title": "Disappearing bits of conversations"}, {"content": "Not happy I keep getting invited to messenger by my friends despite having the app installed & linked to my Facebook. It appears I have the old Facebook 'f' next to my picture & not the blue messenger logo so people don't think I have the app.", "rating": "1", "version": "107.0", "date": "2017-03-04T07:56:00-07:00", "title": "Argh"}, {"content": "When i open messenger from a notification , it's not showing the message in the messenger ..", "rating": "2", "version": "107.0", "date": "2017-03-04T02:55:00-07:00", "title": "There is a BUG"}, {"content": "Dlaczego, pytam sie dlaczego fb niszczy samo siebie? Jesli nie chca prowadzic wlasnego komunikatora moge dostosowa/zkompatybilowac kilka innych ze swoim systemem, nie tylko jeden, ktory jest naprawde gowniany i chuja warty, zero programistyczne.... Kurczaki mi sie w piekarniku pala same ze wstydu! Kazda aktualizacja gorsza od poprzedniej, zal i żałosna sprawa. Hujnia z grzybnia ogolnie. Za dwa dni was kasuje, a potem fb jesli mi uniezliwia komunikatora bez was. Pa zalosne żołędzie !", "rating": "1", "version": "107.0", "date": "2017-03-03T15:42:00-07:00", "title": "Gowno!!!!"}, {"content": "Autocorrect doesn't work on the new update which is super frustrating 👎🏼", "rating": "1", "version": "107.0", "date": "2017-03-03T14:16:00-07:00", "title": "Frustrating!"}, {"content": "I used to love how straightforward messenger was, now when I login it comes up with my old messages first  and it can be really confusing, if I'm chatting and quickly want to catch something in a photo it's hard to know what's for what, when you do figure it out it's too late and you don't need the camera anymore! Please please please turn it back!", "rating": "2", "version": "107.0", "date": "2017-03-03T10:40:00-07:00", "title": "Lost"}, {"content": "Never liked having to have a separate app in the first place taking up more memory just for messages.\n\nBut the way the app tries to harass you into turning on notifications and syncing contacts is absurd. You have to click though ~7 pop ups in a row trying to trick you into turning them on. One 'no' should be the end of it.\n\nWhenever I am forced to install it in order to send a message that needs to be sent I am reminded of this grab for attention again and uninstall it at the first chance.", "rating": "1", "version": "107.0", "date": "2017-03-03T08:57:00-07:00", "title": "Unnecessary"}, {"content": "Just updated and now constantly freezing plus lost my favourite list too.  \n\nStill needs a log in/out facility to keep conversations private. Either password or number code would be helpful to keep messages private", "rating": "1", "version": "107.0", "date": "2017-03-03T08:35:00-07:00", "title": "What have you changed other than break stuff?"}, {"content": "If this app could only have switch to turn the calls on or off.. random calls are embarrassing from someone unknown 🤒😞", "rating": "2", "version": "107.0", "date": "2017-03-03T03:52:00-07:00", "title": "Feedback"}, {"content": "Each time I scroll through my chats the messages will randomly disappear and the only way to see them again is if I end the session and re load messenger again.", "rating": "2", "version": "107.0", "date": "2017-03-02T17:54:00-07:00", "title": "My messages keep disappearing"}, {"content": "The button for the stickers disappeared after your last update, what the hell? I have no way to send stickers now", "rating": "1", "version": "107.0", "date": "2017-03-02T15:21:00-07:00", "title": "Wtf"}, {"content": "Since the last update my messenger is not working properly. U go to it and half if not all the previous conversations have disappeared.\nSort it out apple !!!!!!!", "rating": "1", "version": "107.0", "date": "2017-03-02T14:02:00-07:00", "title": "Messenger knackered"}, {"content": "Only receiving notifications roughly half of the time. This is highly annoying. Please fix this.", "rating": "1", "version": "107.0", "date": "2017-03-02T10:54:00-07:00", "title": "ANNOYING"}, {"content": "If your going to fix something at least stop it from crashing every time I go onto a company's page", "rating": "2", "version": "107.0", "date": "2017-03-02T10:19:00-07:00", "title": "Fix the crashing when opening a page"}, {"content": "You update the app yet again but you fail to sort out what's already wrong with it! I can't view any of my messages because they keep disappearing 😡😡😡😡😡😡", "rating": "1", "version": "107.0", "date": "2017-03-02T09:08:00-07:00", "title": "Absolutely horrendous"}, {"content": "Well I can't complain at all,text and phone calls always great, sending photos great. Spot on  to keep in contact with friends.", "rating": "5", "version": "107.0", "date": "2017-03-02T08:43:00-07:00", "title": "Messenger"}, {"content": "Keyboard disappears and way too easy to video call by accident", "rating": "2", "version": "107.0", "date": "2017-03-02T08:08:00-07:00", "title": "Freezes often"}, {"content": "I am stuck using this terrible app because I am in a couple of groups on it but I never use it otherwise. I get messages through on it in notifications but then I can't see them on the app. It will then need to be redownloaded. It clears the last few messages and requires restarting to see them. Terrible UX design in the camera appearing when I scroll up, conversations are hard to find. So yay it has games but really I want to use a messenger app to message people", "rating": "1", "version": "107.0", "date": "2017-03-02T07:52:00-07:00", "title": "Awful app"}, {"content": "Used to use this. But the dumbing down forced on users is proposterous. Events planned whenever I mention anything that looks like a date or time? And now putting words in my mouth whenever I post a hyperlink? \n\nSad sad sad user experience.", "rating": "1", "version": "107.0", "date": "2017-03-02T07:46:00-07:00", "title": "Getting sadder by the day."}, {"content": "I am new user but so far think it is brilliant and I find new things all the time. Thank you. Works for me", "rating": "5", "version": "107.0", "date": "2017-03-02T07:38:00-07:00", "title": "New user"}, {"content": "Use all the time it's great", "rating": "5", "version": "107.0", "date": "2017-03-02T07:28:00-07:00", "title": "The best"}, {"content": "The ugliest update yet completely messed up 🖕🏼", "rating": "1", "version": "107.0", "date": "2017-03-02T06:52:00-07:00", "title": "Crap"}, {"content": "I've removed the contacts from messenger a million times and yet somehow I inadvertently seen too keep adding them.\nI use my phone for work and I don't want all my clients adds to my personal messenger app. \nSo now I've removed them (and I'm temporarily happy) I now received regular notifications on the app informing me to add my contacts to messenger. \n\nThat's my biggest issue. There are so many more, including being unable to access message requests, having to renter all my details (and decline the contact sync) every time I log in and out of different profiles. \nThe most recent update has included some random snapchat style image messaging that keeps opening up when I scroll through my messages or I am typing - then I lose my message. \nIf I log in/out of the Facebook app it doesn't link with messenger so when my partner or a friend wants to access their profiles on my phone or I need to access my work profile I have to log in/out twice. \nLiterally the worst app ever and there was nothing wrong with the original format. \nMessenger needs to take some notes from apps like Facebook Pages that log you in/out automatically and are easy to use.", "rating": "1", "version": "107.0", "date": "2017-03-02T06:13:00-07:00", "title": "Stop Syncing My Contacts!"}, {"content": "Much better than ordinary messages much more private.", "rating": "5", "version": "107.0", "date": "2017-03-02T05:56:00-07:00", "title": "MessengerApp"}, {"content": "When you see the message icon and click on it it says op n messanger yet it takes you to the App Store so not very user friendly", "rating": "2", "version": "107.0", "date": "2017-03-02T05:52:00-07:00", "title": "Won't integrate"}, {"content": "Great app", "rating": "5", "version": "107.0", "date": "2017-03-02T05:49:00-07:00", "title": "❤"}, {"content": "This app was handy when first released, even after a few updates it still carried on performing well. Now lately the constant updates change the layout everytime... the features were there at your fingertips, now you gotta swipe, click and scroll to find stuff. It's a maze. \n\nAfter getting used to it, they update it again and change the layout again. Can we just stick to one layout, keep the app basic and have all the features at your fingertips like before? A conversation shouldn't be this troublesome...", "rating": "3", "version": "107.0", "date": "2017-03-02T05:43:00-07:00", "title": "A handy app but..."}, {"content": "I am happy using the messenger and Facebook", "rating": "5", "version": "107.0", "date": "2017-03-02T04:55:00-07:00", "title": "I like Facebook and messenger"}, {"content": "This app is a bag of shite nowt but trouble . Sort it out ffs!!! A asylum seeker works better than this shite", "rating": "1", "version": "107.0", "date": "2017-03-02T04:42:00-07:00", "title": "This messenger app"}, {"content": "Free, easy to use. Worth having.", "rating": "5", "version": "107.0", "date": "2017-03-02T04:31:00-07:00", "title": "Very good"}, {"content": "Why did you make all these games I waste so much time playing snake. Other than that great app", "rating": "5", "version": "107.0", "date": "2017-03-02T04:10:00-07:00", "title": "Games."}, {"content": "This should not be compulsory. It's unnecessary, pointless...it's poor.", "rating": "1", "version": "107.0", "date": "2017-03-02T04:05:00-07:00", "title": "Very very annoying."}, {"content": "Have no problems with it👌 so far so good!", "rating": "5", "version": "107.0", "date": "2017-03-02T03:24:00-07:00", "title": "Good"}, {"content": "Found app useful had no problems with it.", "rating": "5", "version": "107.0", "date": "2017-03-02T02:51:00-07:00", "title": "No problems"}, {"content": "It used to take a minute to load from Facebook but now it's more integrated and very easy to use!", "rating": "5", "version": "107.0", "date": "2017-03-02T02:44:00-07:00", "title": "Getting faster..."}, {"content": "Why have two apps when it worked well for one, makes no sense at all!! Stupid! 😑", "rating": "1", "version": "107.0", "date": "2017-03-02T02:14:00-07:00", "title": "The worst idea"}, {"content": "That's it.", "rating": "4", "version": "107.0", "date": "2017-03-02T02:01:00-07:00", "title": "Good"}, {"content": "buna", "rating": "4", "version": "107.0", "date": "2017-03-02T01:42:00-07:00", "title": "👍👍👍👍"}, {"content": "I love the app, but two things annoy me. The notification which pops up even for old messages...really irritating. \nAlso, the camera pops up when typing a message...I think the button is too big and sensitive. \nStill think it's a great app though and with these two tweaks it would get a strong five stars!", "rating": "4", "version": "107.0", "date": "2017-03-02T01:23:00-07:00", "title": "Great but..."}, {"content": "I love messenger it's very helpful for when I want to get a hold of somebody it it worth downloading", "rating": "5", "version": "107.0", "date": "2017-03-02T00:32:00-07:00", "title": "Messenger"}, {"content": "Perfect", "rating": "5", "version": "107.0", "date": "2017-03-02T00:01:00-07:00", "title": "Great"}, {"content": "The friends list is a mess and the snapchat like camera is a pain. Bring back the old update and fire who ever thinks this was a good idea.... that also means mark zuckerturd", "rating": "1", "version": "107.0", "date": "2017-03-01T23:43:00-07:00", "title": "Stupid Snapchat like camera mode"}, {"content": "I love Messenger!", "rating": "4", "version": "107.0", "date": "2017-03-01T23:27:00-07:00", "title": "Mrs A"}, {"content": "What on earth is the ridiculous camera button about? and half the message threads don't seem to load.  Absolutely hate it... if there is any way of undoing the update some please let me know. I just want to send messages quickly and easily ... that's all :(", "rating": "1", "version": "107.0", "date": "2017-03-01T16:40:00-07:00", "title": "Most annoying ever :("}, {"content": "Unable to add favourites and active to 'home' screen", "rating": "2", "version": "107.0", "date": "2017-03-01T15:15:00-07:00", "title": "Useful but not right"}, {"content": "Stopped getting notifications once you updated the app, no sound or message comes up on my screen. Checked the settings and everything should be fine, hope you get this fixed it's so annoying", "rating": "1", "version": "107.0", "date": "2017-03-01T15:00:00-07:00", "title": "Notifications"}, {"content": "Facebook stop updating the app. every week you update it with no information on what has changed.\nI am not going to be updating this app anymore and quite frankly I am sick of messenger and will be convincing my friends to move away from this platform.\n154Mb for a message app is ridicules all I want is a message app not snapchat. If I wanted snapchat I would use snapchat.", "rating": "1", "version": "107.0", "date": "2017-03-01T14:31:00-07:00", "title": "STOP WITH THE UPDATES"}, {"content": "Not showing icons whos on Facebook or who's on messenger the icons have gone need to fix it again now", "rating": "3", "version": "107.0", "date": "2017-03-01T13:35:00-07:00", "title": "Not showing icons"}, {"content": "What a totally useless option to Facebook !!!", "rating": "1", "version": "107.0", "date": "2017-03-01T13:31:00-07:00", "title": "Rubbish"}, {"content": "I've been fairly frustrated with updates of late, 'so we can make it better for you'.....\n\nAnd now 'shared days' has finally driven me over the edge.... \n\nAt least give me an option to turn the damn thing off rather than keep turning my camera on accidentally...  \n\nIf I need a photo, I have an app for that... it's called camera... \n\nFFS....", "rating": "1", "version": "107.0", "date": "2017-03-01T13:01:00-07:00", "title": "Arrrrggghhhhh......"}, {"content": "Great... A compulsory app that does what I could already do before it was made! Now I have to waste space on my phones memory just to read my Fb messages. Won't be long before we have to start paying to open our inbox. And like social media sheep everyone will get in line and cough up. Thanks for the cr-app Facebook!", "rating": "1", "version": "107.0", "date": "2017-03-01T11:39:00-07:00", "title": "What's the point in this app?"}, {"content": "Every time I try to play a mini game it says games is not available and I will be notified why is this?", "rating": "2", "version": "107.0", "date": "2017-03-01T11:09:00-07:00", "title": "Won't let me play mini games"}, {"content": "1) On this version - Favourite contacts are no longer displayed under the Favourites bar\n\n2) Notifications are slow to come through (if at all) \n\n3) Automatically redirected to this app when trying to view messages on the more secure Safari browser. Seriously, why? Give us the choice to do what we want!\n\n4) Yet again - UPDATE THE APP STORE SCREENSHOTS TO REFLECT EACH UPDATE!!! Other huge corporations can manage it - maybe because they actually care about the user experience - so why can't you?", "rating": "1", "version": "107.0", "date": "2017-03-01T11:06:00-07:00", "title": "Endless problems with every new update..."}, {"content": "I can see the favourites tab but there are no people in it, sort it out please.", "rating": "1", "version": "107.0", "date": "2017-03-01T09:37:00-07:00", "title": "Favourites disappeared ?!"}, {"content": "Ahem. What is this. That's what I thought when I went to change the like button in my cat group chat from a thumbs up to a CAT. There are two dogs. TWO. SEPARATE. DOGS. And how many cats? Zero. Zero cats. I don't think I need to tell you how utterly speechless I was left at this. It's simply preposterous. Disgusting. Discrimination. \"Felinist\". The very thought of it makes me sick. ADD A CAT EMOJI IN THE CHATTY THINGAMABOB NOW!!", "rating": "1", "version": "107.0", "date": "2017-03-01T09:31:00-07:00", "title": "Cat emoji wanted and NEEDED 😾"}, {"content": "It would be better if iOS had chat head\n\nPlease put that in your next update please", "rating": "4", "version": "107.0", "date": "2017-03-01T07:45:00-07:00", "title": "Need chat head"}, {"content": "Don't know why everyone is moaning about it I think it's fine and quick and easy way to text and call my mates", "rating": "5", "version": "107.0", "date": "2017-03-01T06:24:00-07:00", "title": "Good app tbh"}, {"content": "Excellent App", "rating": "5", "version": "107.0", "date": "2017-03-01T05:33:00-07:00", "title": "Mrs"}, {"content": "Group chats never work, keep just getting random profile pictures at the side as if messages are coming though, get it sorted", "rating": "1", "version": "107.0", "date": "2017-03-01T04:48:00-07:00", "title": "Annoying"}, {"content": "love it and use it everyday everywhere ❤️", "rating": "5", "version": "107.0", "date": "2017-03-01T04:47:00-07:00", "title": "great app"}, {"content": "It's a good app but I hate the unnecessary stupid features. Just let it be a messaging app. Not a Snapchat and not a birthday messages app. Or at least give me the option to opt out.", "rating": "3", "version": "107.0", "date": "2017-03-01T04:19:00-07:00", "title": "Good app"}, {"content": "I have been getting lots of odd obscene  videos since it has change therefore I don't trust messenger any more.  Seems like any and everyone can access your profile now.  Sad.  However the  messenger c", "rating": "2", "version": "107.0", "date": "2017-03-01T03:53:00-07:00", "title": "Trust"}, {"content": "I couldn't see my friends in hospital but I could message them", "rating": "4", "version": "107.0", "date": "2017-03-01T02:46:00-07:00", "title": "Really good"}, {"content": "I sincerely hope every one involved in the creation of this app will die of brain cancer.", "rating": "1", "version": "107.0", "date": "2017-03-01T00:38:00-07:00", "title": "An awful, unwanted app."}, {"content": "Why can't we just use Facebook I don't want to download this just to call or chat to sum one this is rubbish", "rating": "1", "version": "107.0", "date": "2017-02-28T23:54:00-07:00", "title": "Don't need this"}, {"content": "Not bad. Slow to load on occasion though.", "rating": "3", "version": "107.0", "date": "2017-02-28T22:39:00-07:00", "title": "FB Messenger iPhone6"}, {"content": "App is a useful free messaging service similar to texting and is useful for when you have no credit to text but have wifi or data :) but Facebook is not the best platform anymore sadly imo", "rating": "3", "version": "107.0", "date": "2017-02-28T19:42:00-07:00", "title": "Messeging ability"}, {"content": "Whos stupid idea was to add this huge camera activating circle?!?!?! It acitvates even on swiping down when I scroll my contacts list!!!! And as usual... NO CHANGELOG NO STARS!", "rating": "1", "version": "107.0", "date": "2017-02-28T18:35:00-07:00", "title": "A 💩 CAMERA BUTTON? Really?"}, {"content": "Thanks a lot for developing this application I'm really impressed keep on with the good work and you will receive your rewards", "rating": "5", "version": "107.0", "date": "2017-02-28T17:08:00-07:00", "title": "Nice App"}, {"content": "I keep receiving a notification for a message which was sent hours ago, it appears every 10 minutes or so - over and over and over! I have tried muting the chat and even deleting it - but the notifications still keep coming through!!! Very frustrating!!", "rating": "1", "version": "107.0", "date": "2017-02-28T16:02:00-07:00", "title": "Same message over and over"}, {"content": "I update my review regularly to bring you my latest opinions...\n\n6th update this year, 57 updates in total last year \n\n146mb of a chat app that likes to control how you use it.\nSame sh*t every week.. no info on what is updated or changed on my phone.. all to keep the app in the top 10 of the charts.\n\nTo summarise another weekly update of cr*p 💩💩💩", "rating": "1", "version": "107.0", "date": "2017-02-28T15:11:00-07:00", "title": "ANOTHER 💩💩 update Part 106"}, {"content": "Can you stop mucking this app up please? Everytime I use it now I inadvertently access the camera because it's far too sensitive while scrolling down. I use an iPhone 6, so apologies if it's different on other phones. \nOn mine, Messenger use is now a pain in the a***. \nAnd what happened to who's online etc? \nWhy re-invent the wheel? Everytime you do, you end up with a puncture!", "rating": "2", "version": "107.0", "date": "2017-02-28T14:13:00-07:00", "title": "Getting annoying now!!"}, {"content": "Too many glitches now and too much like Snapchat", "rating": "3", "version": "107.0", "date": "2017-02-28T13:15:00-07:00", "title": "Good but"}, {"content": "Well over 76,000 reviews and over 50% give it only one star. Take the hint, it's crap!!\n\nNow you've reset the statistics here's my review. READ IT!!", "rating": "1", "version": "107.0", "date": "2017-02-28T09:36:00-07:00", "title": "Rubbish"}, {"content": "Quick and clear to use\nBUT\nPlease upgrade with a system that will delete a large number of messages in one go instead of one at a time and find a way to delete phone calls or missed calls.", "rating": "2", "version": "107.0", "date": "2017-02-28T08:58:00-07:00", "title": "Make it easier"}, {"content": "What is the point of hiding sections when they just reappear the next time I use the app? Make them useful features and let people hide them permanently. The interface also feels cluttered with too many icons. The new message icon could easily be on the bottom if you decluttered the bottom navigation and hid the rarely used features currently present there in a kebab icon.", "rating": "2", "version": "105.0", "date": "2017-02-28T05:10:00-07:00", "title": "UX is not user centered"}, {"content": "I just want to be able to send Facebook messages on my phone, why do I have to install a separate app, allow intrusive notifications, location tracking, and lots of other unwanted features (Stickers, camera effects, GIFs)", "rating": "1", "version": "105.0", "date": "2017-02-28T05:02:00-07:00", "title": "Why have one rubbish app when you can have two?"}, {"content": "I wouldn't care if, as users, we had an option between messenger and ...?? But there isnt so I and many others just have to suffer the incompetence of this app.\nFrozen screens, lost chat, freezing screens, its absolute rubbish. \nHow about going back to basics and creating an app that is reliable instead of adding bits on which make the whole damn thing more unstable!!\nI swear, if an alternative was introduced I'd dump this one without thought.....rubbish!!", "rating": "1", "version": "105.0", "date": "2017-02-28T02:53:00-07:00", "title": "Awful"}, {"content": "Great app, really easy to use and I've never had any problems with it 😊", "rating": "5", "version": "105.0", "date": "2017-02-27T12:24:00-07:00", "title": "N Merritt"}, {"content": "All Facebook apps are obsessed with updates. This worked fine till current update. Now won't open, so can't use messenger. Surely the ideal is to get an app working & leaving it at that? Now, to keep themselves in a job, they mess up an update so they can correct it in two weeks & thus justify their jobs", "rating": "1", "version": "105.0", "date": "2017-02-27T10:32:00-07:00", "title": "Useless update"}, {"content": "most times now when i go to view my messages its just a blank screen, please sort it out", "rating": "2", "version": "105.0", "date": "2017-02-27T03:12:00-07:00", "title": "blank screen"}, {"content": "I want to log out but all it shows\nIs switch account", "rating": "1", "version": "105.0", "date": "2017-02-26T15:23:00-07:00", "title": "Log out"}, {"content": "This app is so pointless. Takes up so much storage.. Facebook was much better without the app and just have the messenger in the FACEBOOK app 🙄🙄🙄 so annoying, keep having to delete the app to get storage but then I can't talk to none of my friends coz Facebook won't let you unless you have the app 🌝 pointless.", "rating": "2", "version": "105.0", "date": "2017-02-26T13:15:00-07:00", "title": "To be honest.."}, {"content": "I love this app. Only thing I'd change is... when someone changes their profile pic on Facebook, the pic doesn't update on messenger unless you delete the app and redownload it. Otherwise it's great.", "rating": "4", "version": "105.0", "date": "2017-02-26T13:14:00-07:00", "title": "Only one thing I'd change"}, {"content": "Pictures are not fully covering my screen have some stupid bar at the top hurry the hell up and update it", "rating": "1", "version": "105.0", "date": "2017-02-26T12:53:00-07:00", "title": "Pictures don't cover screen"}, {"content": "This app seems to want to be on constantly and connected to everything, and will pester you for not enabling all permissions regardless of how many times you refuse. I don't want notifications! Leave it be! Why do I have to have this as a separate app from Facebook? I don't want to connect my phone number or my contacts. Just leave it be. Most apps will just let it rest if the user only wants the most minimal of interaction with it, so why can't messenger take a lesson from elsewhere.", "rating": "1", "version": "105.0", "date": "2017-02-25T15:08:00-07:00", "title": "Too pushy"}, {"content": "All the emojis look like old sweaty people!!??!\n\nExplain why face book", "rating": "3", "version": "105.0", "date": "2017-02-25T14:08:00-07:00", "title": "Old sweaty emojis everywhere!!!"}, {"content": "On Facebook you can select the option to translate when a foreign language is used in text, why can't we get this option on messenger? It would make talking amongst different friends from around the world so much easier.", "rating": "4", "version": "105.0", "date": "2017-02-25T12:31:00-07:00", "title": "Translate option?"}, {"content": "Would rate 0 stars if I could theres so much problems with it\n1. Text messages keep disappearing and I have to reset the app to restore them, making my calls hang up only for them to disappear again.\n2. On my iPad a grey box pops up on the group chat settings screen every time and there seems to be no way to even temporarily get rid of it.\n3. Get rid of the active feature or have an option to turn it off so people can actually have privacy especially if it keeps glitching and saying I'm active when I'm fast asleep!", "rating": "1", "version": "105.0", "date": "2017-02-25T12:14:00-07:00", "title": "Absolutely crap"}, {"content": "Someone apparently logged into my Facebook so I changed my password my account was blocked until I did so and then it says 'lets get you set up' and a loading symbol for ever it straight up doesn't load!  😡", "rating": "1", "version": "105.0", "date": "2017-02-25T12:05:00-07:00", "title": "This is starting to annoy me"}, {"content": "I use it al the time I love it it's brilliant", "rating": "5", "version": "105.0", "date": "2017-02-25T10:20:00-07:00", "title": "Review"}, {"content": "There's no way to view archived messages. If you go to Safari, Facebook, messages it tells you to download the app... But you can't view archived messages on the app!! Needs sorted ASAP.", "rating": "1", "version": "105.0", "date": "2017-02-25T00:52:00-07:00", "title": "Can't view archived messages"}, {"content": "No one cares about this being a snapchat rip off so please undo all that rubbish. \n\nVideos don't play smoothly. When opening the app it randomly opens chats I didn't want it to meaning people know I've seen messages when I didn't want to. Crashes often. Constant annoying suggestion pop-ups are infuriating. \n\nLess is more facebook! This is an app to send messages, not snapchat and the 10 other apps you're trying to make it. Please try caring about your users for once.", "rating": "1", "version": "105.0", "date": "2017-02-24T15:43:00-07:00", "title": "Awful"}, {"content": "Since the new update of messenger the app has been stuck on waiting it won't work at all", "rating": "1", "version": "105.0", "date": "2017-02-24T06:42:00-07:00", "title": "Messenger is stuck on waiting"}, {"content": "Waste of time and space. YOU SHOULD BE ASHAMED OF YOURSELVES.", "rating": "1", "version": "105.0", "date": "2017-02-24T05:37:00-07:00", "title": "Slow, intrusive, rubbish"}, {"content": "While on fbook website, if you tap message it will open the appstore instead of messenger since the latest update, therefore you cant mesaage people not on your friends list", "rating": "1", "version": "105.0", "date": "2017-02-24T02:37:00-07:00", "title": "Fail opening messages since update"}, {"content": "This app would be great if you had a short cut to links sent and voice messages sent like you do with pictures. Having to scroll through tonnes of conversation to find a link you were sent is madness. Please fix.", "rating": "3", "version": "105.0", "date": "2017-02-23T22:54:00-07:00", "title": "Can't find links and voice messages"}, {"content": "Need to make easy to delete unwanted contacts", "rating": "4", "version": "105.0", "date": "2017-02-23T22:20:00-07:00", "title": "Delete"}, {"content": "Forced to download an app I don't want and shouldn't need, what a load of sheet!", "rating": "1", "version": "105.0", "date": "2017-02-23T13:27:00-07:00", "title": "Fraped"}, {"content": "It's a very good app. I really like this app and I advise everyone who has Facebook to download this app and use it.", "rating": "5", "version": "105.0", "date": "2017-02-23T09:14:00-07:00", "title": "Great App"}, {"content": "If Facebook cared about its users then it would clearly understand that not all users are happy with the messenger app. A lot of us have had to switch to other social media accounts to compensate. It's ridiculous that you are forced to download an app to read inboxes. If like me you are unable to download the app for numerous reasons then you have NO access to your messages. Give people the option so they can still read their messages !!!!!!", "rating": "1", "version": "105.0", "date": "2017-02-23T02:10:00-07:00", "title": "RIDICULOUS"}, {"content": "Something is up with messenger, I'm just seeing all white and no messages, please fix this soon 😫", "rating": "1", "version": "105.0", "date": "2017-02-23T00:34:00-07:00", "title": "No messages"}, {"content": "I'd like to shoot you with all the cursewords in every language I know! Obviously worthless to you as it is this comment. Stop friggin updating so much, you're making it worse! What is the main purpose of Messenger? To send a text?! Apparently not... Make a different app for your annoying copy of \"snapchat\" that keeps coming down to my screen as if I would like to have a snap of my feet. Also, i may not have a 9\" phonescreen to have a decent amount of space to click on the textview rather than on those \"stickers\" right next to this tiny space in the chat window. These things make me mess up a simple chat every single time! Unbelievably unconvenient application. Wouldn't even use it if I had a chance to see my messages through browser!!! Which I don't!!!", "rating": "1", "version": "105.0", "date": "2017-02-22T13:51:00-07:00", "title": "So much frustration"}, {"content": "If I wanted to download your app I would don't make it a necessity! absolutely pathetic who do you think you are!!?!??!?! I'll just stick to using other apps until you pull your head out your a** c*****", "rating": "1", "version": "105.0", "date": "2017-02-22T13:45:00-07:00", "title": "Pathetic"}, {"content": "Unique usability and very easy to navigate, it's the messaging app that thinks for you! Just wished the settings app was better had though", "rating": "5", "version": "105.0", "date": "2017-02-22T10:35:00-07:00", "title": "Gets better and Better!"}, {"content": "It works fine but when searching for a friend it brings up loads of random names, including those not in my friends list. Makes it difficult to find the person you're looking for and is pretty annoying.", "rating": "3", "version": "105.0", "date": "2017-02-22T08:31:00-07:00", "title": "Search is broken"}, {"content": "Where is the request messaged? I cannot find it", "rating": "3", "version": "105.0", "date": "2017-02-21T21:59:00-07:00", "title": "Would like to give it 5 stars"}, {"content": "The only thing that annoys me is how I STILL don't have access to the instant game feature on messenger even though my phone is up to date and so is my app.", "rating": "3", "version": "105.0", "date": "2017-02-21T16:43:00-07:00", "title": "Instant games"}, {"content": "IF I WANT TO GO TO SA SPECIFIC MONTH/DAY TO READ MY MESSAGES, maybe messenger can put a search box or a calendar? It might work. Thanks!", "rating": "5", "version": "105.0", "date": "2017-02-21T15:58:00-07:00", "title": "Suggestion"}, {"content": "No complaints", "rating": "5", "version": "105.0", "date": "2017-02-21T15:32:00-07:00", "title": "Always works well"}, {"content": "I've installed and uninstalled the app like 50 times to try and get it working, but it doesn't! Always pops up with some text saying 'Unable to load conversations', now I can't use messages on Facebook now cause it always tells me to download messenger app again when it doesn't work at all😠😠", "rating": "1", "version": "105.0", "date": "2017-02-21T13:38:00-07:00", "title": "Bugged out messenger!"}, {"content": "I can't send videos and pictures properly and it won't let me save any photos because apparently I haven't enabled photos on the app when I have wich is very annoying has this happened to anyone else?", "rating": "2", "version": "105.0", "date": "2017-02-21T13:29:00-07:00", "title": "This app is really annoying me"}, {"content": "Hate, hate, hate that Facebook now force you to use this on mobile rather than letting you use the site version in the app. An intrusive waste of time and storage space, and they are CONSTANTLY haranguing users to permit access to contacts etc. Total nuisance", "rating": "1", "version": "105.0", "date": "2017-02-21T13:19:00-07:00", "title": "Invasive"}, {"content": "The video chat on this app is rubbish, I try and call someone and my screen is back and the other person can't hear me. It's been like this for a while", "rating": "1", "version": "105.0", "date": "2017-02-21T12:56:00-07:00", "title": "Video chat"}, {"content": "Hate how you don't know what the updates are going to be, preferred it when there wasn't a separate app for messaging people", "rating": "1", "version": "105.0", "date": "2017-02-21T12:20:00-07:00", "title": "Annoying"}, {"content": "A well made app that's fine tuned and runs brilliantly with new features recently added to add more great ways to interact for its users. One of the \nMost frequently used apps on my iPhone 7.😀😀😀😀😀😀😀😀😀😀😀😀😀😀 5 stars from me!", "rating": "5", "version": "105.0", "date": "2017-02-21T09:43:00-07:00", "title": "Messenger A1 top of the list king of the hill."}, {"content": "The app harasses you to turn on the notifications & when you want to turn them off they stay on. It's a shame that Facebook forces us to use this annoying app!", "rating": "1", "version": "105.0", "date": "2017-02-21T05:31:00-07:00", "title": "Annoying app!"}, {"content": "Really annoying when the whole conversation disappears until you send a message. Please fix this!", "rating": "3", "version": "105.0", "date": "2017-02-21T02:44:00-07:00", "title": "Bugs present"}, {"content": "Crashes every time I try to add a photo.", "rating": "1", "version": "105.0", "date": "2017-02-21T02:38:00-07:00", "title": "Problem"}, {"content": "I'm not saying it bad but I can't get into I'm private I liked it when it came out but just stopped", "rating": "1", "version": "105.0", "date": "2017-02-20T20:01:00-07:00", "title": "Don't like it"}, {"content": "Keeps asking me to invite people to messenger when I they are talking to me via messenger app. Recipient camera not showing up but they can see me fine. Bugs need fixing.", "rating": "2", "version": "105.0", "date": "2017-02-20T15:54:00-07:00", "title": "Faults"}, {"content": "Messages disappear or don't load, has been doing this for quite a while now. Messages only reappear if you press on an old message or send another one to load the rest. I see others are having the same problem. Ridiculous.", "rating": "1", "version": "105.0", "date": "2017-02-20T15:35:00-07:00", "title": "Broken since recent updates"}, {"content": "Really slowed down and won't scroll properly. My messages are disappearing under the keyboard", "rating": "1", "version": "105.0", "date": "2017-02-20T13:41:00-07:00", "title": "Much slower"}, {"content": "I really dislike the new update. I was happy with the version I had but unfortunately was forced to update. The new version is hard to use and complicated. When I receive messages it continues to show me notifications even when I have seen them but don't wish to open them (maybe a personal preference here). I really don't get the photo section? Are you trying to be snapchat 2? All in all a poor update that's hard to use, :(", "rating": "1", "version": "105.0", "date": "2017-02-20T13:00:00-07:00", "title": "Awful update stop updating so much please"}, {"content": "Ever since I done the recent update it's saying messenger can't load my chats, tried deleting then reinstalling 4/5 times still nothing!?", "rating": "1", "version": "105.0", "date": "2017-02-20T12:54:00-07:00", "title": "Crap update!!"}, {"content": "All around a pretty solid app. It could use some basic functionality improvements though. \n\nThings like:\nUnread messages should keep the notification count up. Currently opening the app clears the message count. Which means reply then or forget about it. \n\nRemind me later:\nLinked with the above but a way to get another notification of the message at a later date. Inbox by google does this well.\n\nHide read receipts.", "rating": "3", "version": "105.0", "date": "2017-02-20T11:32:00-07:00", "title": "Pretty solid could do with some interaction improvements"}, {"content": "Use this app every single day but the last month or so it's been hopeless. Blank screen, constantly having to shut down and reopen to read messages. Messages are coming jumbled with a message stream and person not matched up. Disappointed with it, but need to use it.", "rating": "1", "version": "105.0", "date": "2017-02-20T09:00:00-07:00", "title": "Got rubbish recently!"}, {"content": "the person who makes the group should be the only person able to kick people from the group chat. The problem is that at the moment people within the group chat keep kicking people out of the group chat and it's the most annoying thing in the world. there should be an admin for a group chat, and that should be the person who created the group in the first place.", "rating": "3", "version": "105.0", "date": "2017-02-20T08:10:00-07:00", "title": "group chats"}, {"content": "Since this update I've had so many issues, can't see pages of messages to my gf unless I close and restart the app or post an emoji or something, literally pages of blank, with the odd time stamp or message appearing, sometimes old messages will appear then new ones won't or vice Versa", "rating": "1", "version": "105.0", "date": "2017-02-20T07:18:00-07:00", "title": "Update Is awful"}, {"content": "would like NOISIA emoji if possible thanks", "rating": "5", "version": "105.0", "date": "2017-02-20T05:13:00-07:00", "title": "Request for new emoji"}, {"content": "The app itself works fine most of the time. But 2 key things I wish they'd get rid of.\n1) The annoying black pop up screen and red exclamation mark insisting that I turn on notifications. I don't want to turn them on. Why do you persist is hassling me to do this? No means no. \n2) The 'active now' time stamp. So many people have complained about this. It causes so many issues in relationships and friendships and still Facebook won't remove it. People thinking that you're online when you're not and then thinking that they're being ignored or that you're talking to other men/women late at night when you're actually fast asleep. I've seen it over and over. Why does everyone have to know when we're online? Is there no privacy anymore? It's beyond ridiculous. But hey since when have Facebook actually listened to its users requests?", "rating": "1", "version": "105.0", "date": "2017-02-20T01:32:00-07:00", "title": "Annoying unwanted features still there"}, {"content": "Opened the app today and my stickers were completely reset.", "rating": "1", "version": "105.0", "date": "2017-02-20T00:32:00-07:00", "title": "Stickers got wiped"}, {"content": "Except the call feature allows for complete harassment as people take advantage of it and \"prank\" each other with relentless calls. Let me turn the god damn call feature off.", "rating": "3", "version": "105.0", "date": "2017-02-19T22:55:00-07:00", "title": "Good app except..."}, {"content": "worst ever update thropy achieved", "rating": "1", "version": "105.0", "date": "2017-02-19T12:39:00-07:00", "title": "Joke"}, {"content": "U can text all ur friends and family but mist if my family dont have it but friends do?!?!", "rating": "4", "version": "105.0", "date": "2017-02-19T10:20:00-07:00", "title": "Wow"}, {"content": "Keep getting new messages disappearing and the page is blank . Can only view once I've restarted my phone . Please fix this", "rating": "3", "version": "105.0", "date": "2017-02-19T08:27:00-07:00", "title": "Blank messages!"}, {"content": "Awesome App... almost one stop shop for communication", "rating": "5", "version": "105.0", "date": "2017-02-19T01:38:00-07:00", "title": "Essential part of daily communication"}, {"content": "Like the app. But my screen has gone black. Is\nThis to do with the update. ??", "rating": "3", "version": "105.0", "date": "2017-02-19T01:37:00-07:00", "title": "Update"}, {"content": "I don't like the layout and I don't like opening a separate app to message. \nI use it as little as possible.", "rating": "1", "version": "105.0", "date": "2017-02-19T00:14:00-07:00", "title": "Hate it and don't want to use it."}, {"content": "The camera is a pain, why is it so dominant constantly swipes on, since the latest update some of my old conversations have disappeared! Just so buggy.", "rating": "1", "version": "105.0", "date": "2017-02-18T23:40:00-07:00", "title": "Bad update"}, {"content": "App is good.can send messages and photos quickly and easily.\nWish they would give the option of turning off \"last online\" or if peoples messages have been read. Sick of messaging apps not allowing this.....encourages the people who continually message you asking why you havent replied as you have read their message. Lets grab some privacy back!!!!", "rating": "3", "version": "105.0", "date": "2017-02-18T22:41:00-07:00", "title": "Need better privacy"}, {"content": "I use this app regularly to chat with friends but last couple of updates on my iPad and iPhone 6 have a major issue. When I start chatting my messages suddenly disappear which a blank scrolling void so I can't see what has been typed. Only closing and restarting the app restores the messages before the same happens again!!! Sort please !!!!", "rating": "2", "version": "105.0", "date": "2017-02-18T12:59:00-07:00", "title": "Needs sorting"}, {"content": "Since updating the app my messenger no longer works, it doesn't show my chats but instead it shows a red bar? I've had to delete the app and reinstall it a few times just to see my chats? Fix it please its annoying having to delete it whenever i want to see a message!", "rating": "1", "version": "105.0", "date": "2017-02-18T05:16:00-07:00", "title": "Update broke mine"}, {"content": "Absolutely ridiculous, can't see messages properly, they keep disappearing. Screenshots everywhere. Literally made me wanna smash my iPad into pieces, what the **** is going on?", "rating": "1", "version": "105.0", "date": "2017-02-18T05:16:00-07:00", "title": "Messages disappearing"}, {"content": "Message requests aren't viewable after recent update. Keep getting directed to a list of people to add. Removing app and reinstalling doesn't fix the issue. Have to wait until I have a laptop to access the message request- making the app redundant! Please fix- it used to work fine!", "rating": "1", "version": "105.0", "date": "2017-02-18T03:51:00-07:00", "title": "Message requests glitch"}, {"content": "Hello now I have Aspergers a form of Autism and so do millions in the world the reason for my comment is I have hyper sensitive hearing and that means the tone that your messenger pings at actually hurts my head physically you can research this is 100% FAct now for all people out there like myself I beg that you please make it possible to change the tone please !!! As I am missing messages all the time", "rating": "3", "version": "105.0", "date": "2017-02-18T00:53:00-07:00", "title": "Sound hurts"}, {"content": "Apps great but loads with a blank message all the time and I have to send something to see the messages then it appears so annoying please sort it!", "rating": "2", "version": "105.0", "date": "2017-02-18T00:43:00-07:00", "title": "Jon"}, {"content": "The app gets updated every week but no information what has changed. \n\nOne more thing, for a messenger app, why is it so big and bloated?", "rating": "1", "version": "105.0", "date": "2017-02-17T23:13:00-07:00", "title": "No changelog"}, {"content": "When recording my audio seems to run quicker than the video making the whole video experience unenjoyable and now to top it off I can no longer listen to music while recording meaning I can't send silly videos of my friends lip syncing or even let my friends listen to extracts of what I am listening to? FIX!!", "rating": "4", "version": "105.0", "date": "2017-02-17T14:51:00-07:00", "title": "Fix the video/audio lag + ability to listen to music while recording"}, {"content": "Really reliable and a great way to communicate", "rating": "5", "version": "105.0", "date": "2017-02-17T12:41:00-07:00", "title": "Great"}, {"content": "Love messenger above all messaging apps but don't like the new camera button feature. Prefer the old button", "rating": "4", "version": "105.0", "date": "2017-02-17T11:48:00-07:00", "title": "Don't like the new camera button"}, {"content": "Used for years always reliable and a great way to keep in touch with friends in all ways.", "rating": "5", "version": "105.0", "date": "2017-02-17T11:43:00-07:00", "title": "Great messaging App."}, {"content": "Games add something... otherwise does what you want but without as smooth feel as whatsapp", "rating": "3", "version": "105.0", "date": "2017-02-17T11:11:00-07:00", "title": "Great messaging app"}, {"content": "Hate the new updated version of messenger I run a home based business and use messenger for my team support and it's constantly making messages disappear resulting in having to delete the app or restart my phone at least 15 times every day it's becoming unbearable and now as a result I've thrown my iPhone 6 at the wall and smashed it and very close to snapping my iPhone 7 in half come on apple sort it out", "rating": "1", "version": "105.0", "date": "2017-02-17T10:57:00-07:00", "title": "Rubbish"}, {"content": "Does the job", "rating": "5", "version": "105.0", "date": "2017-02-17T10:33:00-07:00", "title": "Works fine"}, {"content": "120mb for your update of messenger and 170mb for for update of Facebook!?!?!?\nWhy???? Just why????", "rating": "1", "version": "105.0", "date": "2017-02-17T10:26:00-07:00", "title": "Charlie"}, {"content": "This app has been a god send kept me in touch with family all over the world saved me a fortune it's the best thing since Sliced Bread ❤️❤️❤️", "rating": "5", "version": "105.0", "date": "2017-02-17T10:05:00-07:00", "title": "Messenger has been my BFF"}, {"content": "Don't understand the need of having a separate app for it. Was so easy just having it simply in facebook. A waste of space and time.", "rating": "1", "version": "105.0", "date": "2017-02-17T09:58:00-07:00", "title": "😕"}, {"content": "I use it daily for messages and making calls as it doesn't eat up my call and message allowance... love it! 😍", "rating": "4", "version": "105.0", "date": "2017-02-17T09:30:00-07:00", "title": "Great app."}, {"content": "App won't load my conversations so I can no longer see any of my messages or speak to my friends.", "rating": "1", "version": "105.0", "date": "2017-02-17T09:21:00-07:00", "title": "Poor"}, {"content": "Don't know how I would manage without this, it does everything you could want to keep in touch with friends and family. Just love it.", "rating": "5", "version": "105.0", "date": "2017-02-17T09:20:00-07:00", "title": "Just the best"}, {"content": "It's a good app but I would prefer if you could change the emojis back to how they were , like they are on an iPhone emoji they were better looking than the ones now please could you change them back ?", "rating": "4", "version": "105.0", "date": "2017-02-17T09:15:00-07:00", "title": "Emojis"}, {"content": "Good", "rating": "5", "version": "105.0", "date": "2017-02-17T08:43:00-07:00", "title": "!"}, {"content": "Comes up with \"could not load conversations\" even when I have perfectly working wifi and 3G", "rating": "1", "version": "105.0", "date": "2017-02-17T08:37:00-07:00", "title": "Horrific"}, {"content": "Very pleased", "rating": "5", "version": "105.0", "date": "2017-02-17T08:26:00-07:00", "title": "Excellent"}, {"content": "Helps see messages easily. The integration with the fb app is a bit funny at times.", "rating": "4", "version": "105.0", "date": "2017-02-17T08:11:00-07:00", "title": "Useful"}, {"content": "Brilliant I can talk to friend all over the world", "rating": "5", "version": "105.0", "date": "2017-02-17T08:09:00-07:00", "title": "Messenger"}, {"content": "Whooop!!!", "rating": "5", "version": "105.0", "date": "2017-02-17T08:00:00-07:00", "title": "10/10 love this app!!"}, {"content": "Need few more improvements but is okay.", "rating": "5", "version": "105.0", "date": "2017-02-17T07:51:00-07:00", "title": "Messenger"}, {"content": "What on Earth is Facebook trying to do? Aside from just blatantly copying SnapChat - 99% aren't going to be livestreaming constantly Even if you did want to livestream why would you put it in the centre of a MESSENGER app. So stupid.", "rating": "1", "version": "105.0", "date": "2017-02-17T07:44:00-07:00", "title": "So so stupid"}, {"content": "It's a reliable, well-rounded app.", "rating": "5", "version": "105.0", "date": "2017-02-17T07:11:00-07:00", "title": "I like"}, {"content": "Really easy to use and also free calls is good to", "rating": "5", "version": "105.0", "date": "2017-02-17T06:52:00-07:00", "title": "Great app"}, {"content": "After you call someone on messenger it's always asks you a lot of questions and it does get annoying", "rating": "4", "version": "105.0", "date": "2017-02-17T06:09:00-07:00", "title": "Messenger"}, {"content": "when my friends send me photos or videos they never load they're just blank", "rating": "2", "version": "105.0", "date": "2017-02-17T05:38:00-07:00", "title": "blank photos and videos"}, {"content": "Love it, never had any issues, would be nice if they expand the new photo filter feature above and beyond! :)", "rating": "5", "version": "105.0", "date": "2017-02-17T05:31:00-07:00", "title": "Spot on!"}, {"content": "Really nothing bad to say it's a great and helps me keep in touch with family", "rating": "5", "version": "105.0", "date": "2017-02-17T05:22:00-07:00", "title": "Good app"}, {"content": "I find messenger very good and easy to use.", "rating": "5", "version": "105.0", "date": "2017-02-17T05:14:00-07:00", "title": "All good"}, {"content": "I love this app and it's my main form of communication! Only 4 stars because the updates have made it slow as fb tries to destroy Snapchat. People say there are privacy issues and first of all I can't see them, pretty sure there is end to end encryption, secondly, do you have something to hide? Nowadays people talk about privacy all the time, and I do understand that there should be a level where if you don't want to use something you shouldn't have to, however I believe that really if you're trying to hide something then you are knowingly doing something wrong! Sorry about the tangent, great app :)", "rating": "4", "version": "105.0", "date": "2017-02-17T05:09:00-07:00", "title": "Use it all the time!"}, {"content": "Love it.. brilliant app and very fast", "rating": "5", "version": "105.0", "date": "2017-02-17T05:04:00-07:00", "title": "Great"}, {"content": "Obviously", "rating": "5", "version": "105.0", "date": "2017-02-17T05:00:00-07:00", "title": "The best!"}, {"content": "Messenger is my life line some days. One of my top used apps.", "rating": "5", "version": "105.0", "date": "2017-02-17T04:33:00-07:00", "title": "Well used app"}, {"content": "Messages keep disappearing?!", "rating": "1", "version": "105.0", "date": "2017-02-17T04:22:00-07:00", "title": "Awful"}, {"content": "I can't open messenger anymore :/ ever since the new update the messenger app won't work", "rating": "1", "version": "105.0", "date": "2017-02-17T04:18:00-07:00", "title": "New update ruined it"}, {"content": "Great app. Stickers and gifs are fun. Call function is handy. Use it all the time and particularly helpful for contacting a friend of a friend if someone's phone has run out of battery.", "rating": "5", "version": "105.0", "date": "2017-02-17T04:09:00-07:00", "title": "Use it all the time"}, {"content": "The request to rate the app jammed up the app and forced me to delete it and all my messages!!! The stupid 'rate this app' pop up came up while I was typing a message. The keyboard was over the top of part of the pop up so I couldn't agree or dismiss the request BUT also could not access the send button for my message. Basically disabled my app. So I am rating it now as crap and the people who wanted ratings so desperately that their request pop up ruined my use of the app can have themselves a very negative rating, 😡.", "rating": "1", "version": "105.0", "date": "2017-02-17T04:07:00-07:00", "title": "Jammed up by request to rate!"}, {"content": "App is frustrating and confusing. Made far to complicated. As Trump would say \"This app is so bad, this app is bad. Sad\"", "rating": "1", "version": "105.0", "date": "2017-02-17T03:31:00-07:00", "title": "Terrible App"}, {"content": "I use messenger all the time for chats. I was able to send my sister all my photos of our late dogs with this app, she hasn't got airdrop on her phone and emails would be too big. Thanks. X", "rating": "5", "version": "105.0", "date": "2017-02-17T03:28:00-07:00", "title": "It's really useful"}, {"content": "I just love it", "rating": "5", "version": "105.0", "date": "2017-02-17T01:45:00-07:00", "title": "Fantastic"}, {"content": "It's not what good, items which are sold is still showing for sale and people keep messaging", "rating": "3", "version": "105.0", "date": "2017-02-16T23:42:00-07:00", "title": "Facebook market"}, {"content": "This app is ok, though you can message someone on facebook without it anyway. It gets updated everyday taking up more and more memory for nothing. Give it a rest or im deleting it", "rating": "1", "version": "105.0", "date": "2017-02-16T23:06:00-07:00", "title": "Relentless updates"}, {"content": "Conversations don't show up!!! It's all blank, uninstalled and reinstalled.... still not good👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼", "rating": "1", "version": "105.0", "date": "2017-02-16T15:40:00-07:00", "title": "Frustrating 😡😡😡😡"}, {"content": "Would appreciate it if you took the \"set a reminder\" thing off for dates/times, kinda an invasion of privacy and i do not like it!!", "rating": "1", "version": "105.0", "date": "2017-02-16T15:09:00-07:00", "title": "Reminders"}, {"content": "Utterly terrible interface where settings are hidden in the app instead of the standard settings in iOS (which lets you set some things). Meanwhile the app insists on playing annoying sounds for everything and there's no way to set everything to only vibrate.", "rating": "1", "version": "105.0", "date": "2017-02-16T14:53:00-07:00", "title": "Simply awful"}, {"content": "Since updating the keyboard no longer shows up so I can't type messages...very annoying.", "rating": "1", "version": "105.0", "date": "2017-02-16T14:49:00-07:00", "title": "Update broke it"}, {"content": "Like it", "rating": "5", "version": "105.0", "date": "2017-02-16T14:40:00-07:00", "title": "Excellent app"}, {"content": "Beautiful, thank you.", "rating": "5", "version": "105.0", "date": "2017-02-16T14:04:00-07:00", "title": "Special."}, {"content": "Could there be chat heads for iOS please?", "rating": "4", "version": "105.0", "date": "2017-02-16T13:50:00-07:00", "title": "Chat Heads"}, {"content": "Vile, disgusting Suckerburg ripping off anyone he can while selling all your data. I will only tolerate so much, so now deleted.", "rating": "1", "version": "105.0", "date": "2017-02-16T12:37:00-07:00", "title": "Unashamed ripoff of snapchat, vile company"}, {"content": "Stop messing with things which used to work great. Nobody asked for \"My Day\". There's Snapchat for that. Not Messenger, not Instagram. Nobody wants to know who's online all the time. Stop adding \"features\" nobody ever wanted. And if you do, give us ways to turn your annoyance off. FIX IT. NOW.", "rating": "1", "version": "105.0", "date": "2017-02-16T12:35:00-07:00", "title": "STOP F***ING THINGS UP."}, {"content": "App works ok for me; just would be nice to know what's going to change before actually updating", "rating": "4", "version": "105.0", "date": "2017-02-16T11:40:00-07:00", "title": "Regular updates"}, {"content": "Just an idea~ make it so only the group creator can remove people from a group. I've had too many people ruin good groups because they've gotten angry or because they want to annoy people", "rating": "3", "version": "105.0", "date": "2017-02-16T09:30:00-07:00", "title": "New feature idea"}, {"content": "It has stopped updating my messages, but it still notifies me of them", "rating": "3", "version": "104.0", "date": "2017-02-16T08:37:00-07:00", "title": "Good app but glitchy"}, {"content": "Don't like the new updates with the slide down for camera option, messenger has just turned itself in to Snapchat and we don't need another snapchat. You can't refresh the page. Get rid of the slide down for camera option, horrible feature.", "rating": "2", "version": "104.0", "date": "2017-02-16T05:41:00-07:00", "title": "ITS JUST SNAPCHAT"}, {"content": "I always have problems with it why change something that wasn't broken! Plus I hate that it's a separate app uses all my data up", "rating": "1", "version": "104.0", "date": "2017-02-16T00:39:00-07:00", "title": "Hate this app"}, {"content": "Keeps crashing bloody awful", "rating": "1", "version": "104.0", "date": "2017-02-15T14:04:00-07:00", "title": "Argh"}, {"content": "Now I can't even open message requests. -.-", "rating": "1", "version": "104.0", "date": "2017-02-15T12:10:00-07:00", "title": "Still bad"}, {"content": "How can you release an app that drains my battery 1% every 2 mins? This current version is a battery killer.", "rating": "1", "version": "104.0", "date": "2017-02-15T11:22:00-07:00", "title": "If I can put negative stars I would!"}, {"content": "When opening messages the screen goes blank until you send a message, quite annoying", "rating": "3", "version": "104.0", "date": "2017-02-15T10:40:00-07:00", "title": "Blanking"}, {"content": "Absolutely love this app but I've recently updated it and now every time I go on it it says couldn't load conversations I've deleted the app and reinstalled it but still doing the same", "rating": "5", "version": "104.0", "date": "2017-02-15T06:53:00-07:00", "title": "Annoying right now"}, {"content": "All my messages with contacts are all blank screens, I can't see anything.  I've had random screenshots pop into messages and the app just freezes!!! \nWhy has it disappeared from Facebook app on iPhone, and is now a separate app???\nThis app does not work 😡", "rating": "1", "version": "104.0", "date": "2017-02-14T22:03:00-07:00", "title": "Had to DELETE!!"}, {"content": "I like the fact that you can send things to your friends but everything else is annoying especially the fact that when a video is sent to you, you cannot scroll through it and it starts again for no reason!!!", "rating": "1", "version": "104.0", "date": "2017-02-14T13:37:00-07:00", "title": "ugh"}, {"content": "Messenger is a good app if you delete it and get it back you don't need Facebook to have it.😊", "rating": "4", "version": "104.0", "date": "2017-02-14T12:44:00-07:00", "title": "Messenger"}, {"content": "Why remove the option to refresh your messages by pulling down? It now glitches so I see old messages and now I can't refresh as when I swipe down it goes to take a photo....", "rating": "2", "version": "104.0", "date": "2017-02-14T10:39:00-07:00", "title": "Horrible Update"}, {"content": "Absolutely amazing app when you have access to wifi or can use your phone's data. Free and reliable method of messaging contacts with written text, photos, videos, GIFs and more. You know if the message has been delivered and read. Highly recommend!", "rating": "5", "version": "104.0", "date": "2017-02-14T08:44:00-07:00", "title": "Necessity"}, {"content": "The new updates don't have change logs yet they ask us to update every few days. We don't know what issues have been patched. \n\nNewest update has a few bugs, one being that opening photos sent to you takes longer than it did and sometimes doesn't load at all. \n\nMessenger is a huge resource hog also. Facebook we don't need all these extra features.", "rating": "1", "version": "104.0", "date": "2017-02-14T02:05:00-07:00", "title": "New updates"}, {"content": "Since the last upgrade either of Apple or Messenger it frequently leaves a big blank space and one cannot see recent messages you know are there without deleting and reinstalling the app.  This is getting tiresome.  Please correct.", "rating": "2", "version": "104.0", "date": "2017-02-13T08:54:00-07:00", "title": "Last upgrade"}, {"content": "They need to really go back to the drawing board for this one especially when users are being compelled to use the app for messaging. \n\nConstantly crashes ... when you msg the screen blanks out and goes white and one cannot view history or the previous msg in the chat window. Only once you type and hit the send button the messages appear like magic 😑🙄. Have lost count of how many times I've had to delete and reboot the messenger. \n\nIf you are going to compel users to download an app atleast ensure it seamlessly functions please !!!", "rating": "1", "version": "104.0", "date": "2017-02-13T08:32:00-07:00", "title": "Very poor and crashes constantly"}, {"content": "No one app for the next day and", "rating": "5", "version": "104.0", "date": "2017-02-13T08:18:00-07:00", "title": "Best app ever"}, {"content": "App keeps crashing and won't let load conversations etc but the messages still come through on my notifications however cannot delete the app as I then have to make a new messenger!! Messenger users should be able to log in and out of the app!", "rating": "4", "version": "104.0", "date": "2017-02-12T18:22:00-07:00", "title": "angry"}, {"content": "I can't give this app a good review, as i don't want to use it but i'm forced to. I also get notifications after i've sent a message? Even though no one has sent me one yet? I don't want this rubbish app. Literally have to have it though.", "rating": "1", "version": "104.0", "date": "2017-02-12T12:53:00-07:00", "title": "Why am i forced to use this?"}, {"content": "HOW CAN SUCH A CRAP APP BE AT NUMBER ONE!! YET MORE RUBBISH AND CRAP APPS AND UPDATES FROM THE SAME MUPPETS THAT BROUGHT YOU FACEBOOK! YOU DONT HAVE TO US IT! WHAT'S THE POINT OF SOCIAL NETWORKING APPS IF YOU THEN NEED TO DOWNLOAD ANOTHER APP JUST AS BAD!!! THAT TAKES UP TWICE AS MUCH SPACE!!! \nTHEY NEED TO BIN BOTH THE APPS AND GO BACK YO BASICS!!!!", "rating": "1", "version": "104.0", "date": "2017-02-12T10:43:00-07:00", "title": "RUBISH!"}, {"content": "it's okay. trying to mimic apps like snapchat and imessage but if you haven't got an iphone it's not bad!", "rating": "3", "version": "104.0", "date": "2017-02-12T07:30:00-07:00", "title": "A little slow"}, {"content": "Page goes completely white 90% of the time meaning I can't see any of the messages", "rating": "1", "version": "104.0", "date": "2017-02-12T07:15:00-07:00", "title": "Awful"}, {"content": "I like this app, but every time I update it the layout changes and I find it hard to adjust to them. Overall it's an okay app.", "rating": "3", "version": "104.0", "date": "2017-02-12T06:34:00-07:00", "title": "Too much!"}, {"content": "Simply the best messaging app available on iOS", "rating": "5", "version": "104.0", "date": "2017-02-12T06:25:00-07:00", "title": "Best messaging app available for iOS"}, {"content": "Love messenger, great for keeping in touch, sending photographs, pictures etc. Easy to use. Xx", "rating": "5", "version": "104.0", "date": "2017-02-12T06:15:00-07:00", "title": "Love it!!"}, {"content": "Use it everyday!", "rating": "5", "version": "104.0", "date": "2017-02-12T01:56:00-07:00", "title": "Fantastic"}, {"content": "I use this app all the time. I have a few friends in America who I can keep in contact with and even call them for free. I wouldn't be without it.", "rating": "5", "version": "104.0", "date": "2017-02-12T01:41:00-07:00", "title": "I love this app!!"}, {"content": "Serves no purpose, exists solely to harvest even more of your private info. This has the smell of doom about it.", "rating": "1", "version": "104.0", "date": "2017-02-11T23:07:00-07:00", "title": "A disgrace"}, {"content": "Does what a messenger app should do 👍🏽", "rating": "5", "version": "104.0", "date": "2017-02-11T18:20:00-07:00", "title": "I like the snap chat style features"}, {"content": "Love this app its good for keeping in contact with friends and family members 😁👍 x", "rating": "5", "version": "104.0", "date": "2017-02-11T17:22:00-07:00", "title": "Hi"}, {"content": "God, kids these days moan about everything. Try standing in a phone box on a wet winters night like I had to in the war with the Germans dropping bombs on your chippy and you'll have something to moan about. Messenger is fine, it works most of the time.", "rating": "5", "version": "104.0", "date": "2017-02-11T16:53:00-07:00", "title": "It's fine, stop moaning"}, {"content": "Great", "rating": "5", "version": "104.0", "date": "2017-02-11T16:46:00-07:00", "title": "Mr."}, {"content": "I don't want to use this sh***y app", "rating": "1", "version": "104.0", "date": "2017-02-11T16:45:00-07:00", "title": "Possibly the worst app ever, believe me"}, {"content": "It's a good app I enjoy using it", "rating": "5", "version": "104.0", "date": "2017-02-11T16:39:00-07:00", "title": "Cool"}, {"content": "well, offered me to update it and when I'm tryimg to take a photo and send it - just crashes. Tried three times, so, guys, fix it. Ipad mini", "rating": "2", "version": "104.0", "date": "2017-02-11T16:38:00-07:00", "title": "taking a photo"}, {"content": "I don't trust this app ..", "rating": "2", "version": "104.0", "date": "2017-02-11T16:18:00-07:00", "title": "Wopwop"}, {"content": "sweet stuff", "rating": "5", "version": "104.0", "date": "2017-02-11T16:15:00-07:00", "title": "Nice"}, {"content": "No choice but to use this app", "rating": "1", "version": "104.0", "date": "2017-02-11T16:15:00-07:00", "title": "No choice"}, {"content": "Crashes constantly in which you cannot scroll up in a conversation or the page goes white and you cant see any messages until u close and reopen then does the same thing after a minute and the layout is very poor. Always click the wrong buttons and call accidently, also the new camera feature and screen is awful, should remove that asap.", "rating": "1", "version": "104.0", "date": "2017-02-11T16:08:00-07:00", "title": "Very bad"}, {"content": "Excellent! Excellent!! Excellent!!! That's it.", "rating": "5", "version": "104.0", "date": "2017-02-11T15:51:00-07:00", "title": "😘😘😘"}, {"content": "Worked good then updated 2017 now pics don't load (iPhone 6s)", "rating": "1", "version": "104.0", "date": "2017-02-11T15:39:00-07:00", "title": "Good"}, {"content": "Love messenger", "rating": "5", "version": "104.0", "date": "2017-02-11T15:22:00-07:00", "title": "Mr"}, {"content": "Sadly these new versions in my opinion are getting worse and worse. Too much stuff added and makes it look a mess!", "rating": "2", "version": "104.0", "date": "2017-02-11T14:50:00-07:00", "title": "Getting worse sadly"}, {"content": "Love it 😍 great app👍🏽", "rating": "5", "version": "104.0", "date": "2017-02-11T13:51:00-07:00", "title": "Brilliant"}, {"content": "Usually really reliable and the call quality over the last year has went from diabolical to totally decent . Well done", "rating": "4", "version": "104.0", "date": "2017-02-11T13:34:00-07:00", "title": "Getting better every month"}, {"content": "I always use Facebook and messenger because I used to be chat with my friends and family. I really love it thank you 😊", "rating": "5", "version": "104.0", "date": "2017-02-11T13:24:00-07:00", "title": "I like to use messenger"}, {"content": "Nags for review 1*", "rating": "1", "version": "104.0", "date": "2017-02-11T13:22:00-07:00", "title": "Nags for review 1*"}, {"content": "I find this really useful app because it's easy to use and quick.", "rating": "5", "version": "104.0", "date": "2017-02-11T13:19:00-07:00", "title": "Facebook"}, {"content": "Easy to use", "rating": "5", "version": "104.0", "date": "2017-02-11T13:18:00-07:00", "title": "Review"}, {"content": "Great App Helps me keep in Touch with people far away", "rating": "5", "version": "104.0", "date": "2017-02-11T13:09:00-07:00", "title": "Messenger"}, {"content": "nice", "rating": "5", "version": "104.0", "date": "2017-02-11T13:02:00-07:00", "title": "good"}, {"content": "Constant updates to use up my data and storage space yet the only changes are gimmicky photo things that no one uses, crappy inconsistent data-hoovering pile of sh&t", "rating": "1", "version": "104.0", "date": "2017-02-11T13:00:00-07:00", "title": "Why all the updates"}, {"content": "Scroll up to see latest messages and you go straight in to camera function. Very annoying!", "rating": "3", "version": "104.0", "date": "2017-02-11T07:37:00-07:00", "title": "Annoying camera"}, {"content": "Getting fed up of not being able to delete shared pics from messenger! Sort it out!!", "rating": "3", "version": "104.0", "date": "2017-02-11T05:21:00-07:00", "title": "Can't delete shared pictures"}, {"content": "Since the update I can't get to see any of my business messages!!!!!", "rating": "1", "version": "104.0", "date": "2017-02-11T04:51:00-07:00", "title": "Rubbish"}, {"content": "It doesn't show you who is online on the iPhone 7 it tries to load but doesn't but it does on the iPhone 6 does show you not sure if it's a bug or what!!", "rating": "1", "version": "104.0", "date": "2017-02-11T04:32:00-07:00", "title": "Issue with active users"}, {"content": "I m facing problems with the latest update...often msges are being disappeared...so sometimes i cant see msges and photos sent to me...", "rating": "1", "version": "104.0", "date": "2017-02-11T04:05:00-07:00", "title": "Facing problems"}, {"content": "Worked great until last update, now won't even load up?", "rating": "3", "version": "104.0", "date": "2017-02-11T02:03:00-07:00", "title": "Great app but now crashes after update"}, {"content": "They shouldn't update this every week it's pissing me of", "rating": "1", "version": "104.0", "date": "2017-02-11T01:51:00-07:00", "title": "Not so good"}, {"content": "I mean I don't mind it too much, but I don't like that I can't access the messages through safari.", "rating": "1", "version": "104.0", "date": "2017-02-10T14:16:00-07:00", "title": "Shite that they're forcing us to use this app"}, {"content": "Tried to copy snapchat and just made messenger worse!!", "rating": "1", "version": "104.0", "date": "2017-02-10T11:12:00-07:00", "title": "Copy of snapchat"}, {"content": "Fed up of this circle button and swiping down activating the camera, when it use to refresh chat. If I wanted to send snaps I'd use snapchat. Change it back", "rating": "1", "version": "104.0", "date": "2017-02-10T09:36:00-07:00", "title": "It's not snapchat"}, {"content": "I think it's total bulls**t how you need this app to talk to your Facebook friends. Facebook was fine how it was just leave it alone!", "rating": "1", "version": "104.0", "date": "2017-02-10T07:51:00-07:00", "title": "Not impressed."}, {"content": "When sending photos to other people they are saying they can't see the picture. Bit annoying", "rating": "3", "version": "104.0", "date": "2017-02-10T05:48:00-07:00", "title": "Photos not showing"}, {"content": "Every time you get used to a new feature by the next update it changes and you have to figure out where it's gone or if it's even still there. Please stick with one style it gets so annoying to have things move around basically every month", "rating": "2", "version": "104.0", "date": "2017-02-10T04:54:00-07:00", "title": "Too many changes"}, {"content": "160MB for an instant messaging application! Are you taking the mickey?", "rating": "1", "version": "104.0", "date": "2017-02-10T02:57:00-07:00", "title": "Fricking enormous bloatware"}, {"content": "I've set up a few groups for different friends or for workmates..\nEvery now and then I like to turn off my notifications when my colleagues start posting rubbish, but now when I turn off I'm still getting notifications!!!\nRemoved and reinstalled the app but they're still pinging through!!\nSort it out please!!!", "rating": "1", "version": "104.0", "date": "2017-02-09T23:51:00-07:00", "title": "Turning off notifications not working!!!"}, {"content": "With Messenger's integration of iOS CallKit, I can no longer lock my screen during a Messenger call, as doing so ends the call. Sometimes, when I answer a call and go to my Home Screen a RED active call bar is displayed - I CAN lock my screen at this time. Mostly, however, when I answer a call and go to my Home Screen a GREEN active call bar is displayed - I CANNOT lock my screen at this time. This is totally random. Absolutely ridiculous. This app can barely get any worse in quality. Terrible, terrible app coding.\n\nUPDATE: I can now lock the screen, regardless of active call bar colour, but once locked, pressing the Home or Power buttons does not immediately wake the phone up. There's about a 15-second delay. Also, locking the screen as above with Speaker deactivated STILL ends the call.\n\nRidiculous.", "rating": "1", "version": "104.0", "date": "2017-02-09T19:30:00-07:00", "title": "Garbage"}, {"content": "should be able to access messenger through the facebook app. it's a waste of storage to have two separate apps.", "rating": "1", "version": "104.0", "date": "2017-02-09T16:37:00-07:00", "title": "WASTE OF STORAGE"}, {"content": "Will you please stop the app asking do I want to sync my phone contacts - I've said no at least a million times ... what makes you think I'll change my mind for the millionth time? I'm more inclined to delete the app than be cajoled into doing something I don't want to.", "rating": "1", "version": "104.0", "date": "2017-02-09T12:04:00-07:00", "title": "Sync phone contacts - no thanks"}, {"content": "Hate this app being separate from Facebook as it always crashes if it even loads in the first place and at best it is slow. Had deleted it and was happy but I am now forced to reinstall if I want to read any messages I've been sent. I'd prefer to opt out and have no messages at all on the platform. People know how to get hold of me in other ways but it's impossible not to be messaged on this unless you block everyone as there is no opt out if you use Facebook. Some people don't use whatsapp so why can't I opt out of using this crappy messenger service? Even deleted the messages still come. Arghh!!!", "rating": "1", "version": "104.0", "date": "2017-02-09T10:12:00-07:00", "title": "Rubbish app only using as forced to!"}, {"content": "So buggy", "rating": "1", "version": "104.0", "date": "2017-02-09T06:53:00-07:00", "title": "I hate this app"}, {"content": "It's very easy to use but we can make call and video call chats as well that's all very good", "rating": "5", "version": "104.0", "date": "2017-02-09T05:13:00-07:00", "title": "Good service"}, {"content": "Messenger is not working in my iphone 6s till from last version!!when i open's the app it starts loading and the loading never ends!!\nPlease fix this!!", "rating": "1", "version": "104.0", "date": "2017-02-09T01:34:00-07:00", "title": "Messenger is not working!!"}, {"content": "Yes great I have been using messengers for over two years now and find great.", "rating": "5", "version": "104.0", "date": "2017-02-09T00:09:00-07:00", "title": "Great product"}, {"content": "Great app. Does what you need it too. Home screen can look a bit confusing, particularly if you want to write to someone who you haven't for a while.", "rating": "4", "version": "104.0", "date": "2017-02-08T22:43:00-07:00", "title": "Very useful"}, {"content": "Excelent", "rating": "5", "version": "104.0", "date": "2017-02-08T22:24:00-07:00", "title": "Dinte"}, {"content": "Can't view who's active \nDefinitely the new update\nSort it asap!", "rating": "1", "version": "104.0", "date": "2017-02-08T20:01:00-07:00", "title": "New update"}, {"content": "Good way to contact people", "rating": "5", "version": "104.0", "date": "2017-02-08T16:28:00-07:00", "title": "Sarah"}, {"content": "Do not use this app if you can avoid it!!! Regular updates that are unauthorised and unwanted!", "rating": "1", "version": "104.0", "date": "2017-02-08T15:57:00-07:00", "title": "Too many faults to mention!"}, {"content": "Well done", "rating": "5", "version": "104.0", "date": "2017-02-08T15:33:00-07:00", "title": "Well done"}, {"content": "Too many updates waste of space", "rating": "1", "version": "104.0", "date": "2017-02-08T14:16:00-07:00", "title": "Fb"}, {"content": "162mb!!! What in earth's name can make this insignificant simple app be so large. I think you need to look at the source code and start removing what's not needed.", "rating": "1", "version": "104.0", "date": "2017-02-08T13:53:00-07:00", "title": "Bloat-ware"}, {"content": "I have an account on messenger and use it frequently however I don't have a fb account. \n\nI've recently gotten a new phone and downloaded the app there but I can't log in without facebook unless I create a new account! \n\nThis is very annoying as I now can't view my chats or talk to contacts on the app without creating a new account which is not what I want to do...\n\nThere needs to be a option to log in w/o a fb account where you don't have to create a whole new messenger account", "rating": "3", "version": "104.0", "date": "2017-02-08T11:56:00-07:00", "title": "CANT LOG IN WITHOUT FACEBOOK"}, {"content": "Going to delete app tired of updates very few weeks", "rating": "2", "version": "104.0", "date": "2017-02-08T10:34:00-07:00", "title": "Not another update"}, {"content": "They need to put log-out as well..", "rating": "1", "version": "104.0", "date": "2017-02-08T09:24:00-07:00", "title": "Log out"}, {"content": "As much as app is easy to use, the problem is privacy, read the small print and what you are handing over to facebook to be allowed to do, not only that they blackmail you to have it on smart phones which I think is horrific. iPhones no longer let you use Facebook emails on safari!! So if you don't want to hand you privacy over you have to load up a laptop every time to read an email. Apple are equally to blame for allowing it!!!", "rating": "1", "version": "103.0", "date": "2017-02-08T06:05:00-07:00", "title": "Facebook are bullies."}, {"content": "There used to be a way of appearing inactive. This is no longer available despite your help page instructions. The 'active' tab has disappeared. Bloated too", "rating": "1", "version": "103.0", "date": "2017-02-07T15:30:00-07:00", "title": "No privacy"}, {"content": "Messages aren't sending, keeps logging me out after every use.", "rating": "1", "version": "103.0", "date": "2017-02-07T11:16:00-07:00", "title": "Keeps Crashing"}, {"content": "It's just the same as most updates, good 👍 but my first problem has been with this update, my chat list won't load whatsoever no matter how long I wait 😕 fix this as it's rather annoying so you lost a star lol", "rating": "3", "version": "103.0", "date": "2017-02-07T10:44:00-07:00", "title": "Where's my chat list?"}, {"content": "The new update makes the messenger notify me of a new message even when there is none. Pls fix it. Thanks.", "rating": "2", "version": "103.0", "date": "2017-02-07T09:05:00-07:00", "title": "Shows a message when there is none"}, {"content": "New messages cannot be see unless you send a reply. Come on Facebook, you are better than this. Do not tinker too much on something that is working fine.", "rating": "3", "version": "103.0", "date": "2017-02-07T07:54:00-07:00", "title": "Nee Update"}, {"content": "Idk who are these silly developers at Facebook, they should keep it a chat app instead of mimicing the Messages.app, the app is meant to be kept lightweight and user friendly but this is just the opposite of it.", "rating": "1", "version": "103.0", "date": "2017-02-07T01:12:00-07:00", "title": "Keep this a chatting app"}, {"content": "I think messenger is really handy to use it's a lot easier to talk to people I'd give it a big 👍🏻👍🏻", "rating": "5", "version": "103.0", "date": "2017-02-06T23:47:00-07:00", "title": "Very good"}, {"content": "170mb for a messenger?! Also annoyed at redundant facebook app. This should be integrated", "rating": "1", "version": "103.0", "date": "2017-02-06T23:43:00-07:00", "title": "Bad"}, {"content": "It took a lot of storage space for fb messenger.. This can cause some problem for 16GB/32GB iphone&ipad users.. It would be great to optimise the app storage size.. Thx.", "rating": "1", "version": "103.0", "date": "2017-02-06T23:25:00-07:00", "title": "Storage space is a big issue"}, {"content": "It's awful when you have to waste 170+mb just to read messages in your another app", "rating": "1", "version": "103.0", "date": "2017-02-06T21:55:00-07:00", "title": "Most annoying thing from Mark"}, {"content": "Very un reliable, no sign out button, its incredibly slow and not very easy to navigate, i don't like people knowing when i was last online and i think there should be a way to turn that off, overall i don't think this is a very trust worthy app and if i didnt have to use it to contact certain people i most definately would not use it, the second i find something else to use i will un install this terrible app", "rating": "1", "version": "103.0", "date": "2017-02-06T17:32:00-07:00", "title": "Terrible app"}, {"content": "I despise the reluctancy to allow easy app switching, e.g. two prompts before link opens spotify. I hate the in-app browser, I want an option to switch these annoying things off. facebook really doesnt want you to leave their app.\n\nthe group video calling is great.\nending this on a positive note.", "rating": "2", "version": "103.0", "date": "2017-02-06T16:23:00-07:00", "title": "prison"}, {"content": "Constantly accidentally sending people messages, needs a confirm button.", "rating": "1", "version": "103.0", "date": "2017-02-06T14:50:00-07:00", "title": "Bad"}, {"content": "Messenger has been with me since I got the iPhone and there was no problem with this app at all. Also like there was lots of improvements and new functionality throughout the years.", "rating": "4", "version": "103.0", "date": "2017-02-06T14:26:00-07:00", "title": "Good communicator"}, {"content": "Every time I get a message all I hear is ding ding ding over and over and over it is so annoying please fix", "rating": "2", "version": "103.0", "date": "2017-02-06T14:04:00-07:00", "title": "Audio bug"}, {"content": "Had the app for years. Recent update has ruined it, very buggy now. Messages won't appear when I click on convo's, takes a while to fix itself which is very frustrating.", "rating": "2", "version": "103.0", "date": "2017-02-06T13:31:00-07:00", "title": "Dr"}, {"content": "I don't see why I need two apps for Facebook/ Facebook should combine them into one. Pointless", "rating": "1", "version": "103.0", "date": "2017-02-06T12:49:00-07:00", "title": "Unnecessary"}, {"content": "Takes up a lot of memory like the Facebook app, always have atleast 18 unread messages from years ago that I cba to scroll down and look at. Oh and you've taken up pretty much all of my left over memory. Lol rubbish.", "rating": "1", "version": "103.0", "date": "2017-02-06T12:06:00-07:00", "title": "Rubbish!"}, {"content": "Can't complain. It serves its purpose", "rating": "5", "version": "103.0", "date": "2017-02-06T12:04:00-07:00", "title": "Really good app"}, {"content": "This has fast become one of my main means of communication.", "rating": "4", "version": "103.0", "date": "2017-02-06T11:37:00-07:00", "title": "Not bad -- I use it a lot"}, {"content": "Crap crap more crap", "rating": "1", "version": "103.0", "date": "2017-02-06T11:29:00-07:00", "title": "Absolutely crap"}, {"content": "gid updates in that gid gone boyss xx", "rating": "5", "version": "103.0", "date": "2017-02-06T10:51:00-07:00", "title": "decent"}, {"content": "+++++ easy to use and very handly👌👌👌", "rating": "5", "version": "103.0", "date": "2017-02-06T10:45:00-07:00", "title": "Simonas"}, {"content": "Use this more often than actual texts 😊", "rating": "5", "version": "103.0", "date": "2017-02-06T10:42:00-07:00", "title": "Good"}, {"content": "Makes life easier to keep in touch with friends", "rating": "5", "version": "103.0", "date": "2017-02-06T10:15:00-07:00", "title": "Like it"}, {"content": "No need to have it compulsory", "rating": "1", "version": "103.0", "date": "2017-02-06T09:57:00-07:00", "title": "Bloat ware"}, {"content": "Why", "rating": "1", "version": "103.0", "date": "2017-02-06T08:08:00-07:00", "title": "Why are you trying to copy Snapchat"}, {"content": "Why on earth do you have to have yet another app incorporate it into the face time app or just leave it as it was. Downloaded sent one message and now deleted.", "rating": "1", "version": "103.0", "date": "2017-02-06T07:51:00-07:00", "title": "Waste of space"}, {"content": "Since the new update I can't even open the app without it crashing constantly and then freezing my whole phone for a while and if I go through safari to check messages it takes me back to messenger😡 not happy at all! Fix it or bin it! In a result to all this I have deleted the messenger app and facebook👍🏼", "rating": "1", "version": "103.0", "date": "2017-02-06T05:33:00-07:00", "title": "Update"}, {"content": "Crashed and unable to see any messages. All old messages have been deleted", "rating": "1", "version": "103.0", "date": "2017-02-06T03:03:00-07:00", "title": "Poor"}, {"content": "First Facebook force you to install this to read your messages and on top of that every time you do open it you're ask 2 or 3 times if you want to turn on notifications. No I do not. And it doesn't remember your setting so you are constantly asked each time. Total rubbish and sad bully tactics to get you to use it more. On top of this the safari version now forces you to use it.", "rating": "1", "version": "103.0", "date": "2017-02-05T23:50:00-07:00", "title": "Awful and very annoying"}, {"content": "It's not great but it's okay if you have a phone number.", "rating": "2", "version": "103.0", "date": "2017-02-05T23:34:00-07:00", "title": "You have to have a phone number"}, {"content": "Please change the app notification sound it gives me anxiety. I dislike the sound so much. Please just make the message sound like the whatsapp notification sound.", "rating": "2", "version": "103.0", "date": "2017-02-05T14:09:00-07:00", "title": "Please change the notification sound"}, {"content": "Video option quality is awful and makes my phone slow and hot", "rating": "2", "version": "103.0", "date": "2017-02-05T13:58:00-07:00", "title": "Slow"}, {"content": "The profile photo I have on there is from a long time ago...changed my fb profile photo but it won't change and update on chat! VERY annoying!!", "rating": "1", "version": "103.0", "date": "2017-02-05T07:50:00-07:00", "title": "Won't update profile picture"}, {"content": "New update hides messages when I click on conversations until I send a new message, and even then only a few previous messages come up... not good", "rating": "1", "version": "103.0", "date": "2017-02-05T06:46:00-07:00", "title": "Rubbish"}, {"content": "Please put the voice recording button back to how it was! It's too small and your finger slips off it recording only half a message.\n\nAlso if you muck up a voice message you can't swap to the side to cancel it.\n\nPlease put the original voice message button back (the big red REC button that you hold) an allow to swap off screen to cancel the message", "rating": "1", "version": "103.0", "date": "2017-02-05T05:41:00-07:00", "title": "Voice Record Button Too Small"}, {"content": "When there is plenty of opportunity to streamline and improve Facebook they have instead made the misguided decision to force users to download a whole separate, clunky app and completely remove the function for messages without it. How backwards can you get? No wonder this has alienated and irked so many once happy customers. Where is the harm in giving people the CHOICE of downloading the app or continuing with the completely adequate built-in messaging on Facebook? If it ain't broke, don't fix it. Please rethink ASAP.", "rating": "1", "version": "103.0", "date": "2017-02-05T05:05:00-07:00", "title": "Backwards."}, {"content": "Since I've updated it. It's not let me see my messages, every time I go to go on messenger it saying 'couldn't load conversations' I've tried deleting it and reinstalling it but is constantly carrying on", "rating": "1", "version": "103.0", "date": "2017-02-04T15:26:00-07:00", "title": "Not working"}, {"content": "would love if they'd get rid of that thing where all your previous messages are replaced with white space", "rating": "3", "version": "103.0", "date": "2017-02-04T14:09:00-07:00", "title": "use it for most of my messaging purposes"}, {"content": "Aaaa i cannot believe...still i cannot set auto reply for the private messages...what a useless app...dont download it!", "rating": "1", "version": "103.0", "date": "2017-02-04T09:39:00-07:00", "title": "No auto response"}, {"content": "Don't like it, gives no advantage. Except I have no choice if I want to pick messages up on my phone! So like it even less!", "rating": "1", "version": "103.0", "date": "2017-02-04T09:14:00-07:00", "title": "Enforced Rubbish!"}, {"content": "Update: I've now deleted the Messenger & Facebook app. I'll be using the safari version instead. Facebook are now trying to make it difficult to access messages via safari too (this problem can be fixed by switching the Safari browser page to desktop mode). Now on to the reasons for uninstalling:\n\nThe new pull down to access the camera 'feature' is as annoying as hell, it's something I will never use, yet I keep swiping by accident as this is the usual method to refresh messages within an app. \n\nAlso, I don't want people knowing when I was last active on Facebook. Surely this should be optional. The app is far too intrusive. Please allow us some privacy.", "rating": "1", "version": "103.0", "date": "2017-02-04T04:59:00-07:00", "title": "No privacy & annoying notifications"}, {"content": "Don't mind the app but it's 150mbs!! It's too big. Personally I would prefer it to be more light weight.", "rating": "1", "version": "103.0", "date": "2017-02-04T03:24:00-07:00", "title": "Why am I so massive (partridge quote)"}, {"content": "Images, gifs and videos are outrageously slow to load. Are you actually testing performance? Using an iPhone 7 and images are blank, and videos won't play. \n\nResting on your laurels 'cause it's easier to contact people via FB than their phone number. Otherwise WhatsApp would win hands down. Come on guys!!", "rating": "1", "version": "103.0", "date": "2017-02-03T13:50:00-07:00", "title": "Unbearably slow"}, {"content": "Camera button at the bottom centre of screen that's dam annoying and then scroll down and the f***ing camera again!!!!! Sort it!!!!", "rating": "1", "version": "103.0", "date": "2017-02-03T10:24:00-07:00", "title": "Shocking"}, {"content": "So Yet another update and still it won't even OPEN on the watch!\n\nAfter contacting Facebook through a variety of methods, the Apple Watch app is STILL broken!\n\nI will be complaining to Apple Support. \n\nApps should not be in the App Store if they don't open", "rating": "1", "version": "103.0", "date": "2017-02-03T10:24:00-07:00", "title": "Fix the Watch App!"}, {"content": "Every so often the screen is blank, and I can not see my messages. I've deleted it and then reinstalled but it still happens. Please sort it out !!", "rating": "1", "version": "103.0", "date": "2017-02-03T07:58:00-07:00", "title": "WHITE BLANK SCREEN 😡"}, {"content": "Whenever someone sends me a  photo on messenger especially in group chats, it appears as blank box. I have to then look in shared photos to see it but recently this has stopped working too, so i can no longer view photos on messenger that i receive.", "rating": "1", "version": "103.0", "date": "2017-02-03T06:47:00-07:00", "title": "Photos appear blank"}, {"content": "You fuckt something up with the messanger iam not able tonload old masseges fix it up please", "rating": "1", "version": "103.0", "date": "2017-02-03T02:02:00-07:00", "title": "Messanger is down"}, {"content": "Now this app is losing earlier messages from threads ... is this punishment for batting away the pop up telling me to send my friends stupid gifs? I hate this app but have to be on it to communicate with some friends. Avoid if at all possible", "rating": "1", "version": "103.0", "date": "2017-02-03T01:06:00-07:00", "title": "WTF happened to messenger?"}, {"content": "If your going to make an update please make sure it works. Messenger is still trying to upgrade and been doing that for hours keeps failing", "rating": "1", "version": "103.0", "date": "2017-02-02T22:20:00-07:00", "title": "Peeved off"}, {"content": "Fixed it please", "rating": "2", "version": "103.0", "date": "2017-02-02T18:27:00-07:00", "title": "😡it's ap has gone down hell it's messed up"}, {"content": "What have you done? It's terrible? All my messages keep disappearing!! Back to whatsapp, who also promise everything written on there is private, and will STAY private!!", "rating": "1", "version": "103.0", "date": "2017-02-02T14:09:00-07:00", "title": "Rubbish update!!"}, {"content": "You've got a virus circulating sending people their profile pic with a \"YouTube video\" from their actual friends, which is actually the virus! App deleted until you sort it out!!!", "rating": "1", "version": "103.0", "date": "2017-02-02T13:07:00-07:00", "title": "VIRUS!!"}, {"content": "After the latest update I can't even open the app without it crashing. The app opens for a second and instantly shuts down, this was never a problem before but since the latest update I can't even open it. I'd go on safari and check my messages there but instantly redirected to messenger which shuts down as soon as", "rating": "1", "version": "103.0", "date": "2017-02-02T13:02:00-07:00", "title": "Major crashes"}, {"content": "Since current (v103.0) ios 10.2 (5s), literally watch 10% drain every 2-3mins while using :(", "rating": "3", "version": "103.0", "date": "2017-02-02T11:15:00-07:00", "title": "More than usual battery drain"}, {"content": "It's marvellous!\n\nUse every day", "rating": "5", "version": "103.0", "date": "2017-02-02T11:00:00-07:00", "title": "It's wonderful"}, {"content": "Everyday I'm asked to join messenger or friends see to invite me! I have messenger! It's rubbish and it just gets worse when you're always invited to something you have already! Please sort this crap out.", "rating": "1", "version": "103.0", "date": "2017-02-02T10:49:00-07:00", "title": "Always being asked if I have messenger"}, {"content": "Absolutely brilliant", "rating": "5", "version": "103.0", "date": "2017-02-02T10:37:00-07:00", "title": "Facebook messenger review"}, {"content": "This app has definitely improved. I don't like that you can't contact any of you're Facebook friends privately without this app though.", "rating": "3", "version": "103.0", "date": "2017-02-02T10:22:00-07:00", "title": "..."}, {"content": "Easy to use and simple to get used to", "rating": "5", "version": "103.0", "date": "2017-02-02T10:20:00-07:00", "title": "Excellent"}, {"content": "It's annoying that you have to download the messenger app on top of the original Facebook app which takes up unnecessary space. Messenger doesn't allow you to view messages for any of your Facebook pages, so if you try to access those messages you need to use a computer as phone Facebook just tells you to download the messenger app, which I already have 😒 the new camera feature is annoying, if I swipe too far up suddenly I'm just staring at my face with stupid image suggestions. It also makes me feel uncomfortable as I can't help but wonder if the app constantly has access to my front camera while I'm using it. Basically texting is way better but because everyone uses it in order to keep up with the chat you have to download it.", "rating": "2", "version": "103.0", "date": "2017-02-02T10:18:00-07:00", "title": "It's ok but has it's problems"}, {"content": "Since the new update, I'm not able to even open messenger. It keeps saying \"couldn't load messages\". Despite uninstalling it, it still isn't working....", "rating": "1", "version": "103.0", "date": "2017-02-02T10:00:00-07:00", "title": "Not working"}, {"content": "Fast, elegant, and a little bit saucy 👌", "rating": "5", "version": "103.0", "date": "2017-02-02T09:25:00-07:00", "title": "Propa good stuff 👌👌"}, {"content": "Still can't play the instant games", "rating": "1", "version": "103.0", "date": "2017-02-02T09:03:00-07:00", "title": "Rubbish"}, {"content": "I am annoyed with the update because it is going bloody slow. It is getting rubbish stupid thing.", "rating": "1", "version": "103.0", "date": "2017-02-02T08:03:00-07:00", "title": "Annoyed with the update"}, {"content": "Terrible. Just terrible. Each update makes it worse somehow. Only gave it one star as you can't give negative stars.", "rating": "1", "version": "103.0", "date": "2017-02-02T06:56:00-07:00", "title": "Why?"}, {"content": "Always worked well for me.", "rating": "5", "version": "103.0", "date": "2017-02-02T06:42:00-07:00", "title": "Review"}, {"content": "Pathetic insecure app Apple with their sole iDevices are far better protected 😕", "rating": "1", "version": "103.0", "date": "2017-02-02T06:03:00-07:00", "title": "Lord"}, {"content": "Great example of bloat-ware and not listening to what your customers want. Massive.", "rating": "1", "version": "103.0", "date": "2017-02-02T04:52:00-07:00", "title": "Choc full of stuff you don't want"}, {"content": "Long-winded, glitchy, don't like the privacy features (or lack of them should I say). Just take the icon off FB as it's just irritating (now that it doesn't work).", "rating": "1", "version": "103.0", "date": "2017-02-02T04:41:00-07:00", "title": "Poo"}, {"content": "Either I'm being really thick or for iPhone users it doesn't allow you to have the option of a chat head open that works while on other apps, so you have to keep swapping from the app you're on back to messenger. Not a massive problem but it's quite frustrating when you're trying to plan something/playing a game and you've got to swap between the two.", "rating": "4", "version": "103.0", "date": "2017-02-02T03:55:00-07:00", "title": "No chat heads"}, {"content": "I like talking to my friends because they are my friends i enjoy it", "rating": "5", "version": "103.0", "date": "2017-02-02T02:57:00-07:00", "title": "Facebook fan"}, {"content": "Is great. Can talk to friends for free anywhere in the world for free. Excellent way of communication.", "rating": "5", "version": "103.0", "date": "2017-02-02T02:01:00-07:00", "title": "Messenge"}, {"content": "Never had a problem, easy to use", "rating": "4", "version": "103.0", "date": "2017-02-02T01:35:00-07:00", "title": "Love messenger"}, {"content": "The calls don't work which is really annoying.", "rating": "3", "version": "103.0", "date": "2017-02-02T00:48:00-07:00", "title": "It's good but only for messaging"}, {"content": "The new design is terrible, why the hell does it look like Snapchat, take it off! Improve the design better, make it more up to date... jheez terrible Facebook", "rating": "1", "version": "103.0", "date": "2017-02-02T00:08:00-07:00", "title": "New Design"}, {"content": "Useless app", "rating": "1", "version": "103.0", "date": "2017-02-02T00:08:00-07:00", "title": "Kxysieg"}, {"content": "For any comms, Messenger is THE GO TO medium! Calls, chats images etc. it's the best! Thanks for being here \nPeterx", "rating": "5", "version": "103.0", "date": "2017-02-01T23:21:00-07:00", "title": "Best comms"}, {"content": "Latest update crashes or will open the chat but show nothing but a blank screen. \nPlease fix asap", "rating": "1", "version": "103.0", "date": "2017-02-01T22:49:00-07:00", "title": "Hate this app!!!"}, {"content": "NO,I do not want to upload my contacts GET IT. I am fed up of being hassled to upload my contacts. PEE me off much more & the app gets deleted!", "rating": "1", "version": "103.0", "date": "2017-02-01T18:39:00-07:00", "title": "Contacts"}, {"content": "The notification that came up never gave me the opinion to don't write a review. So here I I'am, writing a review to get peace from notifications popping up", "rating": "1", "version": "103.0", "date": "2017-02-01T18:06:00-07:00", "title": "Forced the do this!!!"}, {"content": "Another update that did nothing", "rating": "1", "version": "103.0", "date": "2017-02-01T14:14:00-07:00", "title": "Updates updates, updates"}, {"content": "same bugs, same problems... lazy developers again. you should all be fired", "rating": "1", "version": "103.0", "date": "2017-02-01T13:55:00-07:00", "title": "another release and no fixes"}, {"content": "A fast, elegant and easy to use messaging system.", "rating": "5", "version": "103.0", "date": "2017-02-01T13:43:00-07:00", "title": "Brilliant"}, {"content": "The last 2 updates have messed up this otherwise great app. I cannot open the app to use it, I've deleted it & reinstalled but no joy, please please fix it!!!", "rating": "1", "version": "103.0", "date": "2017-02-01T13:38:00-07:00", "title": "Will not open 😡"}, {"content": "Big rubbish!!! ......aaa,wait!!!!half star,it is very big rubbish!!!128 Mb update weekly????wtf ????I will need 256Gb Iphone only for two apps????", "rating": "1", "version": "103.0", "date": "2017-02-01T13:21:00-07:00", "title": "Jaf"}, {"content": "My messages won't load I click on them and it's a blank screen!!!! So frustrating", "rating": "1", "version": "103.0", "date": "2017-02-01T12:04:00-07:00", "title": "Grrr"}, {"content": "First of all, why 170mb for a messaging app? Second, facebook just keep asking to download this rubbish app!!", "rating": "1", "version": "103.0", "date": "2017-02-01T10:25:00-07:00", "title": "Terrible app"}, {"content": "The security problems with this app are widely covered on the web.  If you try to use Facebook on your mobile you are forced to download it if you want to read messages. It's a second rate messaging system that's deeply flawed that you're forced to use. Avoid if at all possible.\n\n*Fresh Update*\n\nThis has so many security and privacy flaws that they keep releasing new versions to clear out all the one star reviews. \n\nYou will get a better feel for how this app functions if you click across to read the reviews for all historic releases of the product. \n\n*Update for latest version*\n\nBelieve it or not - this app is getting worse. Pop ups keep harassing you to allow it to send you notifications to your phone. They want access to all your contacts so they can contact them to get them on Messenger. You don't get to say no just one time - if you don't say \"Yes\" then they ask you every time you log in. Keeps demanding more of your personal info too. How on earth is this an Apple \"Editors' Choice\"?", "rating": "1", "version": "103.0", "date": "2017-02-01T09:54:00-07:00", "title": "Insecure & Cumbersome"}, {"content": "im still unable to play the instant games and its been a while.", "rating": "2", "version": "102.0", "date": "2017-02-01T04:05:00-07:00", "title": "cant play the instant games"}, {"content": "To many bells and whistles, I just want to send quick simple messages and not have to scroll through game options and other things the app thinks I'll like", "rating": "3", "version": "102.0", "date": "2017-02-01T00:01:00-07:00", "title": "Too many bells and whistles"}, {"content": "Can you please fix the messages that keep disappearing if you scroll, or even when you have just received them! I do not wish to keep having to turn my iPhone off and on again to fix this.", "rating": "1", "version": "102.0", "date": "2017-01-31T15:35:00-07:00", "title": "Fix the disappearing messages!"}, {"content": "''Tis good however on iPad 4 generation it's slow. Add scrolling typing! Also shrink the size of the app it's too large.", "rating": "5", "version": "102.0", "date": "2017-01-31T14:35:00-07:00", "title": "Nice"}, {"content": "It's okay for a bit untill it started crashing and glitch if\nNot\nImpressed\n😡", "rating": "2", "version": "102.0", "date": "2017-01-31T11:07:00-07:00", "title": "NOPE"}, {"content": "Fat e bar si", "rating": "2", "version": "102.0", "date": "2017-01-31T06:04:00-07:00", "title": "Mbar si"}, {"content": "Buggy, especially during video calls and exiting calls.", "rating": "2", "version": "102.0", "date": "2017-01-31T05:54:00-07:00", "title": "Bugg"}, {"content": "Downloaded latest version on 25th, however cannot open when latest Facebook was downloaded on 27th Jan. I've had to revert to using the  'Friendly' App to gain access to my Facebook account.  Please can you fix the bug causing this problem. Thank you.", "rating": "1", "version": "102.0", "date": "2017-01-31T02:48:00-07:00", "title": "Cannot Open"}, {"content": "It prevents me from seeing messages on my Facebook page - tells me to open Messenger but it only wants to open in the App Store - but the only option there is to open it!\n\nNo trace of messages I have seen and responded to. Some messages don't appear for ages - by which time offense has been caused by my failure to reply.\n\nA complete mess.", "rating": "1", "version": "102.0", "date": "2017-01-31T01:15:00-07:00", "title": "I hate this App"}, {"content": "Half of my messages have disappeared.. And I've certainly not deleted them.", "rating": "1", "version": "102.0", "date": "2017-01-30T13:44:00-07:00", "title": "Where's my messages?!"}, {"content": "I don't know why they have updated the messenger, it was perfect the way it was! sick of daft updates all the time, why can't you's just keep it the same it doesn't need to be messed with!!!!", "rating": "1", "version": "102.0", "date": "2017-01-30T13:18:00-07:00", "title": "Awful!"}, {"content": "I've been on a waiting list to play in-app games for two months???? Why can't I play games??? It's not the biggest inconvenience, but it's definitely annoying.", "rating": "2", "version": "102.0", "date": "2017-01-30T12:25:00-07:00", "title": "Not impressed"}, {"content": "How do I no longer get notifications when I receive a message???? I'm missing important stuff because this used to be a great app now it's completely rubbish....", "rating": "1", "version": "102.0", "date": "2017-01-30T01:00:00-07:00", "title": "Absolute rubbish!!!"}, {"content": "Easy to use and contact friends and family, well done facebook ❤❤❤❤❤", "rating": "5", "version": "102.0", "date": "2017-01-29T18:15:00-07:00", "title": "VERY GOOD"}, {"content": "Maybe instead of trying to make messenger into snapchat, you should make sure it's not filled with bugs and ready to either crash or white out half your messages. You know, making a worse app is just going to make competitors look better in comparison.", "rating": "1", "version": "102.0", "date": "2017-01-29T15:15:00-07:00", "title": "Unimpressed"}, {"content": "I'd love to use before but now is just getting worse.", "rating": "1", "version": "102.0", "date": "2017-01-29T13:13:00-07:00", "title": "Very poor voice"}, {"content": "This is the most annoying app with the most aggressive popup advert ever. Most annoying popup direction messages that one can't get rid of. I couldn't chat normally because of it on my FB app and I couldn't get rid of the popup \"help\" messages on the bloody thing. It made me delete the messenger app and the FB app all together as they don't seem to work chat wise without each other. \nThis app is a true piss take!! \nWhoever made it needs to be shot in the head! \nFinally big FO from me idiots!!", "rating": "1", "version": "102.0", "date": "2017-01-29T01:24:00-07:00", "title": "Most annoying app"}, {"content": "Only use when whatsapp/Skype isn't an option. But does the job.", "rating": "3", "version": "102.0", "date": "2017-01-29T01:01:00-07:00", "title": "Secondary option"}, {"content": "The app update will not update since yesterday and repeatedly keeps failing. 24hrs later and it's still not fixed!!!", "rating": "1", "version": "102.0", "date": "2017-01-28T19:36:00-07:00", "title": "Latest update will not download from the AppStore!!!"}, {"content": "A great thing to add to the next update is to give the option to find messages by date", "rating": "2", "version": "102.0", "date": "2017-01-28T16:33:00-07:00", "title": "FIND MESSAGES BY DATE"}, {"content": "Crap", "rating": "1", "version": "102.0", "date": "2017-01-28T09:57:00-07:00", "title": "Crap"}, {"content": "Messenger is not seeing  messages and is getting confused between messages. Whilst typing to one friend it looks like typing to a different friend. Seems to have just happened since last update. Not good at all", "rating": "2", "version": "102.0", "date": "2017-01-28T09:37:00-07:00", "title": "Not good"}, {"content": "Good app, maybe make it possible to edit the icons at the bottom, e.g. it's annoying to choose the extra icon for gifs", "rating": "5", "version": "102.0", "date": "2017-01-28T04:42:00-07:00", "title": "Edit"}, {"content": "Why is Facebook making it so confusing leave it to how it use to be. I use to check my mails through the website now this bull crap I hate the app but I have no choice but to use the thing", "rating": "1", "version": "102.0", "date": "2017-01-28T01:51:00-07:00", "title": "Poor"}, {"content": "I've had messenger for years... why do I keep getting invitations off people like I don't have it??", "rating": "3", "version": "102.0", "date": "2017-01-27T15:49:00-07:00", "title": "I've had messenger for years"}, {"content": "App wont send pictures in a group chat also no help to try and fix problem", "rating": "1", "version": "102.0", "date": "2017-01-27T13:18:00-07:00", "title": "Msg wont send in group chat"}, {"content": "My message keep going blank, i have to send a message for the messages to reappear", "rating": "1", "version": "102.0", "date": "2017-01-27T12:52:00-07:00", "title": "Crap"}, {"content": "Before update i loved the app. Right now it is worst then ever", "rating": "1", "version": "102.0", "date": "2017-01-27T06:53:00-07:00", "title": "Why"}, {"content": "Useful for me to keep in touch with friends.", "rating": "5", "version": "102.0", "date": "2017-01-27T04:39:00-07:00", "title": "Works well for me."}, {"content": "It works well but only if you're looking to see if you've had any messages it seems to no longer tell you on the app if there are messages or how many there are the only way to tell is by going into you're app now so this current version isn't doing it for me sorry *** only", "rating": "3", "version": "102.0", "date": "2017-01-27T04:08:00-07:00", "title": "Unsure"}, {"content": "have found messenger to be very useful emojis are ok but could do with being bit more grown up ones available aswell,perfect for youngsters,useing the phone service, its ok signal strength varies depending on where your at,over all happy too use messenger 😁🙃...", "rating": "4", "version": "102.0", "date": "2017-01-27T03:47:00-07:00", "title": "rate / leave review"}, {"content": "Which muppets added the selfie button in the middle at the bottom? This is over prominent and liable to be pressed inadvertently. Get rid of it please including the silly chicken head icon.", "rating": "1", "version": "102.0", "date": "2017-01-27T03:45:00-07:00", "title": "Why the selfie button"}, {"content": "Messenger has been a god send for me, now I can chat with my friends, talk to my colleagues and generally chat. One thing I moan at is sometimes my messages are often archived instead of being deleted but apart from that- can't complain", "rating": "5", "version": "102.0", "date": "2017-01-27T03:45:00-07:00", "title": "Brilliant to Use!!"}, {"content": "I love using this messenger as it is fast easy and free, I can connect to any Facebook friend with out having them in my phone contacts.", "rating": "5", "version": "102.0", "date": "2017-01-27T03:43:00-07:00", "title": "Great messenger review"}, {"content": "Love the new features on this new version of the messenger. 😍😊", "rating": "5", "version": "102.0", "date": "2017-01-27T03:25:00-07:00", "title": "Priceless"}, {"content": "Great app, just have trouble with the video call occasionally.", "rating": "5", "version": "102.0", "date": "2017-01-27T03:00:00-07:00", "title": "Great app"}, {"content": "Crap! Was nothing wrong with how it used to be before you forced us to use this app", "rating": "1", "version": "102.0", "date": "2017-01-27T03:00:00-07:00", "title": "Hate being forced to use this"}, {"content": "Love it!", "rating": "5", "version": "102.0", "date": "2017-01-27T02:03:00-07:00", "title": "Love it ! Always have alway will! Never any problems"}, {"content": "I have an iPhone se and messenger doesn't work unless it is on wifi, I have done all the updates and still don't work, it is an absolute drain 😩😩😡😡", "rating": "1", "version": "102.0", "date": "2017-01-27T02:01:00-07:00", "title": "Does anyone have this problem"}, {"content": "This app is amazing but it's the notifications they need to appear on the screen for longer so i can actually know I have a message", "rating": "5", "version": "102.0", "date": "2017-01-27T01:57:00-07:00", "title": "Good, but could be Improved"}, {"content": "Its sound as a pound gang gang", "rating": "5", "version": "102.0", "date": "2017-01-27T01:52:00-07:00", "title": "Its gucci"}, {"content": "After 3 years with the same 'I can't have google maps open at the same time as writing a message unless you want it to crash the phone' fault and despite endless updates that insist it splits your messages into pointless and irritating groups that you have to get rid off every few days despite never wanting them in the first place I've come to the conclusion the the 'developers' are a group of 8 yearolds with little or no concept of what the app needed to do in the first place.\n\nIt should've stayed part of the Facebook app where it was simple and worked perfectly no matter what I was doing.\n\nIf it isn't broken don't fix it.", "rating": "1", "version": "102.0", "date": "2017-01-27T01:25:00-07:00", "title": "Worst app of all time?"}, {"content": "Great app to talk to your friends on. The only problem with it is this new update, it reminds me too much of Snapchat. Other than that it's great fun.", "rating": "4", "version": "102.0", "date": "2017-01-27T00:58:00-07:00", "title": "Fun app!"}, {"content": "Brilliant app!!", "rating": "5", "version": "102.0", "date": "2017-01-27T00:47:00-07:00", "title": "Messenger"}, {"content": "Does what it says 😃", "rating": "4", "version": "102.0", "date": "2017-01-27T00:32:00-07:00", "title": "Good."}, {"content": "Good but can freeze a lot when needing an update which is annoying", "rating": "4", "version": "102.0", "date": "2017-01-27T00:16:00-07:00", "title": "Messenger"}, {"content": "Love it", "rating": "5", "version": "102.0", "date": "2017-01-27T00:09:00-07:00", "title": "Mr"}, {"content": "I'd recommend it to everyone.", "rating": "5", "version": "102.0", "date": "2017-01-26T23:34:00-07:00", "title": "Best App Ever"}, {"content": "I love messenger due to the speed of being able to talk to your friends etc. The feature I love best is to be able to see whose on line at that moment ! \nLove it , top marks !!", "rating": "5", "version": "102.0", "date": "2017-01-26T23:22:00-07:00", "title": "Love it !!"}, {"content": "Very helpful App that allows us to get in touch with families and friends here and around the world..", "rating": "5", "version": "102.0", "date": "2017-01-26T22:54:00-07:00", "title": "Excellent App"}, {"content": "Please could you make it easier to spot message requests?! Some could be sitting in my inbox for months without noticing!", "rating": "2", "version": "102.0", "date": "2017-01-26T22:53:00-07:00", "title": "Message Requests!"}, {"content": "This is yet another brilliant idea that has been messed about with too much, over time, probably by somebody bored in the HQ, and made it rather ugly. It still works quite as well but the emoticons can come out like they've been trodden on and squashed, the whole look of it is like something a child of three has drawn, and it's been brought to my attention that because there is so much stuff on it - spellchecker works at its worst on anything to do with Facebook and whereas message used to be fun, now it's slow, and frustrating correcting all the voice mic messages (this on Apple iPhone 5, the buttons are too close together to be able to write anything fast at all, hence the mic use).", "rating": "2", "version": "102.0", "date": "2017-01-26T22:39:00-07:00", "title": "Great idea fell to Ground."}, {"content": "I probably only use 1% of the app, as I only want to send messages, but it is just so big, my phone's tiny memory keeps filling. Really annoying as I have to keep deleting to free-up memory and re-installing to receive messages. Trying to move all over to whatsapp as it's just too annoying. Also really hate that you get automatically added to spammy message groups and have hundreds of messages from friends of friends who you don't know. \nAll in all, I'd say I detest this app and it was easier when it didn't exist.", "rating": "1", "version": "102.0", "date": "2017-01-26T12:21:00-07:00", "title": "Why is it so big?!"}, {"content": "It's terrible my friends either can't hear or see me it lags so much and he call screen is terrible u shud at least if there are six people on call have 3 on top of screen and 3 on bottom", "rating": "2", "version": "102.0", "date": "2017-01-26T11:12:00-07:00", "title": "I only have it for my friends"}, {"content": "Can you please select a default highlighting colour other than black , it does not work well with black text or most images . I use this feature a lot , which is not present in other messaging applications and I've found myself having to change colour every time when it wasn't the case before . Thanks", "rating": "4", "version": "102.0", "date": "2017-01-26T10:43:00-07:00", "title": "Good but"}, {"content": "Following the last unnecessary, useless and irritating update, messenger has decided that rather than fix it (as over 50% of reviews explicitly requested), that they are simply going to make it a little worse by taking this \"change for the sake of change\" mentality to the keyboard. In the unlikely event that anyone of significance reads this, please understand: these bad reviews are not going to go away, we will not simply \"adjust to the new style,\" we want the last two updates gone and future updates to actually do something useful rather than pointless changes that simply serve to annoy us rather than improve our experience as a user.", "rating": "1", "version": "102.0", "date": "2017-01-26T10:34:00-07:00", "title": "Rather than fix the last terrible update, they have instead decided to dig a little deeper."}, {"content": "Keeps saying I got 99+ messages on the app, has asked for my numbers too many times, can't access it from Facebook, only shows me 3 conversations, then active now, then more conversation, I click hide, go back on it and there back again, plus there that stupid camera which should be a refresh when slide down, plus using too much data", "rating": "1", "version": "102.0", "date": "2017-01-26T09:58:00-07:00", "title": "Too many problems"}, {"content": "Unnecessary app taking up more space on my phone that I don't really have, added to that fact the fb app says it is 170something Mb, yet takes up almost 1GB on my phone, always has a notification badge when in fb app as I won't switch notifications on for app, so now it constantly looks like I have a message in the app when I don't, Facebook, give your head a wobble and give your users what they want!!", "rating": "1", "version": "102.0", "date": "2017-01-26T06:13:00-07:00", "title": "Really facebook, really??"}, {"content": "A lot of improvement to be made", "rating": "2", "version": "102.0", "date": "2017-01-26T04:56:00-07:00", "title": "Hmmmm"}, {"content": "The Favourites, Currently Active, Birthdays and Suggested Conversations lists are taking over my entire inbox screen and there doesn't appear to be any way to permanently remove them, which is pointless and just wastes screen space.\nAlso, even with notifications switched on the app still pesters me to turn them on.\nAnother thing that now hasn't worked for months is the small black bar that appears within busy message threads telling you how many messages you have missed and has an arrow to press to take you to the last message you read and start from there. It never works, it just turns into a swirling animation and then disappears. Useless.\nIt is not possible to sign out of this app which means that it has to be deleted to effectively sign out. Also I'd like to know what updates they are making to the app, not just a vague 'we makes updates' message.\nWith every new update the app gets bigger and slower. This app combined with the main Facebook app are now taking up a total of 1.3GB on my phone.", "rating": "2", "version": "102.0", "date": "2017-01-26T01:27:00-07:00", "title": "Impossible to sign out and now slower"}, {"content": "As for iOS I'd like it to be more customisable for the look for everyones needs! I like camera button in the main section of the message and I don't use games at all so pointless for it to be there. I liked when you could send pictures just wow 2 clicks when they appeared at the bottom. AND WHY DID You TAKE EMOJIS OUT FROM THE EMOJI/STICKERS SECTION?! 😡", "rating": "1", "version": "102.0", "date": "2017-01-25T23:03:00-07:00", "title": "Configuration of the look !"}, {"content": "The latest update to include 'my day' is terrible. No way to turn it off either. Still using messenger under protest because my friends do.", "rating": "1", "version": "102.0", "date": "2017-01-25T18:00:00-07:00", "title": "Terrible update"}, {"content": "So there is this thing where I get a message and go to look at it and it's not there... I have to send a message to see the previous conversation this needs a fix fast", "rating": "2", "version": "102.0", "date": "2017-01-25T17:12:00-07:00", "title": "New update"}, {"content": "This app was created unnecessary. This is just stupid as c r a p!", "rating": "1", "version": "102.0", "date": "2017-01-25T08:54:00-07:00", "title": "Crap app"}, {"content": "Really useful, easy to connect with friends. Negates the more pointless aspects of fb", "rating": "4", "version": "102.0", "date": "2017-01-25T08:44:00-07:00", "title": "Messenger is useful"}, {"content": "Forced to download a seperate app, just so facebook can stalk and spy on me with location/mic/camera etc... no thanks!", "rating": "1", "version": "102.0", "date": "2017-01-25T05:35:00-07:00", "title": "Deleted"}, {"content": "Guys, you need to put a refresh option back in, a drag down or a button SOMETHING!", "rating": "3", "version": "102.0", "date": "2017-01-25T05:29:00-07:00", "title": "Still an ok app but"}, {"content": "Since Facebook has decided to separate messaging function from the main app by creating this messenger, I would expect it to be \"clean\" and swift. Unfortunately, update by update, this app is getting bloated with unnecessary features where it gets to the point when it no longer justifies the separation in the first place. It is a data collecting app.", "rating": "1", "version": "102.0", "date": "2017-01-25T05:22:00-07:00", "title": "Overpolluted"}, {"content": "Great app can't do without it.", "rating": "5", "version": "102.0", "date": "2017-01-25T04:13:00-07:00", "title": "Mr E"}, {"content": "Get over your self, I use you less because you insist on put a red dot telling me to put on alerts, as a result I don't use you, because I'm tired of checking for a message and finding it's your bloody controlling selves, could you stop this or I'll delete, I have multiple apps bringing multiple messages I don't need a phantom, I need accurate and consistent.", "rating": "1", "version": "102.0", "date": "2017-01-25T01:21:00-07:00", "title": "WTF"}, {"content": "Handy", "rating": "4", "version": "102.0", "date": "2017-01-25T00:55:00-07:00", "title": "Nice"}, {"content": "This was a stable useful app until the update. Crashes every time you try to use the camera through the app on IPad . This is still happening after the latest update 24/1/17. Surely this can be fixed.", "rating": "1", "version": "102.0", "date": "2017-01-25T00:13:00-07:00", "title": "Crashes since update 20/12"}, {"content": "This new messenger app is really good with all the new features.", "rating": "5", "version": "102.0", "date": "2017-01-24T23:50:00-07:00", "title": "Great app"}, {"content": "Easy to use, works great", "rating": "5", "version": "102.0", "date": "2017-01-24T23:01:00-07:00", "title": "Works good"}, {"content": "I'm against being forced to add yet another app to my phone ! Plus I don't like the new set up why does it show people I never message in favourites .", "rating": "1", "version": "102.0", "date": "2017-01-24T22:55:00-07:00", "title": "Not a fan"}, {"content": "I love messaging, the icons are cute. I can go back and view old chats. Screenshot them its quick and fun.", "rating": "5", "version": "102.0", "date": "2017-01-24T22:46:00-07:00", "title": "Super"}, {"content": "As it is the most popular messaging app everyone you meet has it. From Europe to the Americas", "rating": "5", "version": "102.0", "date": "2017-01-24T22:22:00-07:00", "title": "Great for travelling"}, {"content": "Rubbish Unnecessary App which steals your data!\n\nWhy not use your browser!", "rating": "1", "version": "102.0", "date": "2017-01-24T22:21:00-07:00", "title": "Rubbish Unnecessary App which steals your data"}, {"content": "Love.", "rating": "5", "version": "102.0", "date": "2017-01-24T19:02:00-07:00", "title": "Love love love"}, {"content": "I don't really like the new update much. The camera button is too big and too easy to press by accident, it becomes annoying after a while. Also I can't count how many times I've invited my friends to the messenger without realising it 😆 Other than that it's ok.", "rating": "3", "version": "102.0", "date": "2017-01-24T15:16:00-07:00", "title": "It's OK"}, {"content": "I use this app everyday. Having friends from all over the world, I can stay in touch with them all. It doesn't cost me anything and if I'm in a wifi zone or at home I can take video calls, these usually work very well. Signal is usually good but can get troublesome if I'm on the bus. The group chat ability is lovely as I can talk to several people at once. Sharing videos, photos ect is another great point. Overall I really like messenger and would be a bit lost without it.", "rating": "4", "version": "102.0", "date": "2017-01-24T14:43:00-07:00", "title": "Does what it says on the tin"}, {"content": "Cannot figure out why 'deleted' Facebook friends are still appearing active on my chat list?", "rating": "1", "version": "102.0", "date": "2017-01-24T14:07:00-07:00", "title": "Total Useless!!"}, {"content": "Well so far the new update won't load any of my chat history or the messages this is just awful!", "rating": "1", "version": "102.0", "date": "2017-01-24T13:10:00-07:00", "title": "New update 😡😡😡"}, {"content": "Everytime I go onto messenger in landscape mode, the chats come up blank or if I try to scroll up to see older messages the chat also goes blank. I have to completely shut down the app to restore the chats. It is becoming more frequent - otherwise the app works fine, it would be great if you could look into this issue", "rating": "2", "version": "102.0", "date": "2017-01-24T10:51:00-07:00", "title": "iPad compatibility"}, {"content": "At first it was a really good app but recently it's begun tripping and logging me out. It also shuts down my whole phone- I've spoken to friends and it's\nNot just my version of the app, it's happening to many people.", "rating": "1", "version": "101.0", "date": "2017-01-24T10:11:00-07:00", "title": "Well"}, {"content": "Needs fix", "rating": "1", "version": "101.0", "date": "2017-01-24T08:43:00-07:00", "title": "Broke as"}, {"content": "They now pester you with a notification to turn on notifications that you turned off to avoid notifications in the first place. The irony is layered. And it's been like this for more than a year.", "rating": "1", "version": "101.0", "date": "2017-01-24T01:23:00-07:00", "title": "Notifications nightmare"}, {"content": "Haven't used this yet as only this minute installed the update, I have a friend in USA & I do love that we can have long chats between uk & USA for Free, But like Bills Girl I do not like the way F. B. Snoops on Everything we do And uses this information & no doubt sells it. F/B and messenger could have been such good places but I do Not Feel comfortable on these apps to the point I do wonder just how intrenched is there snooping ?", "rating": "4", "version": "101.0", "date": "2017-01-23T16:03:00-07:00", "title": "Don't know yet But !"}, {"content": "This app is the main reason I use WhatsApp now. It's torturously slow :-( if someone messages me on here i can seldom bring myself to check it", "rating": "1", "version": "101.0", "date": "2017-01-23T13:57:00-07:00", "title": "Slow and clunky"}, {"content": "This latest update has several issues in that it apparently is no longer showing people I'm online when in fact I am. It's telling me I have messages when I then see I don't. The refresh option has been replaced when you pull down with taking you into camera mode which is the same as the huge button in the middle of the options on the bottom....WHY? There are probably many more. If you are trying to copy Snapchat as some have suggested then as I hate Snapchat and don't use it I will end up stopping using your tool too.", "rating": "2", "version": "101.0", "date": "2017-01-23T09:34:00-07:00", "title": "Mr"}, {"content": "Cannot see who is online since the past couple of updates, seen so many bad reviews about this sort of thing i actualy think its pointless writing this but i hope dear god tell the app users at facebook to sort your shiz out i have to log in facebook to see who is online and then open the app to speak with them seems abit pointless really so please fuckbook listen to us users and dont try fix something that is not broken should be ashamed of yourselfs as developers youve gone backwards!!!", "rating": "1", "version": "101.0", "date": "2017-01-23T07:34:00-07:00", "title": "Wow! I mean Ouch 🙄"}, {"content": "Facebook messenger can be a handy app however the problem is; the 'people' list has the names and details of people who I have deleted years ago, I cannot see a way to remove them. They are not my friends on Facebook but for some reason show up on the list. It really clogs up the list of contacts and makes it annoying to use. This would be a great app if it would just show me my actua contacts. Facebook you need to fix this!", "rating": "3", "version": "101.0", "date": "2017-01-23T06:41:00-07:00", "title": "CANNOT REMOVE CONTACTS"}, {"content": "I dont appreciate hidden updates. Why can't you provide information of whats being changed? Especially when the updates seem to break the app.", "rating": "1", "version": "101.0", "date": "2017-01-23T05:22:00-07:00", "title": "Update info"}, {"content": "Easy to use, perfect!", "rating": "5", "version": "101.0", "date": "2017-01-22T16:53:00-07:00", "title": "Simple"}, {"content": "BRING CHAT HEADS BACK!!! This would make everything a million times easier, Apple please look into this:)", "rating": "4", "version": "101.0", "date": "2017-01-22T15:20:00-07:00", "title": "CHAT HEADS"}, {"content": "Terrible new bug which makes the app crash as soon as I try to send a picture.", "rating": "2", "version": "101.0", "date": "2017-01-22T13:21:00-07:00", "title": "New bug."}, {"content": "Please change the feature whereby if you drag to get back to the top too quickly it opens the new camera mode...", "rating": "2", "version": "101.0", "date": "2017-01-22T13:02:00-07:00", "title": "Camera opening is dragging me down"}, {"content": "No one cares about my review.", "rating": "1", "version": "101.0", "date": "2017-01-22T12:27:00-07:00", "title": "Rubbish"}, {"content": "The new update is the worst !!! Having issues using the app properly for a couple of days! The app won't open .. If it does open, not working properly..  Whenever I opened it , the buffering sign keeps showing but not the msgs.. Tried closing and opening it again and again.. I uninstalled it and reinstalled it but it wasn't showing 'installing' it was showing 'updating' though it was uninstalled ! :| \n-msgs won't show \n-gets stuck all the time \n-installing issue \n*facing these for only 2 days now ! \nOld updates were way better !", "rating": "1", "version": "101.0", "date": "2017-01-22T11:56:00-07:00", "title": "The worst now !"}, {"content": "Since the new update my messenger won't open at all. Don't fix what isn't broken!", "rating": "2", "version": "101.0", "date": "2017-01-22T03:53:00-07:00", "title": "Won't open"}, {"content": "Was a really poor app, now it's useless, well done on the update. I don't know what's the deal with Facebook and Messenger but it's got to be sweet, because this app is utter crap.", "rating": "1", "version": "101.0", "date": "2017-01-22T02:22:00-07:00", "title": "Mrr"}, {"content": "Great for communicating with family from the other side of the world. ♥️🇬🇧🇦🇺", "rating": "5", "version": "101.0", "date": "2017-01-22T00:32:00-07:00", "title": "Awesome"}, {"content": "After the last update my messenger keeps messing up. For example - Sometimes when I'm in a messenger call the bar at the top of my screen disappears as if I aren't in a call. (Tap to return to call bar) this has been happening quite alot recently after I had done the update. Please sort it out as it is rather annoying.", "rating": "2", "version": "101.0", "date": "2017-01-21T23:26:00-07:00", "title": "Getting worse."}, {"content": "Everything about it is okay for me. No major complaints", "rating": "5", "version": "101.0", "date": "2017-01-21T13:34:00-07:00", "title": "I love it"}, {"content": "Ever since the update my messages seem to freeze where parts of the conversation is missing. Not only that but if I was to message another person that frozen message appears on everyone. Not happy and not happy I can't logout unless I sign into my old Facebook account", "rating": "1", "version": "101.0", "date": "2017-01-21T13:03:00-07:00", "title": "Update gone wrong"}, {"content": "iPhone 7 plus doesn't work after last update", "rating": "1", "version": "101.0", "date": "2017-01-21T08:46:00-07:00", "title": "Fails"}, {"content": "I liked the old messenger and I liked being able to pull down to refresh my messages. \n\nIt's harder to do that now, and a lot of the time the app doesn't even tell me I have messages. I've missed important messages because it doesn't tell me!!", "rating": "2", "version": "101.0", "date": "2017-01-21T02:07:00-07:00", "title": "If it's not broke don't fix it"}, {"content": "App works great, just takes every piece of data from your phone and stores it which is disgusting. Facebook has all your stored info and uses it to make money to send you adverts. 🖕Facebook.", "rating": "1", "version": "101.0", "date": "2017-01-21T01:24:00-07:00", "title": "Snooping"}, {"content": "No need for quick access to camera. App feels clumsy now.", "rating": "1", "version": "101.0", "date": "2017-01-21T00:29:00-07:00", "title": "Irrelevant annoying camera access feature"}, {"content": "As annoying as having to get the messenger app was, you could at least use the bloody thing simply. Now though, it's a bloated and stuffed mess, containing pointless camera buttons, \"rooms\" for reasons I can't explain, and a layout so complicated you can't even find who you last sent a message to. Cheers Facebook!", "rating": "1", "version": "101.0", "date": "2017-01-20T18:14:00-07:00", "title": "Once functional, now bloated and stuffed"}, {"content": "I thought I was reviewing my life, sorry.", "rating": "1", "version": "101.0", "date": "2017-01-20T18:00:00-07:00", "title": "Very disappointing, sad and pathetic."}, {"content": "The current version of this app is bad in my opinion. The home page is like the app Snapchat. Also in the home page, you have these different categories which show you your recents, active now, groups, etc... I prefer the older versions of this app because it was much more simpler to use back then and now it has started to get a little bit complicated", "rating": "1", "version": "101.0", "date": "2017-01-20T15:55:00-07:00", "title": "Getting Worse"}, {"content": "I don't know if this is a general flaw, or I'm just blind / haven't looked deep enough in this ridiculously needless app, but ever since the newest update which majorly changed the interface, the \"Secret\" button to start a 'Secret Conversation' had disappeared. Clicking the '+' to get to the new conversation bit works the same, but in the top right corner the \"Secret\" button is no longer there, instead just the cancel button... \n\nEnlighten me as to where this button has migrated to, thanks.", "rating": "3", "version": "101.0", "date": "2017-01-20T15:29:00-07:00", "title": "Forgetting something?"}]}