{"data": [{"content": "Taken away the favourites button! WHY? ... why why why? ... bring it back! I hate the new version. 😡", "rating": "1", "version": "2.17.7", "date": "2017-03-06T13:28:00-07:00", "title": "DO NOT update !"}, {"content": "Severely disappointed following the last couple of updates.", "rating": "2", "version": "2.17.7", "date": "2017-03-06T13:03:00-07:00", "title": "Disappointed"}, {"content": "Great app but getting rid if favourite was a bad idea.", "rating": "2", "version": "2.17.7", "date": "2017-03-06T12:57:00-07:00", "title": "Bring back favourites!"}, {"content": "Hate this update! I don't want photos for my status, I want simple text. Stop trying to be like snapchat and Instagram!\nAlso hate the fact the contacts icon has gone. Sort it out whatsapp!!! Why fix something that isn't broken?", "rating": "1", "version": "2.17.7", "date": "2017-03-06T12:48:00-07:00", "title": "New update"}, {"content": "Please just undo this update, go back to the way it was😭😭😭", "rating": "1", "version": "2.17.7", "date": "2017-03-06T12:10:00-07:00", "title": "WHY THIS UPDATE?"}, {"content": "Are you trying to be Snapchat? Because if I wanted Snapchat, I'd download Snapchat. I want a messenger that allows me to find my list of contacts without having to use google to find out how. Such a shame, as it was my most used app until last week. Back to iMessage for me...", "rating": "1", "version": "2.17.7", "date": "2017-03-06T11:48:00-07:00", "title": "Awful app, thanks to the latest update"}, {"content": "Estava melhor antes agora tenho que fazer muitas  funções para chegar até aos contactos e a coisa do estados e ridícula porque tá igual ao Snapchat", "rating": "3", "version": "2.17.7", "date": "2017-03-06T11:47:00-07:00", "title": "A outra versão e melhor"}, {"content": "Would have give 5 stars. Saves a lot of money good way to keep in contact, please bring in the option to make phone calls within the app. Taking too long for phone calls to come in.😴\n\nPlease please bring in free phone calls. Would  give  5 stars without a doubt .☎️📞 When are free phone calls coming  in for the i phone ?? When??😴😴😴 Updated app today, can receive whatsapp calls  but can't make them. Hopefully will be fixed soon. Also if the I phone isn't in use but switched on it the call doesn't come through. Now works,great thanks😀😀 Very happy 👍🏻👍🏻👍🏻\nVery quiet audio recordings even on full volume. Needs fixing thanks. Notifications of messages don't always come through.  Please fix thanks.\n\nUpdate needs password protection for privacy. Video calls would be great.\n Now even better its free!!😀😀\n\nGreat now messages are encrypted. Video calls would now complete the service.  Hope it doesn't take too long.  Can't fault the app/service 👍🏻\n\nVideo calls please please\n\nVoice mail doesn't work just rings out\n\nJust updated whatsapp now shows video icon. Doesn't work on I phone.  Please fix asap. Go back to original layout, much better\n\nVideo calls please ASAP\nVideo calls don't work cuts off. Updated video calling still doesn't work!!\n\nQuality of calls not good cuts out. \n\n24-2-2017 Don't like the new update. Was great as it was 🙁🙁. Didn't want a version of snap chat 🙁.", "rating": "3", "version": "2.17.7", "date": "2017-03-06T11:25:00-07:00", "title": "Great App"}, {"content": "Would be good if you could do in chat event reminders", "rating": "4", "version": "2.17.7", "date": "2017-03-06T11:15:00-07:00", "title": "Events"}, {"content": "This is just terrible, so I had to delete WhatsApp to focus on my work and I try to re-install it. And so I try click send me a verification code! It doesn't work, so I try use my old one. And it continues to lock me out for 24hr no matter if I choose call or text. Please fix this🙄", "rating": "1", "version": "2.17.7", "date": "2017-03-06T10:38:00-07:00", "title": "I can't re-install it"}, {"content": "The new update is toooooooo bad. #we want old whatsapp", "rating": "1", "version": "2.17.7", "date": "2017-03-06T10:12:00-07:00", "title": "Terrible"}, {"content": "I deleted the application because it became so dumb", "rating": "1", "version": "2.17.7", "date": "2017-03-06T09:57:00-07:00", "title": "Don't like it"}, {"content": "Disappointed the new version is terrible horrible horrible horrible😒😒😠😠", "rating": "1", "version": "2.17.7", "date": "2017-03-06T09:37:00-07:00", "title": "Terrible"}, {"content": "The update is pathetic why are you & Facebook trying to copy Snapchat it's so dumb & the layout of WhatsApp now is terrible just like messenger. Congratulations.", "rating": "1", "version": "2.17.7", "date": "2017-03-06T09:34:00-07:00", "title": "Hate it!"}, {"content": "I am so unhappy that whatsapp has decided to ditch the favourites tab and replace it with this status stuff! Absolute tragedy", "rating": "1", "version": "2.17.7", "date": "2017-03-06T09:25:00-07:00", "title": "TERRIBLE UPDATE"}, {"content": "I'm really sorry but I hate this new update- I hate snapchat & I just want my old settings back. I now have no reason to use watsapp because I no longer feel is serves me any purpose. I wish I hadnt left on automatic app update because I would never ever have updated it & now I can't revert back. I've always loved watsapp  but not anymore. Sorry xx", "rating": "2", "version": "2.17.7", "date": "2017-03-06T07:05:00-07:00", "title": "Review"}, {"content": "Hate the new Feb 17\nPlease go back to how it was it was brilliant the way it was", "rating": "1", "version": "2.17.7", "date": "2017-03-06T05:52:00-07:00", "title": "Hate new new update"}, {"content": "Keeps trying to install update and failing. Can't open app without update. Useless.", "rating": "1", "version": "2.17.7", "date": "2017-03-06T05:48:00-07:00", "title": "Rubbish - Update won't even install"}, {"content": "Used to love WhatsApp, but the recent update is awful. If you're not in WhatsApp ALL the time, you easily miss status from friends - and 24 hours for a status is very poor. Also running through contacts and writing one to someone you haven't contacted for ages is really hard. This is a classic example of \"if it ain't broke, don't fix it\"", "rating": "3", "version": "2.17.7", "date": "2017-03-06T05:05:00-07:00", "title": "The update is poor"}, {"content": "Can't give zero stars, but would love to! This is my main app to contact friends but can now not find them as favourites has disappeared. Not sure what 'status' is for .... we don't need it, or want it!!! Revert back to what it was! You have made an otherwise good app user unfriendly in one 'update'!!", "rating": "1", "version": "2.17.7", "date": "2017-03-06T04:53:00-07:00", "title": "Worse update ever! If it ain't broke, don't fix it!!"}, {"content": "I crashed into people", "rating": "1", "version": "2.17.7", "date": "2017-03-06T04:33:00-07:00", "title": "Help"}, {"content": "Best update but facing problems another person cant see my pics and i cnt see the pics of my friends profile pic", "rating": "5", "version": "2.17.7", "date": "2017-03-06T04:00:00-07:00", "title": "Whtsapp"}, {"content": "\"If it ain't broke don't fix it\" is a saying for a reason. WHY are you trying to be like snap chat, the application was perfectly fine the way it Was!! Seeing people's status' that they choose to put up was FINE. Only 3 people in my whole phone book have jumped on the band wagon of the rip off snap chat you have 'invented' or duped. Please change it back.", "rating": "1", "version": "2.17.7", "date": "2017-03-06T03:56:00-07:00", "title": "IF IT AIN'T BROKE DONT FIX IT"}, {"content": "I absolutely hate this new update. Why aren't we given the option to revert back to the old version!! This once brilliant app has been completely ruined!", "rating": "1", "version": "2.17.7", "date": "2017-03-06T03:38:00-07:00", "title": "You've ruined this app! Used to be great"}, {"content": "Whatsapp should stick to what they are good at......i dont understand the need to join the snapchat model. Now i cant easily view my contacts dp which is soo annoying and makes it harder to even start conversations. Please amend this", "rating": "1", "version": "2.17.7", "date": "2017-03-06T03:30:00-07:00", "title": "Why change something working perfectly fine???"}, {"content": "Absolutely hate this new update and so does everyone I know. I quite enjoyed just writing a status etc. Bring back the old version. Why try to change something that was brilliant anyway? Keep things simple. You are not snapchat!! I hate snapchat! 😩", "rating": "1", "version": "2.17.7", "date": "2017-03-06T02:17:00-07:00", "title": "Horrid!!"}, {"content": "Hate this new what's app, by the looks of the review ppl are rating it one star , that's not good . Bring back the old version , still what's the point of us all complaining , you don't take any notice of us.", "rating": "1", "version": "2.17.7", "date": "2017-03-06T01:31:00-07:00", "title": "Not A Happy Person"}, {"content": "Why change something when it was perfectly ok? Where has my favourites gone ?? & the stupid status updates are ridiculous. Bring back the previous please.", "rating": "1", "version": "2.17.7", "date": "2017-03-06T01:11:00-07:00", "title": "Update"}, {"content": "Yep, does the job. Would be nice to be able to upload my own personal text tone though.", "rating": "3", "version": "2.17.7", "date": "2017-03-06T01:02:00-07:00", "title": "Personal ringtone"}, {"content": "I hate it. I don't do social networking. If I wanted Snapchat I would have it but I don't and that is what this stilly update is like. If you are going to change an update to that extreme at least give us the opportunity to decide weather or not we want it!!!!!!!!!!!. I'm only giving this 1 star because i can not give none.", "rating": "1", "version": "2.17.7", "date": "2017-03-06T00:23:00-07:00", "title": "Hate it, hate it, hate it!!!!!!"}, {"content": "This new update is awful!!! Hate it!!! There was absolutely nothing wrong with it before!!! Please change it back!!! You can't even see your contacts anymore. Anyone with the old version stick to it!!", "rating": "1", "version": "2.17.7", "date": "2017-03-06T00:01:00-07:00", "title": "PLEASE CHANGE IT BACK!"}, {"content": "Would recommend as a free way to communicate", "rating": "5", "version": "2.17.7", "date": "2017-03-05T23:38:00-07:00", "title": "Great App"}, {"content": "WhatsApp was perfect the way it was; the recent update where you put status' but can't see your friends or favorites is the worst. Now it doesn't tell you who joined WhatsApp, or who is on your list. Please take this feature off and put the back one on! \nI preferred this over a lot of messaging services now it has become one of the more \"bad\" ones.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T23:27:00-07:00", "title": "Awful update to a great app"}, {"content": "The new update has completely ruined whatsapp and now I don't use it!!!!!!! Status updates are rubbish. Can't put a normal status anymore or see anyone else's. The simplicity of whatsapp and the fact that you could put statuses for all to see etc.. is what made whatsapp different and great. It should not have been changed in this way!!! Change it back for god sake! What were you thinking 🤔🤔🤔🤔🤔🤔", "rating": "1", "version": "2.17.7", "date": "2017-03-05T18:33:00-07:00", "title": "New update has ruined whatsapp"}, {"content": "I just updated and I can't see anyone's status, I can't update my own without doing a snapchat style picture!!! So angry I will delete the app if there is no update to resolve. Worst decision/idea/update ever!!!! Fix asap please!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T18:16:00-07:00", "title": "Terrible"}, {"content": "hasan\nbest app", "rating": "5", "version": "2.17.7", "date": "2017-03-05T17:38:00-07:00", "title": "mr"}, {"content": "Hate the new version can you please bring back the old features like (Status)please.  This was one of the best apps before you changed it... it's now horrible, if I want Snapchat I can download myself,  yet another app destroyed by Facebook...went from 10 out of to 0.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T17:06:00-07:00", "title": "What's up thanks for destroying the app."}, {"content": "I think this update is ridiculously awful. Can't be any worse", "rating": "1", "version": "2.17.7", "date": "2017-03-05T16:00:00-07:00", "title": "Awful"}, {"content": "Really not liking the update - can we not get facility to leave Groups with out Showsec by we are leaving .\n\nReally disappointing - loads of people stopping using it now .", "rating": "1", "version": "2.17.7", "date": "2017-03-05T14:19:00-07:00", "title": "Keep it simple !"}, {"content": "Should've put a report button on your new story update. You don't know how harsh and harmful that could be, especially of someone else going to there family and there family.🤦🏽‍♂️you get my point", "rating": "4", "version": "2.17.7", "date": "2017-03-05T13:57:00-07:00", "title": "Where is the report button?"}, {"content": "I hate this app now can't delete it coz I've got important chat on it otherwise I would have deleted this from the day it updated please it's a kind request please change it back to normal", "rating": "1", "version": "2.17.7", "date": "2017-03-05T13:19:00-07:00", "title": "Please change it back to normal"}, {"content": "This is not Snapchat!\nI really loved whatsapp and now all of a sudden I have to go to messages just so I can look at people's profile pictures. It's not cool and it's just complicated now.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T12:55:00-07:00", "title": "I hate the new update!!"}, {"content": "Since updating I've had numerous issues and every time I click on the whatsapp icon it's just a blank screen sort it out apps gone down hill", "rating": "1", "version": "2.17.7", "date": "2017-03-05T11:50:00-07:00", "title": "Joke"}, {"content": "We all hate this status style. Bring back our good old status style.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T11:20:00-07:00", "title": "What's this new status thing?"}, {"content": "AT LEAST BRING FAVOURITES BACK, AND OUR STATUSES PLEASE.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T10:53:00-07:00", "title": "BRING FAVOURITES BACK AND STATUS PLEASE."}, {"content": "What's happened? It's all of a sudden changed! Why do I want to post a video for 24 hours? What's going on? Where are my contacts? Bonkers!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T10:42:00-07:00", "title": "Opppss!"}, {"content": "Please listen to your customers. Everyone is stating this new update is horrible. Can you please revert it back? All you have done is create a copy of a simple messenger. Bring back statuses!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T10:37:00-07:00", "title": "Worst update EVER!"}, {"content": "Why take away Favourites?", "rating": "1", "version": "2.17.7", "date": "2017-03-05T10:00:00-07:00", "title": "Rubbish update"}, {"content": "As usual people want to force their ideas upon others. In WhatsApp case it will worsen their sales. The whole point of me using WhatsApp was to write a status , not to post pictures... if I want to share a picture with someone I would send it to them. Very bad update!! Please take it back!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T09:23:00-07:00", "title": "Terrible update"}, {"content": "Put it back like it used to be before this update. You have ruined it!!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T09:03:00-07:00", "title": "Terrible!!"}, {"content": "Mint app, would never have a phone without it! Recommend to anyone :)) amazing", "rating": "5", "version": "2.17.7", "date": "2017-03-05T08:03:00-07:00", "title": "Watts app"}, {"content": "Facebook, did you even bother to do any analysis to validate whether people wanted this status thing on WhatsApp. NOBODY in my entire 1000 contact list is even using it, it's stupid and annoying. Snapchat is Snapchat, whatsapp is whatsapp, just bring back the important tabs that make whatsapp what it is. Copying snapchat on Instagram was fine enough.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T07:46:00-07:00", "title": "Stupid update"}, {"content": "Where are my contacts? Why change the app when it is working fine before...", "rating": "1", "version": "2.17.7", "date": "2017-03-05T07:39:00-07:00", "title": "Bad update"}, {"content": "Hate this update. Favourites and Contacts tabs have gone - replaced by ones that I don't want. Why advertise the update as \"bug fixes\" when the app has been fundamentally changed for the worse? I feel cheated.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T07:39:00-07:00", "title": "NOT just \"Bug fixes\""}, {"content": "Perfect for everything \nVideo phone calls amazing. Instant!", "rating": "5", "version": "2.17.7", "date": "2017-03-05T07:21:00-07:00", "title": "Booody incredible"}, {"content": "I just want it the way it was before and I had the new status update I liked the old status where people wrote something down.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T07:10:00-07:00", "title": "I don't want snapchat, I want what's app"}, {"content": "I have had to reinstall this application 8 times in one week! It randomly freezes then closes.. then you click back in and it says 'optimising' and it doesn't recover anything and you have to reinstall it for it to work again. Which has made me LOOOOSE ALL MY MEDIA in all chats, it has made me loose chat history. It's a joke", "rating": "1", "version": "2.17.7", "date": "2017-03-05T07:03:00-07:00", "title": "The worst after update"}, {"content": "I already had snapchat and Instagram Stories. Really didn't need this stupid update by whatsapp. They should fix other problems, and bring features like apple watch support instead of these stupid changes.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T06:24:00-07:00", "title": "Why is everyone trying to be Snapchat ?"}, {"content": "Why have you turned this into Instagram? I just want to message my contacts easily", "rating": "1", "version": "2.17.7", "date": "2017-03-05T06:15:00-07:00", "title": "What's going on"}, {"content": "Considering too many bad reviews re the current update, pls revert back to old version", "rating": "1", "version": "2.17.7", "date": "2017-03-05T05:57:00-07:00", "title": "Too bad"}, {"content": "Not happy with update at all.Can no longer share a WRITTEN status with contacts.Can no longer see my contacts either.\nMaybe try giving people the option to write their status or video/photograph it.Not everybody likes snapchat!!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T05:56:00-07:00", "title": "Rubbish update"}, {"content": "this update is horrible. Can't view contacts normally without having to write a message, my favourites list is gone makes it more difficult to write a message as you have to scroll through to select the contact! Miss seeing peoples statuses I feel like this is trying to be Snapchat which most people use anyway doesn't make sense to have different apps that ALL DO THE SAME THING! Change it back please!! ☹️", "rating": "1", "version": "2.17.7", "date": "2017-03-05T05:46:00-07:00", "title": "No no no"}, {"content": "What kinda snap chat wannabe lerk mode did they turn this into!? How do I not even give them 1 star ?! Stupid whatsapp illuminati is taking over !", "rating": "1", "version": "2.17.7", "date": "2017-03-05T05:42:00-07:00", "title": "Hell\"naah"}, {"content": "Love whatsapp, hate the new update. Please remove the snapchat!!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T05:23:00-07:00", "title": "Terrible update !!!! We don't want Snapchat"}, {"content": "What are the developers of this app doing. U don't listen to the users at all. \nThe latest updates are basically making this app like Snapchat. Hello nobody wants this. We we want Snapchat we'd download it. \nI can understand u wanting to steal users away from Snapchat but it doesn't need to be done in a way of ruining the fundamental ways in which this app is useful. Simple favourite area gone which many used! \nI'm afraid this is the problem when someone like Facebook runs things. \n\nAdd useful features like maybe filter out videos/ pictures from chats as many people have requested. The app needs to remain simple but useful. This is why people have this app. We don't need one app that does all. \n\nPlease have a look into this. You'll loose people to other services if ur not careful.", "rating": "1", "version": "2.17.7", "date": "2017-03-05T04:37:00-07:00", "title": "No good at all"}, {"content": "It was perfectly fine before the update.this is NOT Snapchat.why u copy Snapchat huh?!.nothing was wrong with it until u updated it.u can't even see all our contacts except if u go on send message.u can't have a proper status now.and whenever I go on it it asks me for my details like phone number and it also ask for a code and its pointless.ALL COZ OF THIS NEW UPDATE!!!! i wouldn't even give this 1 star😒😒", "rating": "1", "version": "2.17.7", "date": "2017-03-05T01:52:00-07:00", "title": "HATE IT!!"}, {"content": "They have ruined this app with the new horrid status update? Just leave it the way it was, a status pic for 24 hours? It's not snapchat story. \n\nHave you seen the reviews? Some are getting deleted it's a joke, Bring it back the way it was and read the reviews on what WE are saying, I've seen a lot of 5 star reviews lol most likely from their employees !!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T01:48:00-07:00", "title": "Going backwards"}, {"content": "Useless piece of software. Only reason I keep it is because everyone I know are using it, If I could convince them all to use Viber, I swear I would do it", "rating": "1", "version": "2.17.7", "date": "2017-03-05T01:34:00-07:00", "title": "ZERO 💩"}, {"content": "If it wasn't broken, don't fix it!! Shocking update!!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T00:48:00-07:00", "title": "Worst update!!"}, {"content": "Stupid Update!", "rating": "1", "version": "2.17.7", "date": "2017-03-05T00:07:00-07:00", "title": "What a stupid version this is.It's the most worst update of ever.Give a new good update in 2 days."}, {"content": "The recent update is not very good. \n\nThere is no need for the new 'Status' section. Makes it very difficult to see who is using whatsapp and it is very difficult to select the contacts that you would like to speak to. \n\nPlease change it back. \n\nThank You", "rating": "1", "version": "2.17.7", "date": "2017-03-04T23:44:00-07:00", "title": "WORST UPDATE!"}, {"content": "The list of contacts has now been replaced by some idiotic feature to update status. I will stay with WhatsApp only until a similar app comes along and then I'm out. Any app that uses a \"bug fixes\" cloak to radically remove an essential feature of the service should be boycotted. It clearly shows the lack of thought and understanding of those responsible for customer satisfaction. Absolutely disgraceful.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T23:19:00-07:00", "title": "Terrible Update"}, {"content": "ATROCIOUS UPDATE. Bring back favourites and contacts. LISTEN AND READ ALL THE BAD REVIEWS!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T22:33:00-07:00", "title": "RUBBISH UPDATE"}, {"content": "So whatsapp has followed instagram which recently followed Snapchat. \nGreat work hiding a useful feature (contacts) and replacing it with yet anther feature trying to mimic Snapchat. Since the update I've seen a grand total of 0 friends use the new feature. Completely pointless.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T22:08:00-07:00", "title": "Disappointing updates"}, {"content": "The app keeps crashing and I have to keep putting my number in please sort this out ASAP AS ITS REALLY ANNOYING TO KEEYP SIGNING IN!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T21:37:00-07:00", "title": "You let me down"}, {"content": "This app has been destroyed by it's own creators with the new update it is atrocious, Whatsapp need to release a newer update which reverts everything back to how it used to be don't copy other apps be yourself which WHATSAPP NOT FACEBOOK NOT SNAPCHAT AND NOT INSTAGRAM.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T20:27:00-07:00", "title": "I HATE THE NEW UPDATE"}, {"content": "Please change it how it used the new update it's Crap rubbish and why change it like Snapchat and istagram because we don't need of the and The reason I like whatsapp because it's was simple🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼🙏🏼please", "rating": "1", "version": "2.17.7", "date": "2017-03-04T17:52:00-07:00", "title": "Update"}, {"content": "Absolutely hate it now", "rating": "2", "version": "2.17.7", "date": "2017-03-04T17:16:00-07:00", "title": "WhatsApp"}, {"content": "Why why why did u do this whatsapp, i bloody hate it now, why are u trying to copy snap chat, whatsapp was soo simple and now u made everything complicated, CHANGE IT BACK OR WER GOING TO DELETE WHATSAPP!!!! 😡 dont wana rate it but to write a comment i had to cus u deserve zero 😡", "rating": "1", "version": "2.17.7", "date": "2017-03-04T16:20:00-07:00", "title": "Hate whatsapp"}, {"content": "I use what's app for its simplicity and ease of use!! This is what made it great and the reason why many use it!!  Not because I want a fancy snapchat feature replacing my favourites and contacts!!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T15:38:00-07:00", "title": "Worst Update Please revert to Simplicity!"}, {"content": "Rubbish after new update, revert back to what it was before everyone stops using it! No more rubbish updates please!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T14:57:00-07:00", "title": "Poor update"}, {"content": "I really hate this update, why try and make this like snapchat? It's not Snapchat its what's app, if people want to use snapchat they'll get Snapchat... Who ever thought this was a good idea got it VERY wrong. Not one person I know has anything good to say about this new update, not one. On the verge of deleting as it stresses me out, used what's app regular previously to communicate, but try to avoid it and use other forms to communicate now.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T14:15:00-07:00", "title": "Why?"}, {"content": "New update is fine but why is everyone app TRYING TO BE LIKE SNAPCHAT. FIRST INSTAGRAM AND NOW THIS!! WE DONT NEED TO HAVE A 'STORY' ON AN APP SOLEY MADE FOR TEXTING PEOPLE!!!", "rating": "3", "version": "2.17.7", "date": "2017-03-04T14:07:00-07:00", "title": "STOP THE SNAPCHAT COPYING"}, {"content": "Why did you have to change it? Did you want to make some sort of Snapchat?? Now I can't have access to any of my contacts, I see only those I'm already speaking at. WHY DID YOU HAVE TO MAKE IT? IT IS WAS MORE THAN PERFECT AS IT WAS!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T14:05:00-07:00", "title": "New update"}, {"content": "STOP TRYING TO COPY SNAPCHAT. Whatsapp was perfectly fine the way it was!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T13:43:00-07:00", "title": "NEW UPDATE IS HORRIBLE"}, {"content": "What an earth is this new update. Have totally messed up the whole of whatsapp. Why would watsapp copy snapchat. I think it was better as it was! Now im scared to update this app now!! Change it back to normal!!😡😡😡😡😡😡", "rating": "1", "version": "2.17.7", "date": "2017-03-04T13:29:00-07:00", "title": "The worst update ever!!😡😡😡"}, {"content": "I used to hate WhatsApp against iMessage now u know the reason. iMessage is iMessage koool and simple, WhatsApp is same but better but this kind of update disappoints users spoils the FUN !!\nWhy the need of a silly update?? \nJust get rid of this status thing and bring back previous version Ty.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T12:48:00-07:00", "title": "Hate this update !!"}, {"content": "What have you done! You can't see contacts and got some stupid 24hr picture thing????", "rating": "1", "version": "2.17.7", "date": "2017-03-04T12:44:00-07:00", "title": "Rubbish since recent update"}, {"content": "Update rubbish why o why", "rating": "3", "version": "2.17.7", "date": "2017-03-04T12:34:00-07:00", "title": "Update"}, {"content": "Absolutely dislike the new update! Why do users need another snapchat alike app on their phone! For people who don't use snapchat it is confusing! Please give back the old one!!! 😠😤", "rating": "1", "version": "2.17.7", "date": "2017-03-04T12:05:00-07:00", "title": "New Whatsapp Update"}, {"content": "Horrendous update", "rating": "1", "version": "2.17.7", "date": "2017-03-04T11:30:00-07:00", "title": "If it ain't broke don't break it."}, {"content": "Another great messaging app ruined", "rating": "1", "version": "2.17.7", "date": "2017-03-04T11:13:00-07:00", "title": "Horrible"}, {"content": "There is now a bug which doesn't let me see who views my story please fix", "rating": "4", "version": "2.17.7", "date": "2017-03-04T10:56:00-07:00", "title": "Would rate 5 stars but.."}, {"content": "This has got to be the worst update ever! Bring back the old version!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T10:41:00-07:00", "title": "2017 Update is AWFUL"}, {"content": "How dare you ignore and disregard your loyal users. You didn't post my review before... you probably won't post this either. Morons!!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T10:32:00-07:00", "title": "Seriously, Whatsapp WTH??"}, {"content": "I liked WhatsApp for its simplicity, if I wanted to know what my friends are up to I'd ask or check Facebook. Please remove the status nonsense.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T10:16:00-07:00", "title": "Didn't need changing."}, {"content": "This app is amazing. It's so handy for me. I like that you can make Siri on ios\nDevices do things for you.", "rating": "5", "version": "2.17.7", "date": "2017-03-04T10:05:00-07:00", "title": "Awesome"}, {"content": "Not liking the new update at all.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T09:50:00-07:00", "title": "New update - 👎🏾"}, {"content": "Stop trying to copy Snapchat. They're way ahead in the stories game. Bring back the normal status as this is not working out!!!!!!!!!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T09:42:00-07:00", "title": "ITS WHATSAPP NOT SNAPCHAT"}, {"content": "I think what's up is a really good app because if you have friends or partners who do not have an Apple device you can contact them on what's up also give them a ring and face time then this means that I can help you contact people that you love and can't talk to you on iMessage because they don't have an Apple device and if you do I talk to them and apple and I message you have to pay that you cannot purchases on an iPad overall I think this app is really good and I suggest you get it but I don't like the way they copied Snapchat with the whole story and about the screenshot then because if you wanna screenshot things I know another tells you which is stupid but oh well overall this app is really good and I think you should get it so thank you for listening thank you for reading sorry and bye what's up is a free app the app that helps you with lots of things the only bad thing about this app is thatthat you cannot purchases on an iPad overall I think this app is really good and I suggest you get it but I don't like the way they copied Snapchat with the whole story and about the screenshot then because if you wanna screenshot things I know another tells you which is stupid but oh well overall this app is really good and I think you should get it so thank you for reading and I hope you take my advice and get the app thank you", "rating": "4", "version": "2.17.7", "date": "2017-03-04T09:40:00-07:00", "title": "My opinion on WhatsApp"}, {"content": "Very good app , no complaint", "rating": "5", "version": "2.17.7", "date": "2017-03-04T09:02:00-07:00", "title": "Working just fine"}, {"content": "WhatsApp used to be my favourite app until the recent update where I can update my status or even see my favourites. Please stop trying to copy Snapchat & give us back the normal WhatsApp we were used to Thanks", "rating": "1", "version": "2.17.7", "date": "2017-03-04T08:34:00-07:00", "title": "Rubbish update!!!"}, {"content": "The new version is certainly worse than anything it replaces. I can't seem to stop the app copying all the photos sent to my phone, despite turning this feature off; please return to how it was!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T08:29:00-07:00", "title": "Very poor"}, {"content": "I hate this app now it's like Snapchat we didn't need this please change it back as I will no longer use this app", "rating": "1", "version": "2.17.7", "date": "2017-03-04T08:27:00-07:00", "title": "Change it back!"}, {"content": "This is great the hate comments are not correct on my phone anyway", "rating": "5", "version": "2.17.7", "date": "2017-03-04T08:21:00-07:00", "title": "Great"}, {"content": "I give one start just because I can't give a negative one\n\nRevert to original to get two starts\n\nRemain stable for the next 2 years might give you 4/5 starts at the end of this 2 years", "rating": "1", "version": "2.17.7", "date": "2017-03-04T08:12:00-07:00", "title": "Do not update"}, {"content": "THE NEW UPDATE IS SO RUBBISH I MEAN WHATS THE POINT OF COPYING SNAPCHAT", "rating": "1", "version": "2.17.7", "date": "2017-03-04T08:04:00-07:00", "title": "WORST UPDATE"}, {"content": "This app is the best game u could get it is not only the coolest but the funest", "rating": "5", "version": "2.17.7", "date": "2017-03-04T07:43:00-07:00", "title": "Alsome game"}, {"content": "Didn't update...just giving you a 1 star for being so utterly stupid about \"stories\"", "rating": "1", "version": "2.17.7", "date": "2017-03-04T07:30:00-07:00", "title": "*Sigh*"}, {"content": "thx for the update 🙄😞", "rating": "1", "version": "2.17.7", "date": "2017-03-04T07:12:00-07:00", "title": "Thanks"}, {"content": "Why would you remove the contacts option from whatsapp!? It's so difficult to find people (you must search for them). Please re-add the contacts option!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T06:30:00-07:00", "title": "New update!"}, {"content": "This is not right! bring back the old what's app I have always loved, this new one is waste! I hate everything about the new what's app!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T05:05:00-07:00", "title": "Why the change???"}, {"content": "Why on earth did you do it. It was ok how it was. Definitely don't like new update. Change it back.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T04:42:00-07:00", "title": "Update"}, {"content": "All these new updates are whack. the next update will show who your online chatting  with. Whatsapp has lost it!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T04:33:00-07:00", "title": "Need to keep it orginial"}, {"content": "Snap chat little b*#%h now , I not had one person on my contacts use the story mode so shows what a waste of time it is , I hate it can't even have a status now or view all contacts with out writing a message update was for bug fixes not to ruin the best app there was , if I knew update would do this I would never of done it 😡😡😡😡😡", "rating": "1", "version": "2.17.7", "date": "2017-03-04T04:33:00-07:00", "title": "😡😡😡"}, {"content": "Don't care about the update. WhatsApp works and that's what matters. It's easy to chat in a group and send some pictures and that's what I like and use whatsapp for. Great job, brilliant app. Gr8 m8 i r8 8/8!", "rating": "5", "version": "2.17.7", "date": "2017-03-04T04:27:00-07:00", "title": "Brilliant app"}, {"content": "This is the first review I have ever wrote. I am appalled. Whatsapp was my favourite app for communicating with friends I barely use it anymore. Why have you not listened to your customers. The latest update is terrible. Bring back the favourites tab!!! The favourites tab and status option was the best feature whatsapp had and you have replaced it with a stories tab nobody wanted. Whatsapp was my favourite app I am very disappointed. Sort this out and bring back the favourites tab!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T04:06:00-07:00", "title": "Beyond Awful 😡😡😡"}, {"content": "Before this new status thing, WhatsApp was great, wonderful for keeping in contact with my friends. I loved everything about it. Until February 2017.\nThis new status thing is pointless, useless, and jut plain rubbish. Whichever clot came up with that idea should be fired for customer displeasure. You DO NOT NEED TO POST PICS THAT DISSAPEAR AFTER 24HRS. PEOPLE DO NOT WANT SNAPCHAT, THEY WANT WHATSAPP, how it was before. Change it NOW or you WILL lose customers. If you are thinking of getting this app, get it cos it's still worth it but they REALLY should change it back. \nThank you ❤️", "rating": "2", "version": "2.17.7", "date": "2017-03-04T04:00:00-07:00", "title": "Great... APART FROM NEW UPDATE"}, {"content": "I've been using WA for over 5 years now and I gotta say this is the worst thing you could've done. The idea of app's been completely ruined with the new 'update' (unnecessary snapchat status like has been added and everything in the app is in a chaotic mess). Pretty disappointed.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T03:57:00-07:00", "title": "Ruined"}, {"content": "Love whatsapp, the update has made it pretty much Snapchat! \nAlso for the desktop version is it possible that we can sign in with username and passwords instead of scanning the code, as I do not always have my phone on me!! But a great app always loved it from the start!", "rating": "5", "version": "2.17.7", "date": "2017-03-04T03:53:00-07:00", "title": "A lot like Snapchat now"}, {"content": "Whatsapp is for messaging. Not for status stories like snap chat! Also it's so annoying that you can't see the contact list anymore.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T03:10:00-07:00", "title": "Hate this new update."}, {"content": "Great app", "rating": "5", "version": "2.17.7", "date": "2017-03-04T02:50:00-07:00", "title": "All in one"}, {"content": "I absolutely love WhatsApp and I'm extremely confused why people hate it so much?!?! The things they are complaining about are minor and have little to no difference on the actual apps capabilities. I love WhatsApp as I can easily connect with all my friends and that's exactly what it does.", "rating": "5", "version": "2.17.7", "date": "2017-03-04T02:46:00-07:00", "title": "Amazing"}, {"content": "Please use your common sense and put it back how it was.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T02:44:00-07:00", "title": "Which Idiot Had This Brainwave"}, {"content": "Whenever you post a GIF in the story tab, no matter how many views it got it keeps saying zero views. \nPlease fix ✘", "rating": "3", "version": "2.17.7", "date": "2017-03-04T02:43:00-07:00", "title": "Story bug"}, {"content": "I like the update. I think it's cool that u can choose which contacts u want to see your status. I think it's a much better way.", "rating": "4", "version": "2.17.7", "date": "2017-03-04T02:30:00-07:00", "title": "Update!"}, {"content": "Update no where near as bad as people making out! Just add favourites to the bottom menu again ASWELL as status and every one will stfu", "rating": "4", "version": "2.17.7", "date": "2017-03-04T02:20:00-07:00", "title": "Not that bad"}, {"content": "I think I'm the only one who likes the new update but I really like it", "rating": "5", "version": "2.17.7", "date": "2017-03-04T02:19:00-07:00", "title": "I like the new update"}, {"content": "Awful. We don't need Snapchat on whatsapp. Simple messaging app turning out to be Snapchat.  Hate it.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T02:10:00-07:00", "title": "Hate it. Don't update"}, {"content": "This app is terrible now what is up with this Snapchat nonsense. Very disappointing.Removed contact list, normal status updates, this app has become very confusing. This is getting deleted. You guys have sold your souls. Good luck handling all the complaints.", "rating": "1", "version": "2.17.7", "date": "2017-03-04T02:07:00-07:00", "title": "Terrible update deleting this app"}, {"content": "I want the old version back NOW!", "rating": "1", "version": "2.17.7", "date": "2017-03-04T02:00:00-07:00", "title": "1000000000% Hate everything about it!"}, {"content": "👎🏻", "rating": "1", "version": "2.17.7", "date": "2017-03-04T01:19:00-07:00", "title": "Not happy with the recent update"}, {"content": "Simple, easy", "rating": "5", "version": "2.17.7", "date": "2017-03-04T00:32:00-07:00", "title": "Good"}, {"content": "Excellent comms service", "rating": "5", "version": "2.17.7", "date": "2017-03-04T00:27:00-07:00", "title": "Full marks"}, {"content": "Proper hate this update the old WhatsApp was much better with favourites where u had all ur contacts on there it was so easy to use", "rating": "1", "version": "2.17.7", "date": "2017-03-04T00:26:00-07:00", "title": "Crappy update"}, {"content": "What idiot changed it, u broke something which wasn't broken in the first place, i would sack who ever idea this was. I am actually moving away from whatsapp due to there stupid update and I think everyone should", "rating": "1", "version": "2.17.7", "date": "2017-03-04T00:22:00-07:00", "title": "Rubbish"}, {"content": "Where has the list of contacts gone? What is this 'my status' rubbish? If I wanted snapchat I'd download that app, stop trying to hip and trendy and return the app to how it was! Awful update.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T23:19:00-07:00", "title": "Terrible update."}, {"content": "The older version was perfect. Why make this like snap chat?\nSomeone's made a big mistake in doing this.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T23:07:00-07:00", "title": "Ruined"}, {"content": "What more can I say? Awesome app and very useful in everyday life.", "rating": "5", "version": "2.17.7", "date": "2017-03-03T22:44:00-07:00", "title": "Brilliant app"}, {"content": "This is the worst pile of crApp since the new 'status' update. Ruined by FB, shagged by Zuckerberg obsessed with copying SnapChat. Gone from a 4-5 star app to 1.5. Congratulations on screwing up what was a perfectly good app. Hope you choke on Snapchat's $30bn IPO 😄🔫", "rating": "1", "version": "2.17.7", "date": "2017-03-03T18:08:00-07:00", "title": "My review keeps getting deleted. Such a bunch of codswallop"}, {"content": "The new update isnt so good after all. I mean its similar to what snapchat and its loosing its own ability of being unique. Writing statuses was a better feature than updating it like snapchat now. Not happy at all.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T17:53:00-07:00", "title": "Dont like the new update"}, {"content": "The app update is meant only sort out the 'bug fixes' as it says. Not 'remove status bar' or 'remove contact photos from favourites list. Thanks to all the reviews it gave me the idea that it was best to stay with the app version I currently have. \nI urge Whatsapp owners to take the feedback seriously and make their users happy with the app that they're using. \n!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T17:21:00-07:00", "title": "Negative reviews"}, {"content": "THIS IS AN AWFUL UPDATE. ABSOLUTELY HATE IT! PLEASE BRING BACK THE OLD WHATSAPP", "rating": "1", "version": "2.17.7", "date": "2017-03-03T17:20:00-07:00", "title": "HORRIBLE UPDATE"}, {"content": "Why update an already great app and then ruin it.  If it's not reverted back to how it was.  Then I shall bid you goodbye.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T16:08:00-07:00", "title": "Ruined"}, {"content": "You people want now users should find another thing like was having a whatsapp😠😠", "rating": "1", "version": "2.17.7", "date": "2017-03-03T15:40:00-07:00", "title": "Why you mess with WhatsApp"}, {"content": "I have had whatsapp for many years and I loved the old format of it.... but for some reason NOW WE HAVE AN UNWANTED,UNNEEDED AND UNWELCOME CHANGE TO IT! The last update I accepted was for bug fixes, not for you to completely change the app. You probably won't, but if anyone who manages whatsapp and possibly looks at the reviews then listen to me 👂and listen good. ALL of the reviews are bad and you are losing users (and therefore money) by the SECOND. Do what you know we all want and change whatsapp back to what it once was, not like a bad photocopy of Snapchat. Everyone knows that to have a successful market, you need to please your customers and you are doing the opposite to that...\n\nDo you want to lose money, users and (people who work for whatsapps) jobs?\n\nJust think about that...", "rating": "1", "version": "2.17.7", "date": "2017-03-03T14:40:00-07:00", "title": "RUBBISH WITH NEW UPDATE"}, {"content": "If I could leave 0 stars I would. App is ruined 😤", "rating": "1", "version": "2.17.7", "date": "2017-03-03T13:14:00-07:00", "title": "Awful update"}, {"content": "I genuinely believe that developers have no friends or don't actually use the app. Nice new feature but no one really cares it won't be the next big thing but am betting every one is seeing that you removed contacts to put that new pointless feature how dare you call that an up date.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T12:50:00-07:00", "title": "Why"}, {"content": "It's amazing!!! Especially the new update with the new status idea.", "rating": "5", "version": "2.17.7", "date": "2017-03-03T12:12:00-07:00", "title": "GR8"}, {"content": "totally destroyed perfect chat! what for ... heavens is it \" live status\"\nw h y!? whats wrong is with you people form\nwhatsaap?! everything before update was great! now I hate this !!! :(w h y ?", "rating": "1", "version": "2.17.7", "date": "2017-03-03T11:57:00-07:00", "title": "why?!"}, {"content": "How to totally ruin a perfectly good chat app in one update!!!\n\nJust like messenger for Facebook.. the coders are obsessed with making all the chat app an absolute pile of 💩💩💩💩\n\niMessage has suddenly become the way to go for messaging.. \n\nGive up with the snapchat clones and keep it how it was!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T11:52:00-07:00", "title": "Omfg 💩💩💩"}, {"content": "No No No! Take away the new status nonsense 🙄\nHate this Update!!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T11:30:00-07:00", "title": "Annoying pop ups"}, {"content": "its so bad.\nplease turn it back to prevoius version.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T10:53:00-07:00", "title": "Very Bad Update"}, {"content": "Whatsapp has been the best messenger app for me up until this new update B.S! Favourites is gone! Why? Why the hell would you do this? Please please please bring it back!!! The new features is good BUT bring the favourites back now please!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T10:17:00-07:00", "title": "HATE IT!!!"}, {"content": "All we want from whatsapp is a simple messenger!!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T09:14:00-07:00", "title": "Remove the stories"}, {"content": "please change back to old what's app.  really do not like the new update.  i want my contacts back....", "rating": "1", "version": "2.17.7", "date": "2017-03-03T08:16:00-07:00", "title": "Don't like it"}, {"content": "I hope the app owners get fired & replaced with better people, people who will add back the statuses feature, people who will allow us to see others profile picture in contacts and someone who improves the quality of Snapchat calling.", "rating": "3", "version": "2.17.7", "date": "2017-03-03T08:00:00-07:00", "title": "Sometimes takes DAYS to install an update!"}, {"content": "What the hell has happened with whatsapp? Its turned into snapchat", "rating": "1", "version": "2.17.7", "date": "2017-03-03T07:55:00-07:00", "title": "Wtf"}, {"content": "Verry Good. Lots of people use it and is worth downloading.", "rating": "5", "version": "2.17.7", "date": "2017-03-03T07:51:00-07:00", "title": "Verry Good"}, {"content": "this update is awful i cant find my contacts or my favourites and the story rubbish is like snapchat ugh fix it please", "rating": "1", "version": "2.17.7", "date": "2017-03-03T07:51:00-07:00", "title": "shocking update"}, {"content": "Terrible update. Hate the way all these apps are merging into one.  We don't need Whatsapp status, we already have insta story and Snapchat, why can't you just stay in your lane? Oh and I want my contact list back 😡", "rating": "1", "version": "2.17.7", "date": "2017-03-03T07:43:00-07:00", "title": "Hate it"}, {"content": "Simply, if you think anything of your userbase bring back the sensible and useful messaging app we all knew and loved.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T06:47:00-07:00", "title": "WhatsApp March 2017"}, {"content": "Bring the old classic style status back !!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T04:23:00-07:00", "title": "👎🏻👎🏻"}, {"content": "New update is terrible, nothing wrong with previous version, wish I didn't update", "rating": "1", "version": "2.17.7", "date": "2017-03-03T04:06:00-07:00", "title": "New update"}, {"content": "What was the need of updating it into another copied version of Snapchat? The best thing about WhatsApp was the status and now that's gone too. Thanks WhatsApp for this shitty update! :)", "rating": "1", "version": "2.17.7", "date": "2017-03-03T03:55:00-07:00", "title": "HATE THIS NEW UPDATE"}, {"content": "No problems", "rating": "5", "version": "2.17.7", "date": "2017-03-03T03:36:00-07:00", "title": "Good app"}, {"content": "No one likes the new update. It's so pointless. No one is using the new status so I have one blank screen where my contacts used to be. That screen can display both similar to how Instagram shows it.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T03:28:00-07:00", "title": "Change it BACK!"}, {"content": "WhatsApp was ideal until the most recent update. Why is every app now trying to be snapchat?! Please bring back the contacts list..", "rating": "1", "version": "2.17.7", "date": "2017-03-03T03:19:00-07:00", "title": "Why change?"}, {"content": "Honestly wish I hadn't updated it! I hate it! Why on earth would you want to post a story on WhatsApp?! It's an absolute pain having to click on new message to see your contacts!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T03:16:00-07:00", "title": "Utter crap!"}, {"content": "Thanks whatsapp, why are these people lazy to tap send a msg? Moaning they cant see their contacts, just plain laziness. I dnt mind it as i dnt wna see my contacts. If u hv people u dnt wna see coz u dnt like them, this is good as u wont hv to see their faces.. pls dnt change this whatsapp. Brilliant job guys thank you xx", "rating": "5", "version": "2.17.7", "date": "2017-03-03T03:10:00-07:00", "title": "Love it"}, {"content": "New app is rubbish", "rating": "1", "version": "2.17.7", "date": "2017-03-03T02:56:00-07:00", "title": "DM"}, {"content": "This is one of those companies which will fail after being successful, i feel so bad for u guys 😂 people who want stories will go to Instagram nd snapchat why are u being so desperate. Maintain the integrity of this app without disturbing the eco system.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T02:36:00-07:00", "title": "Introduction of stories ruined it all"}, {"content": "Ruined a perfectly good app. I just want a app for messaging and seeing some stupid 'snapchat' like updates.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T01:58:00-07:00", "title": "Ruined!!!!"}, {"content": "I hope you have seen the reviews for this update and overall reviews difference.\nPlease bring the old whatsapp back and let snapchat do its work.", "rating": "1", "version": "2.17.7", "date": "2017-03-03T01:31:00-07:00", "title": "Bring the old whatsapp back"}, {"content": "This app is horrendous, I don't even know were to begin. \n\nCould you revert back to the old What's App as this new update is complicated to use, the design is horrible and I don't want a snapchat feature on my what's app too, Instagram and Snapchat are doing their job, I certainly do not need another one!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-03T01:23:00-07:00", "title": "Bring back the old What's App"}, {"content": "HORRIBLE UPDATE!!!!! PLEASE GET RID OF STORY AND BRING BACK FAVOURITES AND STATUSES", "rating": "1", "version": "2.17.7", "date": "2017-03-03T01:07:00-07:00", "title": "Awful"}, {"content": "Why did this app change so dramatically ??? How the hell do I change my statues and pic like wtf is this or is it just me DM me on insta tee_na_32", "rating": "1", "version": "2.17.7", "date": "2017-03-03T00:28:00-07:00", "title": "Hate it"}, {"content": "The new update is absolutely terrible. If it's not broke, don't fix it. Revert to the original WhatsApp please.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T23:52:00-07:00", "title": "Terrible"}, {"content": "It was working fine before this update. It's horribly unreliable.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T23:03:00-07:00", "title": "Worst update"}, {"content": "I used to love WhatsApp writing statuses to flex your mood or your life style and there been too many updates and now WhatsApp what to copy Snapchat sad times🙁", "rating": "1", "version": "2.17.7", "date": "2017-03-02T23:03:00-07:00", "title": "Not happy"}, {"content": "It's really good I just don't see the point of WhatsApp stories", "rating": "3", "version": "2.17.7", "date": "2017-03-02T23:03:00-07:00", "title": "Alright"}, {"content": "Didn't need to be changed - please revert back to allowing text status updates and contact lists without having to create new message", "rating": "1", "version": "2.17.7", "date": "2017-03-02T22:36:00-07:00", "title": "Awful..."}, {"content": "If like me you inadvertently upgraded to this snapchat-imitating vomit that is the latest update, you've lost access to favourites, contacts, simple status setting .. if you have a backup of your iPhone from before they dropped this unwelcome garbage on us, you can delete whatsapp and restore the previous version from your iTunes ..\n\nYET ANOTHER BUG-FIX!! IS THIS JUST TO WIPE OUT THE BAD REVIEWS?", "rating": "1", "version": "2.17.7", "date": "2017-03-02T19:41:00-07:00", "title": "Don't Upgrade, its awful!!! Ruined!"}, {"content": "This app keeps saying that people are online when their not, this has caused complications between me and my girlfriend and it's simply unacceptable!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T19:38:00-07:00", "title": "Terrible"}, {"content": "Old version was excellent, you could put a status on and read other people's status's - the update idiots have removed this!!! they have tried to turn this into Snapchat - if you want an app like this just get Snapchat because this is rubbish now!!! I hope he people that created the new version of whatsapp NEVER WORK AGAIN - idiots!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T19:10:00-07:00", "title": "WORST UPDATE EVER"}, {"content": "This new version is absolutely useless! I barely use the app anymore because it takes so much effort to access my contacts - having the contacts tab at the bottom was so much more convenient and no one uses this Stories feature so go back to the old version please!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T17:11:00-07:00", "title": "Bring back the old version"}, {"content": "Love the app , hate the new update though , please change it to previous version :)", "rating": "5", "version": "2.17.7", "date": "2017-03-02T17:05:00-07:00", "title": "Love/hate"}, {"content": "Hate the new update can no longer have the status I feel like I have two Snapchat apps on my phone and I cannot see my favourites so now I have to come to a chat and type in the persons name for me to be able to message them", "rating": "1", "version": "2.17.7", "date": "2017-03-02T16:46:00-07:00", "title": "H8 it !!"}, {"content": "Horrendous update, it's been made so much worse", "rating": "1", "version": "2.17.7", "date": "2017-03-02T16:41:00-07:00", "title": "No.. just no"}, {"content": "Worst update ever, what's with the stories? Like seriously change it back", "rating": "1", "version": "2.17.7", "date": "2017-03-02T16:26:00-07:00", "title": "New update"}, {"content": "The new update is so bad I've actually reverted back to using iMessage", "rating": "1", "version": "2.17.7", "date": "2017-03-02T16:11:00-07:00", "title": "Terrible Update"}, {"content": "You couldn't ask for more.", "rating": "5", "version": "2.17.7", "date": "2017-03-02T16:06:00-07:00", "title": "Perfect"}, {"content": "Awful! I want to write my own status like I could before 🤔", "rating": "1", "version": "2.17.7", "date": "2017-03-02T15:49:00-07:00", "title": "Bring back old status!!"}, {"content": "Worked very well prior to recent update ,\nkeeps logging me off \nwonder why ?", "rating": "3", "version": "2.17.7", "date": "2017-03-02T15:41:00-07:00", "title": "What's up to whatsapp ?"}, {"content": "Hate the new update, can't see contacts!!! Similar to Snapchat... with status updates... honestly just ruined !!!😠😠", "rating": "1", "version": "2.17.7", "date": "2017-03-02T15:09:00-07:00", "title": "Why change it!!!"}, {"content": "WHY ON EARTH ARE WHATSAPP NOT LISTENING TO THEIR KEY STAKEHOLDERS?!? You know the ones.... US THE USERS... WHO CONPLETELY HATE THIS SNEAKY NEW UPDATE. A BUG FIX IT ISNT. A TOTAL JOKE OF A REDESIGN.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T14:51:00-07:00", "title": "Why?!?"}, {"content": "Is this a joke?? Seriously why try and imitate Snapchat? If I want a status update that disappears after 24 hours I'll use Snapchat. \nThere's alsorts wrong with this new update!! Please revert back to previous version. This one is terrible 👎🏾👎🏾👎🏾", "rating": "1", "version": "2.17.7", "date": "2017-03-02T14:44:00-07:00", "title": "WHERE HAS THE LIST OF FAVOURITES/CONTACTS GONE?"}, {"content": "Listen to your users! Bring back the previous version; the favourites button and the option to post a permanent, written status.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T14:40:00-07:00", "title": "Terrible update"}, {"content": "This new update has ruined what was the simplest, and by far my favourite, messaging app ..... trying to be 'cool' or 'trendy' with constantly updated statuses isn't what I, or my friends, want! \nBring back the old app please.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T14:26:00-07:00", "title": "Update is Awful - a good app ruined 😡"}, {"content": "Why!?... just why kmt", "rating": "1", "version": "2.17.7", "date": "2017-03-02T14:24:00-07:00", "title": "WhatsApp WhatsYouDone"}, {"content": "Hate the update, is so unnecessary for this update and changing all the features. Stop copying snapchat and bring the old features back", "rating": "1", "version": "2.17.7", "date": "2017-03-02T14:18:00-07:00", "title": "Stupid update"}, {"content": "FOR THE LOVE OF GOD CHANGE IT BACK!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T13:49:00-07:00", "title": "WORST UPDATE EVER!"}, {"content": "This new update is ridiculous. People are not going to sit there updating there status once every 24 hours. We don't have time for this and we already have snapchat for this anyway. In one day you have gone from 💯 to 0.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T13:32:00-07:00", "title": "Ok"}, {"content": "I wish there was option for 0 stars cause the new update is so rubbish. Facebook ruined everything. First Instagram then WhatsApp", "rating": "1", "version": "2.17.7", "date": "2017-03-02T13:31:00-07:00", "title": "So rubbish"}, {"content": "I might stop using Worstapp!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T13:30:00-07:00", "title": "Hate it"}, {"content": "Deleting poor reviews of the latest update, including mine, will not alter the fact that the latest update is crap and not needed  .... GIVE US BACK OUR OLD WHATSAPP AND SACK WHOEVER AUTHORIZED THE UPDATE COS THEY HAVEN'T A CLUE !!!!!!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T13:14:00-07:00", "title": "Naff naff naff !!!!!!"}, {"content": "Why would you plonk a camera button in centre? I want to see my contacts and also status of them . Why on earth change something which wasn't broke..", "rating": "1", "version": "2.17.7", "date": "2017-03-02T13:13:00-07:00", "title": "Contacts"}, {"content": "Gone from best app to snap chat. I mean how old are we now. Jesus. Bring back the old version asap. Not happy with this update.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T13:02:00-07:00", "title": "Awful update"}, {"content": "Why did they have to turn whatsapp into snapchat ?? I hate it and really hope they change it back to just the regular statuses..... come on whatsapp we loved it just the way it was.", "rating": "2", "version": "2.17.7", "date": "2017-03-02T12:59:00-07:00", "title": "Change isn't good"}, {"content": "Absolutely hate this rubbish update. Please bring back the old WhatsApp we all know and love ! If it ain't broke DONT FIX IT !!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T12:58:00-07:00", "title": "New WhatsApp update"}, {"content": "As stated with other reviews, it is a shame that some nice features have been removed. At its core, it is still a great app. though.", "rating": "2", "version": "2.17.7", "date": "2017-03-02T12:39:00-07:00", "title": "Very disappointed with this update"}, {"content": "BRING BACK THE ESSENTIAL CONTACTS BUTTON!!!! The new status stories is an unwanted feature!!! No one I have talked to has said that they like it and to be honest everyone is mocking it!! If you're not going to get rid of that, then at least change the useless \"camera\" button into a \"contacts\" button!!! PLEASE CONSIDER CHANGING IT BACK TO SOMETHING SIMILAR (IF NOT SAME) AS THE PREVIOUS VERSION!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T12:09:00-07:00", "title": "WHY???"}, {"content": "Hate the new update , it's ruined whatsapp!! There was no need to copy snapchat. I just hate it , doesn't even deserve 1 star !!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T12:00:00-07:00", "title": "Awful, just horrendous!!!!"}, {"content": "Really? Was necessary to destroy this app? YOU DIDN'T ASKED ME FOR THIS UPDATE, LAST UPDATE WAS FOR BUG FIXES!!!!!!! Whatsapp was an app just for texting or calling sometimes..where are my contacts? List of contacts with status and profile picture? If u really wanna to make this \" snapfake\" you should make it just like an option, not the most important things from the app. We already had snapchat..then insta and facebook, it was enought..i downloaded whatsapp for a reason, privacy, just for texting, not to see stories..it's extremely sad and i really hope that you will understand your clients, your old clients. Remove it. Even if a 40% of your clients like it, dont give up to the other 60%. Come on, stay a serious app.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T11:51:00-07:00", "title": "Thanks for destroying it.."}, {"content": "This app allows me to talk to my European friends effortlessly! Really good ☺️", "rating": "5", "version": "2.17.7", "date": "2017-03-02T11:47:00-07:00", "title": "I really like this app."}, {"content": ":(", "rating": "1", "version": "2.17.7", "date": "2017-03-02T11:46:00-07:00", "title": "doesn't work anymore"}, {"content": "You just fudged up this whole app. Why did you do that for? Blending in with apps like snapchat? Because now you are just a failed copycat that prioritises hype over utility and functionality.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T11:45:00-07:00", "title": "Awful update"}, {"content": "Everything is like a snapchat now. First it was instagram and now its whatsapp.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T11:20:00-07:00", "title": "Bad"}, {"content": "Love the new up date! Go What's app!", "rating": "5", "version": "2.17.7", "date": "2017-03-02T10:48:00-07:00", "title": "LOVE IT LOVE IT LOVE IT"}, {"content": "Used to love this app but since the update that changed the statuses it's awful, change it back!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T10:30:00-07:00", "title": "Rubbish!!"}, {"content": "I have never written a review before, but you have ruined a great app. Please restore Favourites & Status to their former glory.\nI don't want to give any stars to this app now, but otherwise I'm unable to send it, so here is 1 star, which is way too much.\nI do hope you read the reviews posted before mine... I'm glad I'm amongst 99.9% of reviewers...", "rating": "1", "version": "2.17.7", "date": "2017-03-02T10:28:00-07:00", "title": "Terrible update, full of horrendous ideas!"}, {"content": "What did you update? Don't fix what ain't broke! Have to annoyingly agree to T&Cs etc and sign in every time to get my messages. What's the pony of that?", "rating": "1", "version": "2.17.7", "date": "2017-03-02T10:26:00-07:00", "title": "Update made it worse"}, {"content": "I think WhatsApp is a brilliant app ! You can do so much on it. But I have one problem I think you should be able to use it without internet incase of an emergency so please fix this problem on the next update. Thank you for reading.", "rating": "4", "version": "2.17.7", "date": "2017-03-02T10:00:00-07:00", "title": "Jessica's review"}, {"content": "I think whatsapp is a great app to get in touch with friends and family. But I have one problem\nWhen I use my mobile data it uses way to much when I send just one message. I think you should be able to use it without internet.  But I have no other problems and I think it's great.", "rating": "4", "version": "2.17.7", "date": "2017-03-02T09:56:00-07:00", "title": "Indiahs review"}, {"content": "Why??i mean why do u have to copy a stupid app like snapchat??not everyone wants to put pic as their status..it was just perfect as it was.why did u lot changed it?can u not stop copying others..it's the most worst app update to me till now..please revert back to original or else we have to delete it as there's so many other apps to communicate..please please.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T09:26:00-07:00", "title": "What a copycat???"}, {"content": "Why did the update decide now to remove my contact list.. I don't like this updated version like everyone is saying please take it back to how it was originally not happy and don't like useing it now", "rating": "1", "version": "2.17.7", "date": "2017-03-02T08:51:00-07:00", "title": "Daft update :-("}, {"content": "This was a great messaging app until they updated it and made it just like Instagram, removing favourites was a huge mistake and this should be reinstated instead of \"status\", I have stopped using this now in favour of iMessage. \nShame I have to leave such a bad review.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T08:42:00-07:00", "title": "Ruined!"}, {"content": "They should bring back the old favourites section and the old status... It was fine the way it was.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T08:01:00-07:00", "title": "Horrible update"}, {"content": "Wdf is what's app doing? Hate the new update is so crap please revert back to original if I could give no stars I would🙊but unfortunately I had to give 1 🙈thinking of deleting all together not a Hapi bunny", "rating": "1", "version": "2.17.7", "date": "2017-03-02T07:22:00-07:00", "title": "Hate the update"}, {"content": "Brilliant app", "rating": "5", "version": "2.17.7", "date": "2017-03-02T06:57:00-07:00", "title": "Carol"}, {"content": "New update is awful 😞", "rating": "1", "version": "2.17.7", "date": "2017-03-02T06:51:00-07:00", "title": "Crap"}, {"content": "Terrible update. Why whatsapp? What's the need for this latest update by removing the original status format. Just listen to your audience and revert it. This new one is crap and I certainly won't be using the feature. Ive got snapchat for that", "rating": "1", "version": "2.17.7", "date": "2017-03-02T06:10:00-07:00", "title": "Terrible Update"}, {"content": "stop trying to be like snapchat, the new update is the worst", "rating": "3", "version": "2.17.7", "date": "2017-03-02T05:59:00-07:00", "title": "lol"}, {"content": "I DONT EVEN WANT TO GIVE IT 1 STAR! CHANGE IT OR ELSE WHATSAPP U WILL LOSE ALL UR PPL", "rating": "1", "version": "2.17.7", "date": "2017-03-02T05:56:00-07:00", "title": "PUT THE CONTACTS BACK"}, {"content": "Awful awful awful go back to old app today", "rating": "1", "version": "2.17.7", "date": "2017-03-02T05:56:00-07:00", "title": "Omg what have you done to it"}, {"content": "I don't mind the new features, but it is irritating that:\n1 - My ring tones keep resetting to the default tone\n2 - I am frequently asked to re-register, type my name/phone number in etc..", "rating": "2", "version": "2.17.7", "date": "2017-03-02T05:43:00-07:00", "title": "Annoying Bugs"}, {"content": "Why oh why did they have to go and tinker with it trying to veer towards being a social medium platform. So I have to update my status every 24 hours?....it's a messaging platform. Just hold your hands up admit you made a boo boo and revert back.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T05:23:00-07:00", "title": "If it ain't broke don't fix it..."}, {"content": "This is NOT snapchat! Put it back to the way it was", "rating": "1", "version": "2.17.7", "date": "2017-03-02T05:11:00-07:00", "title": "HATE HATE HATE the new app"}, {"content": "Used to be okay but SHIIIIIIITTT now after the update icant even see my contacts n snapchat need to sue u", "rating": "1", "version": "2.17.7", "date": "2017-03-02T05:03:00-07:00", "title": "we want the old version back this is fuckery"}, {"content": "Why did whatsapp think it was beneficial to change its features and add story. This is not Snapchat! 😤 So frustrated that to see contact details you have to through process if writing a message...far too long winded. Only 2 stars out of kindness for what it was...", "rating": "2", "version": "2.17.7", "date": "2017-03-02T04:48:00-07:00", "title": "Downhill 😩"}, {"content": "I cannot stand this new update how am i suppose to scroll through my whole contact list and spy on peoples display pictures!?Too much like Snapchat and unprofessional for business please change it back! Some people appreciate privacy and not  everyone needs an update of what anyone else is doing - there are other apps for that! Im not a social media fan but i liked Whatsapp because it was simple. It has been completely ruined with this new feature.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T04:23:00-07:00", "title": "HATE NEW UPDATE"}, {"content": "I'm deleting this now pile of s**t since the update", "rating": "1", "version": "2.17.7", "date": "2017-03-02T04:08:00-07:00", "title": "Disappointed"}, {"content": "Hate hate hate this latest update it was perfectly fine as it was 😡😡 don't use it nearly as much as I used to", "rating": "3", "version": "2.17.7", "date": "2017-03-02T04:06:00-07:00", "title": "Not happy 😡"}, {"content": "Another \"bug fix\" which didn't revert it back to what we are all asking for, even though the first \"bug fix\" monumentally changed the face of whatsapp. \nFor the record here is my other review which was magically deleted in the latest update..\n\nI love whatsapp. But what the bloody hell is this new status button? Take it away. This is not Facebook.\nYou can't see anyone's status anyway when you are in the chat setting and I've lost my favourites list which is where you could see all that??? \nI don't get it at all.", "rating": "1", "version": "2.17.7", "date": "2017-03-02T04:03:00-07:00", "title": "What the???!"}, {"content": "You've ruined WhatsApp with the new update. How do i go back 😩", "rating": "1", "version": "2.17.7", "date": "2017-03-02T03:47:00-07:00", "title": "Hate it"}, {"content": "Pretty sh*t, I don't want snapchat on whatsapp.. I want to see contacts instead", "rating": "1", "version": "2.17.7", "date": "2017-03-02T02:20:00-07:00", "title": "Feb update 2017"}, {"content": "Since the new update I am unable to send bitmoji's and I can't see my favourites anymore, this is basically another version of snapchat!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T02:07:00-07:00", "title": "No bitmoji or favourites"}, {"content": "Bring back favourite button and old status ... Be unique .. and don't follow the step of insta and snapchat please ..", "rating": "1", "version": "2.17.7", "date": "2017-03-02T01:36:00-07:00", "title": "Utterly clutterly gutterly disgusting update"}, {"content": "Bring back the old what's app and the favourites bar and stop changing things!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T01:19:00-07:00", "title": "Bring back the old what's app!!"}, {"content": "What's happened to my favourite messaging app? Stories? Where's my contact list gone??\n\nDon't update to the new version! Please revert back to the previous version because this version is rubbish!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T01:18:00-07:00", "title": "Update abysmal!"}, {"content": "This version is terrible \nPlease bring back the old version asap!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T00:44:00-07:00", "title": "Get rid of status"}, {"content": "Update isn't great. Should have kept it the way it was!", "rating": "2", "version": "2.17.7", "date": "2017-03-02T00:42:00-07:00", "title": "Not the best"}, {"content": "Need self destructing messages like Wickr and Messenger, more and more apps have this ability now, people can message more personal things without worrying it will be relayed.\n\nWickr even tells you if someone screen shotted your text!", "rating": "1", "version": "2.17.7", "date": "2017-03-02T00:37:00-07:00", "title": "Why remove favourites button?"}, {"content": "Love this update! But the number of views needs to be fixed! People will message me from my story but it will still say 0 views on the bottom??", "rating": "4", "version": "2.17.7", "date": "2017-03-01T23:47:00-07:00", "title": "Views"}, {"content": "WhatsApp is great but the recent update is rubbish. Why lose the status option?? This is not Instagram or Snapchat! Please bring it back! 😡", "rating": "1", "version": "2.17.7", "date": "2017-03-01T22:51:00-07:00", "title": "Hate the update - why lose the status??"}, {"content": "Why are all social media apps copying one another, I have different apps for different uses, I don't need another app to start copying snapchat with stories. Get some originality🙄", "rating": "1", "version": "2.17.7", "date": "2017-03-01T22:35:00-07:00", "title": "AWFUL UPDATE"}, {"content": "After update can not open app , iphone 4s , ios 7.0.4 crash happend everytime ,stuck to this version untill next fix :-(", "rating": "1", "version": "2.17.7", "date": "2017-03-01T20:55:00-07:00", "title": "App crash"}, {"content": "One of the Worst app ever since it has changed, what happen to be able to write status on wats app, trying to copy snapchat, every app has its unique symbol!! Needs to\nGet back to being watsapp not this horrible new app where only can put pics up!!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T20:45:00-07:00", "title": "WATS APP CHANGED"}, {"content": "The new update is so not on ! Not having favourites option and not being able to view dp's is so not on. What app are we suppose to stick to now your all the same! Sometimes it's nice to have a getaway app from all the madness apps. #bribgbackoldversion", "rating": "1", "version": "2.17.7", "date": "2017-03-01T19:31:00-07:00", "title": "Copy cat steal a rat"}, {"content": "I WANT THE OLD WHATSAPP BACK!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T19:20:00-07:00", "title": "The new update is disgraceful"}, {"content": "This was a simple, brilliant app, which was what made it so great. I WAS pleased to see that although Facebook brought WhatsApp little changed. Great. Until this update. As Facebook did with messenger and Instagram it has basically integrated the entire snapchat app into WhatsApp. It is completely unnecessary, why do I need 4 (and counting) Snapchat Like apps. It screams desperation from fb as they are intimidated by SC. The way to stay relevant is not to copy your competitors with terrible updates but actually innovating and providing users with useful features!!! Please note!!", "rating": "2", "version": "2.17.7", "date": "2017-03-01T18:04:00-07:00", "title": "WhatsApp(Facebook) stop trying to be snapchat!!"}, {"content": "Possibly the worst update to any app ever. What are you thinking!?", "rating": "1", "version": "2.17.7", "date": "2017-03-01T18:03:00-07:00", "title": "Worst update ever"}, {"content": "Horibble horrible...bring old version back. I hate it.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T16:44:00-07:00", "title": "Miss"}, {"content": "What was the need to bring in the live updates, looks awful, out of place and just stupid.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T16:35:00-07:00", "title": "WHY?????"}, {"content": "You've ruined Whatsapp with the story update!\n listen to your users please", "rating": "1", "version": "2.17.7", "date": "2017-03-01T16:20:00-07:00", "title": "Story update is rubbish"}, {"content": "Making anything they get their grubby hands on that little bit worse. I choose not to use Snapchat for a reason. \nSnapchat has a purpose.\nWhatsapp has a purpose.\nIn summary revert the change.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T16:08:00-07:00", "title": "Facebook doing what it does best."}, {"content": "Had no problem with the app before, not even the bad calls or even accidentally calling someone when pree'n their pictures but this new update has got to GOOOOO!!!! 😩", "rating": "1", "version": "2.17.7", "date": "2017-03-01T15:58:00-07:00", "title": "New update is the WORST!!"}, {"content": "It would be save lots of misunderstanding if its possible to take msg back", "rating": "1", "version": "2.17.7", "date": "2017-03-01T15:58:00-07:00", "title": "Please let user can withdraw msg"}, {"content": "This isn't snapchat. Stop trying to turn this once great app into something the majority clearly don't want. Just sort it out.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T15:56:00-07:00", "title": "Sort it out."}, {"content": "New update is good don't know why everyones moaning -", "rating": "5", "version": "2.17.7", "date": "2017-03-01T15:31:00-07:00", "title": "Great"}, {"content": "At last offline messages, I've only waited 4 years. It's draining my battery a lot with background usage, I'm on an iPhone 6s.  PLEASE PLEASE brings back the status timestamp and an option to turn off video calls. Stop trying to be Snapchat", "rating": "1", "version": "2.17.7", "date": "2017-03-01T15:25:00-07:00", "title": "You've messed up"}, {"content": "...doesn't need mending. I never write reviews but the changes made... no contacts, worthless status column and a camera I don't need. \nPlease keep it simple. It's not FB or Instagram, so stop trying to change it.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T15:18:00-07:00", "title": "What's not broken..."}, {"content": "Not sure why they changed it! Took me ages to understand where contacts where. They also seem to think I want to use this like social media, but I don't, I want to use it JUST for messaging.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T15:17:00-07:00", "title": "It was better before"}, {"content": "Was wonderful ... became awful.\nI've got no words to describe the deception about this new pu you've just made.\nNo words", "rating": "1", "version": "2.17.7", "date": "2017-03-01T15:04:00-07:00", "title": "This is a regression"}, {"content": "THE NEW UPDATE IS REALLY BAD THAT IVE ACTUALLY DELETED IT OUT MY PHONE!! I LOVE WHATS APP ASWELL BUT ITS NEW UPDATE HAS MADE IT LOOK LIKE SNAPCHAT AND I CANT SEE MY NORMAL CONTACT LIST ITS CRAP NOW!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:48:00-07:00", "title": "UPDATE"}, {"content": "Status thing pointless not having favourites is annoying, which moron came up with this?? Probably the same ppl running this country! God help us all", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:46:00-07:00", "title": "Awful!!"}, {"content": "App was fantastic. Removing the favourites tab has completely ruined this app for me. I hope whatsapp takes note of its customers opinions.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:32:00-07:00", "title": "Unusable"}, {"content": "Where has contacts gone?? This new status option is totally irrelevant and useless. This app was perfect for what it was made for and that was simply messaging! Please don't turn this into another social media platform!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:25:00-07:00", "title": "Horrible update!"}, {"content": "They should make another app for it and linked with it", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:22:00-07:00", "title": "Stupid update"}, {"content": "I had to reset my iphone just to back couple months back to get original whatsapp 😂 it says i have to update within 20 days because the better version of whatsapp is expiring. How has whatsapp one of the best messaging apps to exist for years all of a sudden become such a shitty app. Disappointed big time", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:21:00-07:00", "title": "Disappointed"}, {"content": "I'm no huge fan of Snapchat but come on, why over complicate a perfect simple messaging service. You've lost all my respect. Guess this is \"Innovation\" these days🙄", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:13:00-07:00", "title": "Update = Snapchat copycat"}, {"content": "I like the new changes in app keep the good 😊", "rating": "5", "version": "2.17.7", "date": "2017-03-01T14:13:00-07:00", "title": "👌👌"}, {"content": "The latest update is absolutely rubbish. I want to be able to write a status and not have to put a picture on as well! I have snapchat Facebook and instagram for that. Made it too complicated to do and find things. Sort it out, simplify!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:11:00-07:00", "title": "Keep it simple"}, {"content": "Such a delay after the update.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T14:08:00-07:00", "title": "Messages take ages to send now"}, {"content": "The worst update possible.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T13:59:00-07:00", "title": "Horrible Update"}, {"content": "Every time I click to open a conversation, it shuts Dow so can't see messages!!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T13:57:00-07:00", "title": "Doesn't work"}, {"content": "Whatsapp is the best special now that u can make video call too :)", "rating": "4", "version": "2.17.7", "date": "2017-03-01T13:33:00-07:00", "title": "Awesome"}, {"content": "Very very very disappointed in the new update. Have been using Whatsapp for many years and have never been this disappointed. Now you close one app and open another, and they're all the same. Do not understand this logic of this update and wish Whatsapp would take an action to these negative reviews and change it back to how it was so people like myself could enjoy using the app just like before. Did not expect this from Whatsapp, very very disappointed. 👎🏻", "rating": "1", "version": "2.17.7", "date": "2017-03-01T13:27:00-07:00", "title": "Thumbs down."}, {"content": "Unimpressed.  If it's not broke don't 'fix' it.", "rating": "2", "version": "2.17.7", "date": "2017-03-01T13:17:00-07:00", "title": "New latest Whatsapp version"}, {"content": "Prefer the old version where u can write your own status and upload a pic that u wanted rather than taking a picture and writing something on the picture and was there till we decided to change it. u could also see all contacts in contacts along the bottom of screen, but the developers have now decided to take this option away from us and the customers don't like the new changes revert back to the old what's app that we all like", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:53:00-07:00", "title": "Hate the new update"}, {"content": "Why change when it worked perfectly ? Can no longer see favourites or contacts. Massive step backwards. Please change it back else you will lose a lot of unhappy users 😞", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:45:00-07:00", "title": "Disappointed"}, {"content": "I hope whoever came up with the idea of replacing favourite  with the status tab should get the sack. I for one have no intention of using the Snapchat rip off... I'd much rather use snap chat.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:41:00-07:00", "title": "Why mess with a good thing?"}, {"content": "Awful update bring favourites back !!  stop trying to be snapchat. It's a messenger app nothing else back to basics", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:38:00-07:00", "title": "New update missing contacts list"}, {"content": "Bring back the previous version. Cheated in to updating!! Said bug fixes. Lie lie😡😡", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:33:00-07:00", "title": "Rubbish😡😡😡😡😡"}, {"content": "Really disappointed with the new version. Can we please have favourites button back :( :(", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:17:00-07:00", "title": "Disappointed"}, {"content": "WhatsApp used to be the best text messaging app around, not anymore. The latest update has ruined it, the contacts list has gone and been replaced by an utterly pointless camera section, and the status section is again pointless. Please stop trying to turn this app into Snapchat or Facebook, it worked so well as messaging app. Please change it back to how it was as its ruined now and I am seriously considering deleting it, a response to an email from the WhatsApp team shows that they don't care what the users think.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:10:00-07:00", "title": "Update has ruined this app"}, {"content": "Why remove the contacts tab?!? It made it easy to add new people and expand Whatsapp's success.\nThe new camera button unnecessary perhaps.\nThis update 2.17.7 has seriously depleted the strengths of Whatsapp!!\nWas 5 stars, but now unfortunately only merits 2 stars.", "rating": "2", "version": "2.17.7", "date": "2017-03-01T12:06:00-07:00", "title": "Don't update to 2.17.7 !!"}, {"content": "Hate the whole layout now! It's a messaging app not snapchat... bring back favourite contacts", "rating": "1", "version": "2.17.7", "date": "2017-03-01T12:01:00-07:00", "title": "Get rid of status"}, {"content": "Why have they got rid of the favourites and contacts icons. We need this back. \nGet rid of stories! If I wanted to post stories I'd download snapchat", "rating": "1", "version": "2.17.7", "date": "2017-03-01T11:49:00-07:00", "title": "Deleting App"}, {"content": "I didn't want to update this app but it would not let me use it anymore so had no choice.i liked the old simpler version it was so easy to use,especially deleting old chat text.why mess with something that wasn't broken.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T11:43:00-07:00", "title": "old version better"}, {"content": "I can't see who has watched my status. Fix this please.", "rating": "3", "version": "2.17.7", "date": "2017-03-01T11:41:00-07:00", "title": "Views"}, {"content": "The app is amazing I love it \nBUT \n*can we please have streaks* it would make the app so much better and can we have filters on faces \nI know I am sounding like I am describing Snapchat but it would be nice and fun plus it would make the app so popular !!\nBut apart from that it is really good 😉\nI like the new update but plz can u do streaks and filters on pics 🙏🏼", "rating": "4", "version": "2.17.7", "date": "2017-03-01T11:27:00-07:00", "title": "Can we have streaks and filters on photos"}, {"content": "Free texts - best way to send pics. And if you're an international spy you can use it because its encrypted. \n\nI use it to ask Miss Moneypenny to stick the kettle on. \n\nJames - London", "rating": "5", "version": "2.17.7", "date": "2017-03-01T11:15:00-07:00", "title": "Smashing"}, {"content": "This update is C#*£P. Bring back the previous version with the favourites tab. Guess I'll be going to Viber if this isn't sorted. (I would give it no stars rating if you could select none).", "rating": "1", "version": "2.17.7", "date": "2017-03-01T10:55:00-07:00", "title": "What have you done ⁉️"}, {"content": "Well done WhatsApp team, you just signed the company's death warrant.\nBring back the old app or you will lose your billions of customers and the #1 spot.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T10:49:00-07:00", "title": "Diabolical update;  revert to the old app and bring back contacts and status"}, {"content": "Hate,hate,hate😡😡😡 this new status change is crap!!!! Goodbye WhatsApp", "rating": "1", "version": "2.17.7", "date": "2017-03-01T10:07:00-07:00", "title": "New update"}, {"content": "The new update for what's app is rubbish! Why make changes that make the app worse?? Maybe on your next update you could put it back to what it was and make everyone happy!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T09:56:00-07:00", "title": "Why change something that's great"}, {"content": "Since the last update every time I close the app when I open it again it asks for my phone number and for my details. I only get messages when I open the app and enter the details. No message notifications etc! HELP!", "rating": "2", "version": "2.17.7", "date": "2017-03-01T09:33:00-07:00", "title": "Keeps asking for my number."}, {"content": "Whatsapp still have not listened to their customers. I want the favourites tab back and the ability to write a personalised status. Also please remove the new status update (stories) it's not needed. People are not glued to their phones every minute posting pictures or videos. I would like to post / see their written status at a time that suits me not in 24 hours. Please do this Whatsapp and you will save your reputation.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T09:30:00-07:00", "title": "Listen to your customers"}, {"content": "So not liking this new update!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T09:28:00-07:00", "title": "Snapchat??"}, {"content": "Awful decision to take out the favourites button. What's worse is the camera function, no need for it. Bring back favourites.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T08:56:00-07:00", "title": "Terrible update"}, {"content": "What a ridiculous update idea. I can't find any of my contacts!! The camera button is pointless and annoying. If we wanted to post pictures, we'll use snapchat. Please go back to the old simpler version of whatsapp.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T08:47:00-07:00", "title": "No one wants snapchat on whatsapp!"}, {"content": "If you like Whatsapp DONT UPDATE!\n\nThis new release said it was only bug fixes! They lied!\n\nIt removes favorites and makes it more and more like the Facebook applications.\n\nIt I were the developer I would put it back how it was.\n\nListen to the users. \n\nWE DONT WANT IT!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T08:41:00-07:00", "title": "Rubbish after update"}, {"content": "TAKE FACEBOOK UP YOURS, and give WhatsUp back !!!!! If I wanted SnapChat or FaceMessenger... BUT I DON'T FACE CRAP!!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T08:38:00-07:00", "title": "FACEBOOK in WhatsUp is a Fukn joke!!!l"}, {"content": "Seriously are you trying to make people want to not use this app ???", "rating": "1", "version": "2.17.7", "date": "2017-03-01T07:42:00-07:00", "title": "Update WTF?"}, {"content": "this new update is full of SH*T , whattsap is not snapchat! \n\nwhere is the favourites option gone , i cannot even view which of my friends are on whattsap anymore!\n\nrubbish update!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T07:40:00-07:00", "title": "bring back the old whattsap"}, {"content": "Awful update. WhatsApp is turning into another Snapchat, where's the originality? It went from being a simple loved app to one my most hated apps. Bring back the old WhatsApp!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T07:26:00-07:00", "title": "New update is awful !!"}, {"content": "This has been the worst ever... I preferred when I could write my status and it will stay for as long as I want... the least that they can do is keep this status and make it as a stories but bring the old status back....", "rating": "1", "version": "2.17.7", "date": "2017-03-01T07:04:00-07:00", "title": "Worst update"}, {"content": "Meh update", "rating": "3", "version": "2.17.7", "date": "2017-03-01T07:03:00-07:00", "title": "Meh"}, {"content": "Facebook has already cloned snapchats features in instagram, why do we need them cloned here too? Much better before the latest update", "rating": "1", "version": "2.17.7", "date": "2017-03-01T07:01:00-07:00", "title": "Who needs another snapchat?"}, {"content": "Bring back the original version", "rating": "1", "version": "2.17.7", "date": "2017-03-01T06:46:00-07:00", "title": "New update is totally crap"}, {"content": "What was the need to ruin this perfectly fine app with usless fetures. Put it back the way it was !", "rating": "1", "version": "2.17.7", "date": "2017-03-01T06:19:00-07:00", "title": "Latest updated ruined a perfect app"}, {"content": "Bring back the my contacts/favourites", "rating": "1", "version": "2.17.7", "date": "2017-03-01T06:08:00-07:00", "title": "WhatsApp status👎🏼"}, {"content": "Put the status back to how it was!!! Or make it optional!!! Really annoying.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T05:42:00-07:00", "title": "Awful new update"}, {"content": "I want the old status back hate the new look", "rating": "1", "version": "2.17.7", "date": "2017-03-01T05:36:00-07:00", "title": "Worst up date ever"}, {"content": "What used to be a great app is now turned into a bad app. \nThis is just not on.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T05:04:00-07:00", "title": "Totally nonsense"}, {"content": "What a grand screw up. Where is contact and favourites gone.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T04:20:00-07:00", "title": "Terrible"}, {"content": "GARBAGE", "rating": "1", "version": "2.17.7", "date": "2017-03-01T04:01:00-07:00", "title": "Mr"}, {"content": "If you guys can see that so many people hate the new update why haven't you changed it yet?! We need the status option where we write interesting and peculiar quotes back this new snapchat oriented ideal is not whatsapp material", "rating": "2", "version": "2.17.7", "date": "2017-03-01T04:00:00-07:00", "title": "Why isn't it fixed yet"}, {"content": "I'm an app developer and I keep my centre on USER FRIENDLY!!!\n\nFirst of all, I'd like to address that anyone says this app is great and given 5stars is simply because they haven't use it before or not used it long enough.\n\nWhat I don't like about WhatsApp:\n\n• WhatsApp doesn't support iPad device;\n\n• WhatsApp doesn't support Apple Watch;\n\n• WhatsApp doesn't have \"send read receipt\" switch or just for individual conversation;\n\nAll of these list above are what should have been included long time ago\nAnd now WhatsApp is officially became a Snapchat copycat.\n\nWhat's the point of create a point to point encrypted messaging app for message content privacy and security and then bring out a Snapchat ish Story section for the public to see? Utterly stupid!!!\n\nAnd I'm sure most people will agree with me that they use WhatsApp for the sake of the Ease of Access, simplified UI design and quick messaging structure.\n\nTherefore WhatsApp don't need any fancy features other than direct communication.\n\nAnd one more thing: don't do it the flipping big fix when you don't need to. App crash doesn't mean there is definitely a problem with your coding.\n\nHorrible app", "rating": "1", "version": "2.17.7", "date": "2017-03-01T03:50:00-07:00", "title": "The worst app after recent update"}, {"content": "Nonsense you should have left it alone and stop trying so hard to copy Snapchat", "rating": "1", "version": "2.17.7", "date": "2017-03-01T03:47:00-07:00", "title": "Marie M"}, {"content": "Leave it as it was\nDont copy snapchat", "rating": "1", "version": "2.17.7", "date": "2017-03-01T02:29:00-07:00", "title": "New update rubbish"}, {"content": "This update is unnecessary and has made whatsapp into a poor copy of snapchat. Please go back to the old whatsapp we all knew and loved. Not one of my contacts has used the new 24 hour status. And I really miss being able to go through my favourites and contacts?? Why on earth would you get rid of these lists??", "rating": "1", "version": "2.17.7", "date": "2017-03-01T02:18:00-07:00", "title": "Snapchat. Apparently."}, {"content": "Needs a few things updating because it's too slow at loading at sending/ downloading media", "rating": "3", "version": "2.17.7", "date": "2017-03-01T01:55:00-07:00", "title": "Not bad"}, {"content": "Loved this app, works on wifi & great for sending pics however the update has ruined it for me.\nI really liked the statuses, leaving my own & reading others but now it's like Snapchat & no one is using it so it's just blank! :( boo! Please add option to just write a status like before :) then I can 5 star it again.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T01:53:00-07:00", "title": "Great App BUT...."}, {"content": "Not too sure about the new 'status update'. No one uses. But the main menu bar is messed up now. No more favourites? Have to manually search or scroll through contacts to send a message. Why is camara on the main menu no need. New update was a step back in my opinion.", "rating": "2", "version": "2.17.7", "date": "2017-03-01T01:07:00-07:00", "title": "PLEASE BRING BACK FAVOURITES"}, {"content": "The app was perfectly fine the way it was. I hate this upgrade, the stupid thing doesn't even give you the option the use text/emoji only without a gif or a photo when updating your Status. I don't want to have to update my status every 24 hours. WhatsApp developers you get 👎🏼👎🏼👎🏼. I want my favourites back, put it back the way it was!!!", "rating": "2", "version": "2.17.7", "date": "2017-03-01T00:52:00-07:00", "title": "Why The Change, Utterly Disappointed"}, {"content": "What did you do. Put the update back. Terrible. You have broken it 😳", "rating": "1", "version": "2.17.7", "date": "2017-03-01T00:48:00-07:00", "title": "Noooooooooo"}, {"content": "DISAPPOINTED!! Favourites gone, contacts gone!! Ridiculous simplicity is KEY!!!! Get rid of this unwanted version!!!", "rating": "1", "version": "2.17.7", "date": "2017-03-01T00:45:00-07:00", "title": "AWFUL!!!!!!!!!!!"}, {"content": "The current updated version I'm using now is the worst among all I've used so far. I wanted to give no star but there is no option .😡😡😡😡😡", "rating": "1", "version": "2.17.7", "date": "2017-03-01T00:37:00-07:00", "title": "Worst version"}, {"content": "The story option was silly! Copying snap chat. You got rid of the contacts section so you can't even scroll through your contacts b4 selecting which person you want to talk to, have to go to start new chat every time I want to continue a conversation with someone or have to scroll through ALL My conversations just to find them! Bring back the contact section!! 🙄😒", "rating": "1", "version": "2.17.7", "date": "2017-03-01T00:27:00-07:00", "title": "HATE IT!"}, {"content": "This was a good chat app. Now it looks like i have two SNAPCHAT apps on my phone. Terrible update, removed text status updates (including statuses that had a sentimental value) which was one of the cool features for those who used it, added a camera button (what is that for? Confusing users?) which is pointless since i have a camera app on my phone already, remove the contact list icon (seriously?! No comment.), added the option of adding a status that expires daily (who has got time for that?! What am i, 12 years old?!). I really hope you are reverting back to the previous version very soon. Otherwise i might as well just uninstall it and keep the fb messenger app.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T00:09:00-07:00", "title": "February 2017 update - absolutely terrible"}, {"content": "Why fix something that's not broken.", "rating": "1", "version": "2.17.7", "date": "2017-03-01T00:00:00-07:00", "title": "Hate the update."}, {"content": "Cannot even see my contact list .. instead I see some option to ' post picture status ' , clearly some knock off version of Snapchat..\n\nAt least offer users the option of accepting these BS updates.. I seriously wonder what idiot actually thought this would be a good idea.. ' lets make users not be able to view their contact list anymore, they will love that '.\n\nI would give this no stars if I could.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T23:18:00-07:00", "title": "Terrible"}, {"content": "What have you done to whatsapp with this new update so unnecessary. Please this update to the status is not needed revert back to what it used to be 😡😡😡😡", "rating": "1", "version": "2.17.7", "date": "2017-02-28T23:09:00-07:00", "title": "Awful and so not needed"}, {"content": "Worse ever update more like downgrade. So disappointed, trying to restore my phone so now I can get the old app back hopefully or I may have to resort to texting as this new app is just absolutely crap", "rating": "1", "version": "2.17.7", "date": "2017-02-28T22:53:00-07:00", "title": "Worse ever update more like downgrade"}, {"content": "Goodbye copycats.. Ruined the best user friendly app. (Spoiler alert... Next update we are changing its name from whatsapp to Whatscrap) cheers", "rating": "1", "version": "2.17.7", "date": "2017-02-28T22:22:00-07:00", "title": "WHATCRAP"}, {"content": "I was so excited when I saw an update. I thought you took on board customer feedback and got rid of the awful mess you made but seems like you only wanted to clear the bad reviews. \nShame on you Whatsapp. You don't listen to your customers, and you've tried to hide the truth by clearing all the feedback.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T22:16:00-07:00", "title": "YOU WANTED TO REMOVE THE BAD REVIEWS."}, {"content": "New update is crap it's what's app not snap chat 🙄", "rating": "1", "version": "2.17.7", "date": "2017-02-28T21:47:00-07:00", "title": "Shocking"}, {"content": "If I wanted snap chat I would down load snap chat.. ruined Wats app you lot have with this latest update. Back to imessenger for me as the reasons I used Wats app have now been removed so don't see the point having it.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T21:08:00-07:00", "title": "Now hate this app"}, {"content": "Status ❤️", "rating": "5", "version": "2.17.7", "date": "2017-02-28T20:37:00-07:00", "title": "Great app"}, {"content": "Dont try to copy snapchat still love the old status", "rating": "1", "version": "2.17.7", "date": "2017-02-28T19:20:00-07:00", "title": "Bring Back The Old Status"}, {"content": "Why why why.. did you have to change it? It was perfectly fine the way it was. Now you have to click on write new message just to see contacts. And check peoples display pictures.. the updates sections is horrendous. This is not snapchat. We liked just being able to see our list of contacts with there picture and there status below.. i literally hate this new update.. cant even update a status for everyone to see (people not in contact list) cant access profile pictures without tappin write message.. we don't want our status to be a picture all the time... or time restricted..  whatsapp was great for its simplicity and convenience now its just a messy Snapchat clone but worse.. i barley even use it now.. HATE HATE HATE HATE.. PLEASE REVERT BACK TO ORIGINAL. Or at least give us an option to revert back to original. I am speakin for many here not just myself. Not a single person i know likes it. Im on the verge of deleting it. All the fun it been taking away!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T18:06:00-07:00", "title": "HATE THIS UPDATE!"}, {"content": "Its the Best Masseging App I have ever Seen . No doubt About This", "rating": "5", "version": "2.17.7", "date": "2017-02-28T17:46:00-07:00", "title": "Fahedzz"}, {"content": "Has lost all its originality! Hate it. Wish I didn't update", "rating": "1", "version": "2.17.7", "date": "2017-02-28T16:44:00-07:00", "title": "FIX IT!"}, {"content": "Why o why have you moved the camera to the middle in replace of contacts why are you trying so hard to be like Instagram and snapchat, people love this app to communicate via typing not pictures or 24 hour stories please go back to doing what you do best.\n\nThis went from the best app in the world to the most annoying.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T16:38:00-07:00", "title": "Camera option in the wrong place!"}, {"content": "Love it", "rating": "5", "version": "2.17.7", "date": "2017-02-28T15:45:00-07:00", "title": "Still Amazing!"}, {"content": "\"Bug fixes\" to hide the increasingly bad reviews for the status story failure. Don't be romantic about it, just use this feedback to go back. No shame in it.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T15:32:00-07:00", "title": "Should be no star."}, {"content": "bring back favourites", "rating": "1", "version": "2.17.7", "date": "2017-02-28T14:58:00-07:00", "title": "you had to change it complete rubbish now"}, {"content": "I would like the contacts favourites option back instead of the status option.", "rating": "3", "version": "2.17.7", "date": "2017-02-28T14:57:00-07:00", "title": "WhatsApp"}, {"content": "Which media lovey decided to alter a much preferred system, favourites and updates were integral to the app which provided everything without the clutter.  This really is piss poor work, change it back and listen to your users for once.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T14:51:00-07:00", "title": "⭐️⭐️⭐️⭐️⭐️ Fail"}, {"content": "No problems", "rating": "5", "version": "2.17.7", "date": "2017-02-28T14:49:00-07:00", "title": "Perfect"}, {"content": "Like so many on here I've been using WhatsApp for years and this is by far the most stupid and pointless update I've ever seen for any app in the iTunes library let alone this one! Who could possibly think that this update would be popular? I wonder, after reading the reviews, the person that thought of this rubbish is now looking for a new job? Bring back the old version I want WhatsApp not another Facebook!!! And now whatsapp has put a pointless update to remove the thousand or so poor reviews. It won't work people will just send the same review again until it changes. I know I will.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T14:48:00-07:00", "title": "Why?"}, {"content": "I liked my favourites in one place. It's all over the place! Sort it out guys!!!! The new update is the same! We use what's app and if we don't like it why keep that feature?", "rating": "1", "version": "2.17.7", "date": "2017-02-28T14:13:00-07:00", "title": "Get rid of that status!!!"}, {"content": "Awful update. No longer a messaging app, now a social media app. Hate the status update feature and hate that you can no longer scroll through your contacts and view their status updates and their profile pictures. Go back to the original.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T14:04:00-07:00", "title": "Hate it"}, {"content": "Should have left it the way it is, I hate it", "rating": "1", "version": "2.17.7", "date": "2017-02-28T14:00:00-07:00", "title": "Rubbish"}, {"content": "And here we go again\nYet another bug fix?\nOn an app that seems ok?\nBish bash bosh off goes another star", "rating": "1", "version": "2.17.7", "date": "2017-02-28T13:52:00-07:00", "title": "Money saving app, but why so many releases?"}, {"content": "HATEEEEE the new status hate hate hate put it back how it was!!!!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T13:44:00-07:00", "title": "Mica"}, {"content": "Why try fix something that isn't broke old one was fine new one is bad !!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T13:38:00-07:00", "title": "Crap"}, {"content": "Used the app for years but the recent update does not show 'favourite' contacts and instead shows a status icon. This makes it longer to send messages. Thinking about deleting and texting again. Such a shame! 😕", "rating": "1", "version": "2.17.7", "date": "2017-02-28T13:30:00-07:00", "title": "Lauren"}, {"content": "Very good", "rating": "5", "version": "2.17.7", "date": "2017-02-28T13:23:00-07:00", "title": "So fast"}, {"content": "I dont like this new whatsapp update, stories are not needed and I can't see my contacts. I hate it really hate it.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T13:09:00-07:00", "title": "Bad"}, {"content": "After today's update, I get notifications only occasionally.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T12:54:00-07:00", "title": "Notifications"}, {"content": "Don't like this update. Let snapchat be snapchat, WhatsApp be WhatsApp. Fine how it was, chill on this bait ishhhhh 😒", "rating": "1", "version": "2.17.7", "date": "2017-02-28T12:50:00-07:00", "title": "WhatsApp update"}, {"content": "I'm quiet annoyed that WhatsApp has removed all my status's that I previously had then just did an update with video status couldn't you give me some notice? WhatsApp is becoming like snapchats ? Why ? We should still have status quotes available to write if you want to keep the video feature fine but I want the writing your status back please !!!!", "rating": "2", "version": "2.17.7", "date": "2017-02-28T12:45:00-07:00", "title": "I am that person"}, {"content": "Why are you copying snapchat? This is a totally different app and copying them will not help you. Please revert to the previous release. You're just looking desperate now!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T12:37:00-07:00", "title": "SnapChat clone"}, {"content": "Guys, what were you thinking. Now do the right thing and give us back the favourites tab.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T11:59:00-07:00", "title": "Bring back favourites tab"}, {"content": "The new \"status\" update is complete rubbish and useless. None of the 200 contacts I have even use it, furthermore I want my contacts button back and camera button removed. It's a messaging app, not snapchat.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T11:54:00-07:00", "title": "Rubbish update"}, {"content": "There is no tab for contacts so have to search for them manually. Has been replaced with status tab", "rating": "2", "version": "2.17.7", "date": "2017-02-28T11:50:00-07:00", "title": "Contacts gone."}, {"content": "So far each update has been worse than the last! What's the point in having stories like snapchat? There is no use in having two apps that do the same✋🏼 bring back normal statuses that have a timestamp on how long it was since they were updated", "rating": "1", "version": "2.17.7", "date": "2017-02-28T11:45:00-07:00", "title": "Each update gets worse"}, {"content": "Really great! Helps me keep in contact with my friends if we are doing a group project because otherwise i have to message them individually and it takes FOREVER!!!!", "rating": "5", "version": "2.17.7", "date": "2017-02-28T11:38:00-07:00", "title": "👍🏻👍🏻👍🏻👍🏻👍🏻"}, {"content": "Totally annoying app. Worst part is all the media downloads to my phone no matter what settings I have.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T11:37:00-07:00", "title": "Wish I did not have to use this for work"}, {"content": "Since the update I have no idea which of my friends have what's app as I can't see my list of friends anymore in favourites", "rating": "1", "version": "2.17.7", "date": "2017-02-28T11:31:00-07:00", "title": "Contacts"}, {"content": "I hate the new layout. This isn't Facebook, no one cares about status. Bring back the old Whatsapp", "rating": "1", "version": "2.17.7", "date": "2017-02-28T11:16:00-07:00", "title": "Terrible"}, {"content": "Why did you guys remove the ability to have a permanent status? \n\nWhy can't I view my contacts easily? \n\nDid you guys conduct usability testing before releasing this new update/build? \n\nI'm not impressed to be honest. Please can you revert back to the old build and stop trying to compete with snapchat and instagram. What'sapp was great the way it was. \n\nThanks", "rating": "1", "version": "2.17.7", "date": "2017-02-28T10:53:00-07:00", "title": "Status/contacts"}, {"content": "Don't like the update! No need to make it like snap chat! Ruined a perfectly good app!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T10:20:00-07:00", "title": "Rubbish update"}, {"content": "I don't and haven't topped up my phone scince I have got it because whatsapp", "rating": "5", "version": "2.17.7", "date": "2017-02-28T10:05:00-07:00", "title": "Very good"}, {"content": "What's with this new 24 hour picture status? It's the worst update to this app.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T10:01:00-07:00", "title": "The latest update - Unimpressive -__-"}, {"content": "Amazing app!\nI love too call and text on it. Just I hate that when u only have internet I will not work:(", "rating": "4", "version": "2.17.7", "date": "2017-02-28T09:57:00-07:00", "title": "Great!"}, {"content": "Can't see my contacts after update in WhatsApp", "rating": "1", "version": "2.17.7", "date": "2017-02-28T09:53:00-07:00", "title": "Not good after the update"}, {"content": "All in all fabulous experience with this app but this time new updates got some problem like error in chat and smtyms message cnt reach same time.", "rating": "3", "version": "2.17.7", "date": "2017-02-28T09:27:00-07:00", "title": "Great app"}, {"content": "You still haven't put the update back to the way it was before. We use it to text people not for social media. Bring back the favourites and the normal status! I just updated it again basically for NO reason! Tempted to delete the app altogether!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T09:24:00-07:00", "title": "RUBBISH UPDATE 😡"}, {"content": "I don't like the status up date part I liked it when you could see everyone pic n status there in ya favourites! Now you've got a stupid status update thing n no quick access to ya favorites.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T08:59:00-07:00", "title": "New version Feb 2017"}, {"content": "So comfortable using whatsapp 😎😎", "rating": "5", "version": "2.17.7", "date": "2017-02-28T08:34:00-07:00", "title": "Amazing whatsapp"}, {"content": "We can download snapchat and Instagram for that. Stop trying to be the same and just stick to what the app is meant to be used for. Keep it simple for everyone.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T08:14:00-07:00", "title": "Take off the whatsapp stories"}, {"content": "In your desperate attempt to rip off snapchat you've basically ruined the app, i will using be Snapchat from now on just to spite you. Good day", "rating": "1", "version": "2.17.7", "date": "2017-02-28T07:53:00-07:00", "title": "Uninstalling"}, {"content": "It has made my phone reset itself at least 3 or 4 times. Sort it out please.", "rating": "2", "version": "2.17.7", "date": "2017-02-28T07:50:00-07:00", "title": "Still needs improvement"}, {"content": "The new update is horrendous and I've noticed that whatsapp has removed all of the negative reviews 🤔😏 yesterday's negative reviews were well over 1,000. Now they're only at 33 🤔😏\n\nI'm not sure why whatsapp have made these ridiculous changes. Whatsapp was great for sending basic messages and phoning friends/family whilst abroad and also back home\n\nNow it's becoming another stupid social media outlet which we do not need. \n\nPlease change it back to the original set up where we can see our contacts/favourites and our typed status' not these ridiculous videos or gifs which we now must use \n\nI absolutely hate this update and I really suggest whatsapp reverts back to the original version otherwise everyone will be looking for an alternative message app like viber etc", "rating": "1", "version": "2.17.7", "date": "2017-02-28T07:48:00-07:00", "title": "The New Update is Truly Horredous"}, {"content": "Feb 28th update. Same old \"bug fixes\". Didn't go back to before the big change to Snapchatville. Stuck mainly to texting recently. Sick of having to Scour my way though contacts to find people. Still no contacts area that are easy to find and send messages to.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T07:47:00-07:00", "title": "No change..."}, {"content": "What a load of crap. \n\nWhere is the ease of use gone with this app?\n\nBring back old layout. Remove status and bring back favourites!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T07:43:00-07:00", "title": "New changes to Whatsapp!!"}, {"content": "Removed the favourites, so now you cant search for contacts and new contacts they you may have added - the latest update is terrible", "rating": "1", "version": "2.17.7", "date": "2017-02-28T07:33:00-07:00", "title": "Removed favourites..."}, {"content": "I hate this new whatsapp update like snapchat it's so crap why can't they just keep whatsapp how it is seriously please just change it back!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T06:29:00-07:00", "title": "Miss"}, {"content": "Instead of working to make WhatsApp better at being WhatsApp, you are copying ideas from other companies and tacking them on.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T06:14:00-07:00", "title": "Pointless update"}, {"content": "What have you done????!!!!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T06:04:00-07:00", "title": "Ruined!"}, {"content": "The new update is terrible. Stop trying to change the type of platform WhatsApp is, it was fine as it were.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T06:02:00-07:00", "title": "NEW UPDATE IS TERRIBLE"}, {"content": "Wheres contacts for the iPhone update gone?", "rating": "2", "version": "2.17.7", "date": "2017-02-28T05:32:00-07:00", "title": "Contacts"}, {"content": "I love that you can send messages when you have no internet connection then it sends automatically when you do.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T05:16:00-07:00", "title": "I hate that you cannot update a status without a photo"}, {"content": "Who came up this update? Awful. I don't need another snapchat type camera, I've got snapchat, messenger, instagram, Facebook. They're all the same. Where's the contacts page gone? Another developer thinking they're cool, fresh and new but going in completely the wrong direction", "rating": "1", "version": "2.17.7", "date": "2017-02-28T04:56:00-07:00", "title": "Awful update"}, {"content": "Utterly utterly useless and rubbish update very disappointed", "rating": "1", "version": "2.17.7", "date": "2017-02-28T04:39:00-07:00", "title": "Whats app has gone bonkers"}, {"content": "I will unfortunately be deleting this app it no longer does what it was made to do. It's no longer a simple design for everyday use. We loved WhatsApp for being simple and not doing all these stupid live things and within a few months whatsapp has killed itself off by doing such a thing I miss my old statues and my contract list which helped me more then these stupid status. Be like apple be simple", "rating": "1", "version": "2.17.7", "date": "2017-02-28T04:25:00-07:00", "title": "Status"}, {"content": "why compete with snapchat or instagram? this is a messenger, and it should stay as one!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T04:22:00-07:00", "title": "#MAKESNAPCHATGREATAGAIN"}, {"content": "Latest update is totally pointless and just \"me too\" copying of other Apps. Don't need this!!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T04:05:00-07:00", "title": "If I wanted Snapchat I'd use Snapchat"}, {"content": "I've been using whatsapp for so long! This version has been the worst! If I want to see people's life story I'd do it via other social media not whatsapp! Please get back the previous version!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T04:05:00-07:00", "title": "Prefer old version"}, {"content": "Why remove the favourites button along the tool bar??? You can now only view an individual profile if you go into create a new message and once you have viewed it you then have to start the whole process again!!!! Also why remove an individual status.. now you can only create a status that lasts 24 hours... what's app is NOT snap chat!!! Why is there a camera on the tool bar??? There is one within status update and another when you create a message!!! Bring back the favourites button and individual status!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T03:43:00-07:00", "title": "Bring back favourites button... I wish I had never updated the app..."}, {"content": "I hate this new update. Why would anyone need stories on whatsapp? The new layout is a pile of crap. Is there any way I can revert to a previous version of the app?", "rating": "1", "version": "2.17.7", "date": "2017-02-28T03:40:00-07:00", "title": "Please revert to the old style"}, {"content": "Badly needs a watch app, notifications are inconsistent, would make it much more useful.", "rating": "4", "version": "2.17.7", "date": "2017-02-28T03:33:00-07:00", "title": "Not bad but missing watch app"}, {"content": "Viber, WeChat and Facebook Messenger all have native iPad and Apple Watch clients. Don't use WhatsApp, support their more customer friendly competitors instead. \n\nEvery version which gets released without Apple Watch integration will get 1 star from me. Hopefully they will actually listen to what people want one day", "rating": "1", "version": "2.17.7", "date": "2017-02-28T03:20:00-07:00", "title": "Still no Apple Watch integration"}, {"content": "Can't think of another app with similar features better than this.", "rating": "5", "version": "2.17.7", "date": "2017-02-28T02:41:00-07:00", "title": "Excellent"}, {"content": "I can't see my contacts and I do not enjoy this new update. I would like see my contacts!!!!! Can you bring that feature back please.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T02:37:00-07:00", "title": "The new update"}, {"content": "Why did Whatsapp turn what was one of the best and simplest messaging apps into a copied version of Snapchat?? Not everyone wants to post posy photos everyday. Where has the contact and favourites list gone too? This has totally ruined the app! I can no longer see people status updates, just a blank page now as no one is using this 24 hour snapchat style status thing they've implemented. I can't search my contacts now to message people, what's the point of an app if I can't see who's on it!? Also, all of the reviews on here have conveniently disappeared! I noticed a ton of people in uproar about the new update this week only to have all their reviews deleted.\nI'll be using other apps to message if whatsapp don't sort this out. What a disaster!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T02:37:00-07:00", "title": "Awful New Update :("}, {"content": "I use WhatsApp for group chat with friends.", "rating": "4", "version": "2.17.7", "date": "2017-02-28T02:32:00-07:00", "title": "A really helpful app!"}, {"content": "Good job Facebook, you changed WhatsApp from a simple messaging platform everyone loved, to snapchat. Favourites and contacts have been replaced by status and camera... if I wanted that I would use snapchat.. Guess it's time to delete WhatsApp and find somewhere new.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T02:31:00-07:00", "title": "WhatsApp turned into snapchat."}, {"content": "I DO NOT want a Facebook clone. I DO NOT want social media. I just wish to communicate with selected groups of close friends. This update is AWFUL, AWFUL, AWFUL!\n\nThe latest fix gave you an opportunity to do what your users wanted but you were obviously too proud to do that.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T02:22:00-07:00", "title": "Was great. Now it's worse than awful"}, {"content": "Can't believe you have simply ignored all the (bad) reviews your revamp has had. Was hopeful when I saw this update that you'd seen sense, clearly not and your paying customers and users are to be completely ignored", "rating": "1", "version": "2.17.7", "date": "2017-02-28T01:56:00-07:00", "title": "Crap - and you ignore your customer reviews"}, {"content": "A perfect example of over updating something. Clearly the app team is running out of ideas. Relying on copying other popular apps. Would be wise to listen to the users before they hop to Telegram.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T01:54:00-07:00", "title": "O Boy."}, {"content": "Don't really like the new update and the new function of status updates. Was better before", "rating": "3", "version": "2.17.7", "date": "2017-02-28T01:43:00-07:00", "title": "Status"}, {"content": "The new update is not bad at all except the fact that I can't see who views my status? Why is that? Some of my friends can see who viewed their snaps but I can't. Please fix this issue.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T01:04:00-07:00", "title": "Can't see my views on new update"}, {"content": "Still cannot make full use of it as there is no iPad version.", "rating": "2", "version": "2.17.7", "date": "2017-02-28T01:01:00-07:00", "title": "iPad"}, {"content": "JUST REMOVE THE BLOODY STORY STATUS THING AND GIVE US BACK OUR FAVOURITES!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T00:56:00-07:00", "title": "WHAT THE HELL WHATSAPP"}, {"content": "What a terrible update WhatsApp. Please revert and save your app.", "rating": "1", "version": "2.17.7", "date": "2017-02-28T00:54:00-07:00", "title": "Absolutely awful"}, {"content": "Don't bother updating it, I've been trying all morning and it's failing to complete so now I can't use whatsapp anymore, can't delete the app either. \n\nWait a while til they have sorted out the bugs!!", "rating": "1", "version": "2.17.7", "date": "2017-02-28T00:43:00-07:00", "title": "Failing to install/update"}, {"content": "Great app just makes getting in touch so easy and easy for me. Highly recommended", "rating": "5", "version": "2.17.7", "date": "2017-02-28T00:24:00-07:00", "title": "WhatsApp"}, {"content": "We don't need another Snapchat nobody wants to be uploading a story / status that goes after 24hrs. Nobody has time for any of that\n\nIf we want to be uploading stories that go after 24hr we use Snapchat. Why do apps like this think to copy apps like Snapchat yes they're popular but nobody wants two of the same thing!! Its useless \n\nAnd updating it to get rid of all the bad reviews isn't gonna work. People will keep leaving bad reviews until they are happy And right now 90% of whatapp users aren't happy with this new update. You went from 100 to 0 real quick 😂😂👎🏻👎🏻👎🏻👎🏻👎🏻", "rating": "1", "version": "2.17.7", "date": "2017-02-28T00:20:00-07:00", "title": "Get rid of story!"}, {"content": "Another flop from whatsapp. I thought its going to bring contacts etc back but it seems that the only point of this update was to remove all the negative comments and bad rating....", "rating": "1", "version": "2.17.7", "date": "2017-02-28T00:06:00-07:00", "title": "Pointless update"}, {"content": "Its A Really Good App But I Can't Video Chat On Its Which Is Annoying And You Need Wifi Its Good But A Tiny Bit Annoying", "rating": "4", "version": "2.17.7", "date": "2017-02-28T00:03:00-07:00", "title": "Good"}, {"content": "Hate the new update. The contact tab is now been removed and replaced with status page", "rating": "1", "version": "2.17.7", "date": "2017-02-28T00:03:00-07:00", "title": "Contacts page disappeared"}, {"content": "Love the app and have been using it for pass 5 years. But please could you take this snapchat copy thing off it is so not cool.", "rating": "3", "version": "2.17.7", "date": "2017-02-28T00:01:00-07:00", "title": "Please take this story thing out"}, {"content": "WHOEVER CAME UP WITH THIS RUBBISH IDEA OF ADDING THIS NEW STUPID POINTLESS FEATURE SHOULD BE FIRED. MADE ME WANT TO DELETE WHATSAPP. NOT HAPPY. BRING BACK OLD WHATSAPP, WE DO NOT NEED ANOTHER APP TRYING TO IMITATE INSTAGRAM OR SNAPCHAT. WHATSAPP WAS MADE FOR MESSAGING AND CALLS NOT THIS FOOLISHNESS.", "rating": "1", "version": "2.17.7", "date": "2017-02-27T23:55:00-07:00", "title": "HATE THIS NEW VERSION WHATSAPP WHAT IN THE WORLD WAS YOU THINKING"}, {"content": "The New Whats app is rubbish! I do not like that lame Status business at all! What did they do to it?! Why change it? Trying to make it like Snapchat thats a whole different app. Now I don't have a favourites section I have to keep going in looking for contacts its so long like that. And should go back to how it was!!! 👎🏻", "rating": "2", "version": "2.17.7", "date": "2017-02-27T23:46:00-07:00", "title": "Rubbish!"}, {"content": "Whatsapp was perfect now they have gone backwards...it's for texting but you can't even find contacts in the app to open a chat...new version is terrible and annoying...new status feature is pointless it's not instagram or Snapchat that's what made it different...utter joke!", "rating": "1", "version": "2.17.7", "date": "2017-02-27T23:42:00-07:00", "title": "Nonsense"}, {"content": "Absolute RUBBISH!!!!", "rating": "1", "version": "2.17.7", "date": "2017-02-27T23:39:00-07:00", "title": "Whatsaap new update"}, {"content": "This new version is shocking! Why replace the contacts tab? Please fix this and bring it back!", "rating": "1", "version": "2.17.7", "date": "2017-02-27T23:24:00-07:00", "title": "Why!?!"}, {"content": "There's nothing special, it's a messaging app.", "rating": "1", "version": "2.17.7", "date": "2017-02-27T23:02:00-07:00", "title": "It's a message app"}, {"content": "Why did you remove favourites", "rating": "2", "version": "2.17.7", "date": "2017-02-27T22:31:00-07:00", "title": "Favourites"}, {"content": "Was my favourite app but the update ruined everything. I don't want no snapchat copy catting, this is a messaging app not a social media one. The app was perfectly fine on how it was. If it ain't broke don't try fix it. Bring back to how it was! And fire whoever came up with this stupid idea 🙄", "rating": "1", "version": "2.17.7", "date": "2017-02-27T21:39:00-07:00", "title": "New update completely ruined the app 👎🏽"}, {"content": "Now I can't go to my contacts list any more and don't have a status!!! Why copying insta and snap for?!", "rating": "2", "version": "2.17.7", "date": "2017-02-27T21:34:00-07:00", "title": "Story ??wtf!!"}, {"content": "Horrible , hate the new wass app so muchhh !! Was considering deleting the add off now!! 😡 I liked sharing & seeing people's status not picture status 😡\nBring back the old wass app!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T17:22:00-07:00", "title": "New wass app - horrible , rubbish"}, {"content": "You should improve your story please", "rating": "4", "version": "2.17.5", "date": "2017-02-27T17:16:00-07:00", "title": "Mr"}, {"content": "The latest update takes away all you contacts for you to see. The update status is now removed after 24 hours. It was broke so why try to fix it? Absolutely useless update", "rating": "1", "version": "2.17.5", "date": "2017-02-27T16:41:00-07:00", "title": "Latest update is rubbish!"}, {"content": "Awful, a cross between messenger/instagram and Snapchat that should have been aborted", "rating": "1", "version": "2.17.5", "date": "2017-02-27T16:00:00-07:00", "title": "New update"}, {"content": "It was better before 😤", "rating": "1", "version": "2.17.5", "date": "2017-02-27T14:58:00-07:00", "title": "It's more Snapchat than whatsapp now 😂😂"}, {"content": "They've ruined it! It was so simple and easy to use. Now it's just a boring social media app.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T14:57:00-07:00", "title": "Why?"}, {"content": "Where has the contact list gone? Please bring it back or I will be deleting this app, which used to be very good until all these changes. Not impressed at all", "rating": "2", "version": "2.17.5", "date": "2017-02-27T14:47:00-07:00", "title": "Not happy"}, {"content": "I absolutely hate the new update of having stories on your status similar to snapchat it kills the whole vibe of watsapp and I despise it . I really don't enjoy using the app anymore as before it was great for formally communicating as well as nice and simple now it's just a whole lot of crap. It's like everything is based around social media etc. NOT HAPPY AT ALL CHANGE IF BACK PLZ!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T14:02:00-07:00", "title": "Hate new snapchat status update"}, {"content": "I seriously HATE the new update. I just want to put up my normal written status. Not all this other crap. This new update has made me so sad 😔. I'm just going to tell everyone to add me on snapchat, or text me. This is ridiculous.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T13:55:00-07:00", "title": "Disgusting, disappointed."}, {"content": "Not a fan of this status snapchat copy thing! Should allow the word status to be there too! Bring back contacts list please, the older version was much preferred!", "rating": "2", "version": "2.17.5", "date": "2017-02-27T13:36:00-07:00", "title": "Not so good"}, {"content": "Why have whatsapp changed the features I liked it as it was! Not impressed 😒", "rating": "1", "version": "2.17.5", "date": "2017-02-27T12:50:00-07:00", "title": "Why the strange features"}, {"content": "I dislike the new update very much, it seems to me like you are trying to be like snapchat. There is no point no one will use it like snapchat. WhatsApp is for texting and calling. I do not like it one bit. Please put it back to the old style.\n\nThanks", "rating": "1", "version": "2.17.5", "date": "2017-02-27T12:46:00-07:00", "title": "Absolutely useless"}, {"content": "Bring back the favourites tab as this was a key concept of the easy navigating, it is much harder for people to use whatsapp now, no one uses the status/stories function that you have added, keep it or delete it but bring back our features that we users for over years have known and loved and there is absolutely no need for a camera tab, which needs to be replaced by the favourites !!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T12:32:00-07:00", "title": "WhatsApp is ruined after new update! Bring back favourites"}, {"content": "We need dates people!! \nTimes!! Seconds!! Nowww!!!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T12:30:00-07:00", "title": "When is the old WhatsApp coming back"}, {"content": "If you are going to do the whole stories thing, learn from your predecessors. Let us set a timer for how long the message will appear. Next, don't roll through the statuses. Snapchat tried that and nobody liked it so they went back to the way it was before. You should do that too. Also, I want my contacts tab back so if I need to start a conversation with a new contact, it is easy to locate them. I liked that. How are we supposed to lurk and look at people's display pictures? Smh.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T12:09:00-07:00", "title": "Status update🙄"}, {"content": "Hey whatsapp stay in your lane! We have Snapchat, Instagram copied them and technically so has Facebook!! I don't need to add a story to my WhatsApp, it's not necessary. Why can't I get to my favourites anymore? I have to search for them now!?!? Really.. can u please fix this. The update is the worst one yet. I don't leave reviews on apps but I use this daily and only update (by accident) yesterday.. the worst mistake in a while.\n\nWhatsApp heed your users feedback and get rid of these features or lose users.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T11:52:00-07:00", "title": "Zero stars for new WhatsApp"}, {"content": "You developers NEVER listen!! A load of rubbish. Was the latest release developed by blind 5 year olds with no hands?", "rating": "1", "version": "2.17.5", "date": "2017-02-27T11:45:00-07:00", "title": "Complete junk"}, {"content": "Please get us back old version with status as it was before this new version is a joke if there is no way going back to old version than is best to stop using whats app there is other apps they do same job.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T11:42:00-07:00", "title": "New whats app is a joke"}, {"content": "Snapchat is not the app I downloaded. I loved the simplicity of the normal messenger app, what are these crap features they keep adding????", "rating": "1", "version": "2.17.5", "date": "2017-02-27T11:34:00-07:00", "title": "Terrible update"}, {"content": "Terrible update!! There was no need for the change to the Status  icon. It also keeps crashing a lot now!! Very very disappointing", "rating": "1", "version": "2.17.5", "date": "2017-02-27T11:21:00-07:00", "title": "Latest update!!!"}, {"content": "The new update is awful. Please bring back contacts icon at least.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T10:49:00-07:00", "title": "Terrible new update"}, {"content": "Po ostatniej aktualizacji tragedia brak dostępu do kontaktów bardzo irytująca obsługa. Krzysztof", "rating": "1", "version": "2.17.5", "date": "2017-02-27T10:36:00-07:00", "title": "🙁🙁👎👎👎👎😤😤"}, {"content": "It's shite don't download this app. The new update will ruin your life", "rating": "1", "version": "2.17.5", "date": "2017-02-27T10:33:00-07:00", "title": "Absolutely terrible"}, {"content": "This has to be the worst update WhatsApp has ever done.... If they don't revert it back to how it was then I'm afraid I'll be deleting it....", "rating": "1", "version": "2.17.5", "date": "2017-02-27T10:23:00-07:00", "title": "Avoid this update"}, {"content": "Come on guys this update is a joke. Where are my contacts? Do I even have contacts!? Why is everyone trying to be snapchat!? Yall need to stop playing and put this app back to normal. I knew when Fb bought whatsapp it was bad news. Stop trying to be snapchat Facebook!!\n\nI'm deleting whatsapp... let me know when it's back to normal cheers\nFormer loyal whatsapp user", "rating": "1", "version": "2.17.5", "date": "2017-02-27T10:07:00-07:00", "title": "I'm absolutely fuming at this update!"}, {"content": "Do not really want to use another Snapchat like app!!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T10:03:00-07:00", "title": "HATE UPDATE"}, {"content": "Please change back to old whatsapp", "rating": "1", "version": "2.17.5", "date": "2017-02-27T09:48:00-07:00", "title": "Pleasw change back"}, {"content": "Worst update EVER!! 😡 \n\nEveryone hates the new update, change it back to how it was before everyone deletes this and moves on to something else.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T09:44:00-07:00", "title": "WhatsApp is officially DEAD!"}, {"content": "Just perfect!!", "rating": "5", "version": "2.17.5", "date": "2017-02-27T08:41:00-07:00", "title": "Brilliant"}, {"content": "Doesn't work properly, it's fine that you took creative license in basically stealing snap chat and added it to your platform. But if your gonna do it please be successful at it!!! \nIt doesn't work, can't see my views or edit properly. Meh!", "rating": "2", "version": "2.17.5", "date": "2017-02-27T08:12:00-07:00", "title": "New update is weird"}, {"content": "February update is not good! Bring back the old whatsapp and allow Snapchat to have its niche!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T08:03:00-07:00", "title": "Bring back the old whatsapp"}, {"content": "What a wonderful creation I am able to connect with my friends for free of change there are not many things free these day 📱", "rating": "5", "version": "2.17.5", "date": "2017-02-27T07:46:00-07:00", "title": "WhatsApp"}, {"content": "Latest update is crap not happy at all any idea how to remove this update???😒😒", "rating": "1", "version": "2.17.5", "date": "2017-02-27T07:39:00-07:00", "title": "Update is crap"}, {"content": "I hate the new update. Absolutely hate it. Stop trying to be like snap chat and Instagram.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T06:46:00-07:00", "title": "WHY CANT I SEE WHEN SOMEONE LAST UPDATED THEIR STATUS ON WHATSAPP."}, {"content": "Sooo not liking the new whatsapp update wish I hadn't done it now 😡 it's removed all the statuss ??", "rating": "1", "version": "2.17.5", "date": "2017-02-27T06:42:00-07:00", "title": ":( not happy at all"}, {"content": "Hate the new update please bring the old one back!! It is so annoying I can't see my contacts anymore and we have enough stories on snapchat and instagram!! Please listen to this feedback and change some things. Thank you", "rating": "1", "version": "2.17.5", "date": "2017-02-27T06:42:00-07:00", "title": "I hate the new update!!!"}, {"content": "The app was very good until the new update! Horrible! Please bring back the old version!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T05:55:00-07:00", "title": "Horrible update"}, {"content": "Worst idea ever!!! \n\nChange it back", "rating": "1", "version": "2.17.5", "date": "2017-02-27T05:22:00-07:00", "title": "No favourites or contacts tab"}, {"content": "This new version is major downgrade of entire whatsapp concept.\nVery disappointed.", "rating": "1", "version": "2.17.5", "date": "2017-02-27T03:40:00-07:00", "title": "Disappointed"}, {"content": "Very helpful app for free calls and grouping with friends and family sharing message pictures", "rating": "5", "version": "2.17.5", "date": "2017-02-27T03:32:00-07:00", "title": "Mr humayon REHMAN"}, {"content": "Nothing better than this on IOS, use it everyday and the group chats are great! Plus all the chats are encrypted 👍", "rating": "5", "version": "2.17.5", "date": "2017-02-27T02:41:00-07:00", "title": "Best IM app around! 🔥"}, {"content": "The new update is absolute rubbish and we don't want it! Bring back the previous version!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T02:36:00-07:00", "title": "Whatsapp, is this a hoax?"}, {"content": "New update is rubbish prefer old layout pls fix", "rating": "1", "version": "2.17.5", "date": "2017-02-27T02:33:00-07:00", "title": "Mr"}, {"content": "I'm loving it", "rating": "5", "version": "2.17.5", "date": "2017-02-27T02:18:00-07:00", "title": "☺️"}, {"content": "This version is crap and makes me want to delete the app altogether and looking at other reviews most people feel this way aswell. So either listen to your customers who use yor service all the time or ignore them and looks their custom! If it doesn't get changed back I'll actually delete the whole app as I only liked it to be able to write little statuses and see my whole entire contact list! Now both those options have gone I have no interest in using it. Change it back PLEASE!!!!!!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T02:16:00-07:00", "title": "Bring back old version!"}, {"content": "I do not like the new update. The 24hr status change is ridiculous and pointless and I hate the fact I can no longer set a status and see other people's as before in my favourites/contact list as this has apparently disappeared. Please change it back", "rating": "1", "version": "2.17.5", "date": "2017-02-27T02:02:00-07:00", "title": "Updated version is rubbish"}, {"content": "The new update has changed Whatsapp a lot!\n\nWe can no longer have written status/mood description in our profile!\n\nPlease change it back to the way the status was before!\n\nI HATE THE NEW UPDATE!!!!", "rating": "1", "version": "2.17.5", "date": "2017-02-27T01:06:00-07:00", "title": "New Update IS AWFUL!"}, {"content": "Why has the favourites tab been removed, that was whatsapp's best feature before this dreadful new update came in and trampled all over everyone's favourite messaging service. Like most others I used it for casually chatting to friends and see a text update or profile picture change occasionally was just part of the old format which worked so well! The favourites tab should come back, if not I fear this app will have been resigned to the app graveyard by it's developers, completely unnecessarily! 😤", "rating": "1", "version": "2.17.5", "date": "2017-02-27T00:42:00-07:00", "title": "Favourites/contact list gone?!?!"}, {"content": "Plz remove status and add group calls, you can do this on Skype and Google hangouts but I don't know enough people who use that, we need group calls in whatsapp", "rating": "5", "version": "2.17.5", "date": "2017-02-27T00:04:00-07:00", "title": "Really good!! But"}, {"content": "The contact list was important part of the app. How the hell i supposed to find ppl now on WhatsApp? No one will do this stupid status every 24h!", "rating": "1", "version": "2.17.5", "date": "2017-02-26T23:43:00-07:00", "title": "Not happy with new update"}, {"content": "Good app. Better than texting", "rating": "5", "version": "2.17.5", "date": "2017-02-26T23:22:00-07:00", "title": "Good"}, {"content": "I don't like the new WhatsApp, it's very complicated and I think the older one was much better and a lot easier to use.", "rating": "1", "version": "2.17.5", "date": "2017-02-26T22:33:00-07:00", "title": "Miss"}, {"content": "i've been using whatsapp from years. i like it but that snapchat copy status story thing is really bad update.", "rating": "1", "version": "2.17.5", "date": "2017-02-26T22:23:00-07:00", "title": "didn't like the status update thing 🙁"}, {"content": "You're a messaging app (and you were a very good one) NOT social media. Stop trying to change what you're good at and get rid of the pointless new status stuff.", "rating": "1", "version": "2.17.5", "date": "2017-02-26T21:46:00-07:00", "title": "Stop it"}]}