{"data": [{"content": "App crashed the deleted itself from my iPhone 6, downloaded the game again and now won't give you the option to login\nI'm on level 32 have 5 gyms to collect on and 9 eggs to hatch also have a poke go watch that can't be used due to update\nHelp please .........\n\nAlso why have the prices increased for iPhone users and Samsung users are at a cheaper rate", "rating": "1", "version": "1.23.2", "date": "2017-01-26T11:29:00-07:00", "title": "Updates drive me crazy"}, {"content": "Music isn't working and I don't know why", "rating": "2", "version": "1.23.2", "date": "2017-01-26T09:54:00-07:00", "title": "Music"}, {"content": "Well this game is ok but it can get boring😱Also I have a Mr mime🤡🤡🤡🤡🤡🤡🤡and a ponytar 🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄🦄", "rating": "3", "version": "1.23.2", "date": "2017-01-26T08:02:00-07:00", "title": "Ummm"}, {"content": "Soooo boring bring new stuff", "rating": "1", "version": "1.23.2", "date": "2017-01-26T07:50:00-07:00", "title": "Getting boring"}, {"content": "Never had an issue with the app", "rating": "5", "version": "1.23.2", "date": "2017-01-26T07:22:00-07:00", "title": "👌🏼"}, {"content": "Gps never correct no update at all", "rating": "1", "version": "1.23.2", "date": "2017-01-26T07:05:00-07:00", "title": "Poor app"}, {"content": "After 6 months there really should be more to this game than there is. It's so bloody boring! Just the same grind day in day out.\n\nI'm just playing out of habit now. Soon that will wear off and I'll find something better to do with my time!", "rating": "2", "version": "1.23.2", "date": "2017-01-25T15:37:00-07:00", "title": "Bored"}, {"content": "It would be epic to have gen 2 added before February 👍so far, ok", "rating": "5", "version": "1.23.2", "date": "2017-01-25T12:54:00-07:00", "title": "Gen 2"}, {"content": "When you start playing this game it's great fun - there are new Pokemon all over the place, moving around is a voyage of discovery and you're constantly levelling-up. However after you've been playing the game for a while it just becomes more and more of a grind... Catching Pokemon becomes more difficult, finding new ones becomes a rarity, it takes hundreds of thousands of points to level-up, powering your Mons takes insane amounts of work and you walk miles and miles to hatch the same old things. As said elsewhere, battling in gyms seems unrewarding. Also, if you're not near a gym or a nest there is basically nothing you can do. It would be good if the game found some way to reward persistent players instead of penalising them; and it would be good if you could do something with your Pokemon that didn't require you to be in a gym.", "rating": "2", "version": "1.23.2", "date": "2017-01-25T12:21:00-07:00", "title": "Ever-diminishing returns"}, {"content": "Since the latest update my watch no longer notifies me to new pokemon or pokestops. Watch also stopped on it own so steps etc not counted", "rating": "2", "version": "1.23.2", "date": "2017-01-25T10:22:00-07:00", "title": "Watch version not working"}, {"content": "Almost a week now I haven't been able to play this game because it instantly crashes when I click the app. Doesn't matter how many times you report it no one seems to care. Haven't heard anyone who has an iPhone 6 complain only iPhone 5s users so has nothing to do with updating your iOS.", "rating": "1", "version": "1.23.2", "date": "2017-01-25T10:13:00-07:00", "title": "Still doesn't work (not because of iOS)"}, {"content": "Why can't I get the update?", "rating": "1", "version": "1.23.2", "date": "2017-01-25T09:48:00-07:00", "title": "Update"}, {"content": "Need timers on pokestops modules but apart form that ABSOLUTELY FABULOUS", "rating": "5", "version": "1.23.2", "date": "2017-01-25T08:38:00-07:00", "title": "Epic game"}, {"content": "After new update it stopped working", "rating": "1", "version": "1.23.2", "date": "2017-01-25T08:03:00-07:00", "title": "Awful"}, {"content": "Game a little boring now, always same old Pokémon about, gym battles rarely happen since change back gyms near my work haven't change hands in over a month, waiting for next faddy update.\n\nThe game is fun, more so in the early stages but game has been out a while and there are still some major bugs not being fixed.  Halloween edition was great they fixed the distance tracker but it's now worse you need to walk a 1 MILE to register 1km\n\nBiggest bug is for a walking game the distance tracker is way off in a few tests, walking 1km round 400 metre track recorded 0.45km, running a 5k park run with app open recorded 2.8km, whilst also running run keeper which got the distance spot on, the bug has been reported but they don't fix or have it as known problem as incubator sales would likely drop.\n\nBig bug two, battles drain your battery super quick, each gym attack champion will eat about 5% of battery meaning clearing a level 3 gym can use 25% of battery.\n\nBug 3 tracking hasn't been improved since the first month of the game and is hardly worth checking unless you want to be frustrated", "rating": "1", "version": "1.23.2", "date": "2017-01-25T05:08:00-07:00", "title": "Would give current version 0 stars if I could"}, {"content": "Thanks Niantic for this game", "rating": "5", "version": "1.23.2", "date": "2017-01-24T23:26:00-07:00", "title": "So GREAT"}, {"content": "Whenever you set a workout it will inexplicably crash at unpredictable intervals and not alert you that a workout has been stopped. So you may be walking for a long time and nothing has been tracked. May be a bug with Bluetooth connection or signal issues with phone network, either way we either need to be notified that a workout stopped or fix the bug!", "rating": "2", "version": "1.23.2", "date": "2017-01-24T16:34:00-07:00", "title": "Apple Watch app is made useless"}, {"content": "The last update killed the app on my phone.\nI've played since day one, but since the last update it won't even open, I see the niantic logo flash up before it closes itself.\nHaven't been able to play in a month", "rating": "1", "version": "1.23.2", "date": "2017-01-24T16:29:00-07:00", "title": "App Won't even open"}, {"content": "Game needs a bug fixed where you battle a friendly gym your Pokemon don't lose there full health also would be better if you got some star dust when giving the Pokemon to the professor. And a other thing that would make the game better would a a message tab so you could message team mates at poke-gyms.", "rating": "4", "version": "1.23.2", "date": "2017-01-24T16:03:00-07:00", "title": "Pokemon go"}, {"content": "As stated in title", "rating": "2", "version": "1.23.2", "date": "2017-01-24T15:49:00-07:00", "title": "Boring"}, {"content": "Awesome game! Takes me back to when I was a kid!", "rating": "5", "version": "1.23.2", "date": "2017-01-24T15:39:00-07:00", "title": "Great Game!"}, {"content": "Right so I did the last update now it can't find my GPS signal it's a shame because I love this game does anyone know what to do or fix this", "rating": "1", "version": "1.23.2", "date": "2017-01-24T14:28:00-07:00", "title": "GPS failing"}, {"content": "Latest update broke the game. Again. \nStop breaking it, devs. It would be awesome if you let it alone and stopped messing with it.", "rating": "1", "version": "1.23.2", "date": "2017-01-24T13:45:00-07:00", "title": "Unable to authenticate."}, {"content": "If all you want is to catch Pokemon then you'll be happy. If however, you want to take part in the multiplayer (gym) aspect, don't bother. Too many spoofers, botters and cheaters to have an interesting experience. Which wouldn't be too bad, if not for Niantic's refusal to police anything other than the bots, which can't be beaten anyway. \n\nThe complete lack of a response, let alone action regarding multiple reports against confirmed spoofers is more than enough reason to have no faith in the developers.\n\nThe only reason this is not a 1-star review is because the single player element is good enough.", "rating": "2", "version": "1.23.2", "date": "2017-01-24T13:26:00-07:00", "title": "WTB Police"}, {"content": "Best game ever but Ever since the new update I have been having trouble loading the app", "rating": "4", "version": "1.23.2", "date": "2017-01-24T12:59:00-07:00", "title": "Annoying"}, {"content": "This isn't technically a review, however I am concerned with all the 'stop working' reviews. When I had the issue, all I had to do was update the iOS. All advice aside, this game is ok, just lacks updates which can be annoying. But it's still a good game to kill time.", "rating": "4", "version": "1.23.2", "date": "2017-01-24T12:21:00-07:00", "title": "Please read"}, {"content": "Game crashing immediately upon startup on the Niantic logo. Has been doing this since the update before Xmas, and is still not fixed in this latest update. Please fix!! iPhone 5s on iOS 9.2.1", "rating": "1", "version": "1.23.2", "date": "2017-01-24T11:59:00-07:00", "title": "Crash"}, {"content": "Finally we are working really well! Had some issues with a few of the last updates, but we look to be back on track again!", "rating": "5", "version": "1.23.2", "date": "2017-01-24T11:05:00-07:00", "title": "Working well"}, {"content": "This app still doesn't work on the iPhone 6. Fed up is an understatement. Niantic please take note of how many one star reviews you're getting", "rating": "1", "version": "1.23.2", "date": "2017-01-24T09:46:00-07:00", "title": "iPhone 6 incompatible"}, {"content": "This game is so fun and cool", "rating": "5", "version": "1.23.2", "date": "2017-01-24T07:56:00-07:00", "title": "Cool"}, {"content": "I love the game but this version is unstable. Sometimes it freezes when starting, restarts, crashes. Also sometimes there's a freeze forcing me to re-start the app. Generally I'd rate the game 5/5, however this VERSION is 3/5 due to the bugs (and I don't mean Caterpie and Weedle!)", "rating": "3", "version": "1.23.2", "date": "2017-01-24T06:50:00-07:00", "title": "I love the game but this version is unstable"}, {"content": "Don't get it it won't let u play 😭😭😭😭😭😡😡😡😡", "rating": "1", "version": "1.23.2", "date": "2017-01-24T03:07:00-07:00", "title": "😤"}, {"content": "Since the first of the last 3 updates it won't even load. The \"Niantic\" screen comes up then the app force closes.", "rating": "1", "version": "1.23.2", "date": "2017-01-24T03:06:00-07:00", "title": "Booo"}, {"content": "When I open the game the volume of my music decreases and the sound effects in the game seem to be even louder than usual which is quite annoying. I like to have the game open if I know I'm walking places to hatch eggs etc.. and have music playing but this game doesn't allow that. This was never an issue with the first few updates so why has it happened now?", "rating": "3", "version": "1.23.2", "date": "2017-01-23T23:16:00-07:00", "title": "Background music"}, {"content": "Ever since the most recent update the game will not load properly and freezes as soon as it starts. This makes it completely unplayable!", "rating": "1", "version": "1.23.2", "date": "2017-01-23T17:11:00-07:00", "title": "Can't play with new update!"}, {"content": "For the last 2 updates my game stopped launching. I open it, shows me the niantic logo then closes. I deleted the app then reinstall it, still not working. So yea, hard to enjoy a game that suddenly stops launching.", "rating": "1", "version": "1.23.2", "date": "2017-01-23T15:20:00-07:00", "title": "Stopped working"}, {"content": "Good", "rating": "5", "version": "1.23.2", "date": "2017-01-23T14:56:00-07:00", "title": "Pokemon go"}, {"content": "Regards", "rating": "3", "version": "1.23.2", "date": "2017-01-23T14:23:00-07:00", "title": "Any chance ya could put a gym beside my house as im not mobile"}, {"content": "Bored very quickly, lacks content, not much has changed since launch... shame had a lot of potential. Gps drift also an issue...\nAvoid don't waste your time", "rating": "1", "version": "1.23.1", "date": "2017-01-23T11:25:00-07:00", "title": "Boring"}, {"content": "Update log lists minor text fixes and something apple watch related, yet it completely breaks my experience on iphone 5s. The 'gps not found' error happens on launch 9 out of 10 times, especially anywhere with a roof, and in areas I used to play regularly without any issues whatsoever (I'm level 30). I now have to restart multiple times to get it to work!\n\nThe speed limit is inane and needs to be removed.", "rating": "1", "version": "1.23.1", "date": "2017-01-23T11:00:00-07:00", "title": "Diabolical update"}, {"content": "After the new update I load up Pokemon go and greeted by a white screen with icons on it but can click anything. Fix it please", "rating": "2", "version": "1.23.1", "date": "2017-01-23T06:41:00-07:00", "title": "White screen"}, {"content": "More Pokémon would be fantastic", "rating": "4", "version": "1.23.1", "date": "2017-01-23T05:19:00-07:00", "title": "Decent"}, {"content": "Love the game , love new tracking version , love new details and game is a improved .\nTOP 5 STARS already!!!", "rating": "5", "version": "1.23.1", "date": "2017-01-23T02:41:00-07:00", "title": "Awesome Pokemon Go!"}, {"content": "I know Apple have increased app prices however increasing the price for the coins is a joke. They were already expensive. Maybe make it easier to obtain incubators rather than having to keep buying them", "rating": "1", "version": "1.23.1", "date": "2017-01-22T23:13:00-07:00", "title": "Thanks for the price increase"}, {"content": "When I tried to sign in with my google account, once I pressed the sign in button the screen turned white and made me do the whole thing again. It's a shame because I've been dying to play this game ever since it came out. I think Niantic can do way better.", "rating": "3", "version": "1.23.1", "date": "2017-01-22T16:37:00-07:00", "title": "Slow"}, {"content": "Developers concentrating more on closing tiny loopholes like GPS drift that give some tiny  interest to game (like making a whole extra 0.1km and hatching an egg at home that is nothing interesting) than developing game play. I'm been bored for months aimlessly trying to obtain last 2 Pokémon required.", "rating": "1", "version": "1.23.1", "date": "2017-01-22T13:46:00-07:00", "title": "Poor development"}, {"content": "If your going to go anywhere in terms of profit, you NEED to add generation 2 Pokémon, or else you are screwed. Sorry Nintendo and Niantic", "rating": "3", "version": "1.23.1", "date": "2017-01-22T12:29:00-07:00", "title": "Time to change it up."}, {"content": "Liked it but it doesn't work anymore just crashes instantly boss man needs to sort it out.", "rating": "1", "version": "1.23.1", "date": "2017-01-22T10:06:00-07:00", "title": "Pokemon Go"}, {"content": "Thanks for the new update which I can't even log in on, all the money spent trying to advance in the game and you hit out with an update I can't even use. Thanks a lot I'm done with this app sick of cheats prospering in the game while real users get done over by niantic. You're gonna lose so many players!!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-22T09:43:00-07:00", "title": "Well thanks"}, {"content": "I love this game but wish that rare Pokémon would pop up more often. Also wish that the Pokémon did their voices like in the program instead of a weird squawk!", "rating": "4", "version": "1.23.1", "date": "2017-01-22T09:03:00-07:00", "title": "Hmm"}, {"content": "How do you sign in I mean it's tricky", "rating": "5", "version": "1.23.1", "date": "2017-01-22T08:46:00-07:00", "title": "How do you sign in?"}, {"content": "Won't ever load after last update. My son is upset and I'm so annoyed as I have spent money on this and now I can't even play anymore as soon as I click on it u get booted out, been doing this for weeks now. Sort it out", "rating": "1", "version": "1.23.1", "date": "2017-01-22T07:35:00-07:00", "title": "Won't even load after update"}, {"content": "Pokecoins used to cost £14.99 for 2500. This update hiked them to £19.99. \n25% increase is disgusting, and no wonder people are leaving the game in droves. With the Christmas and new year packs I thought they'd finally cottoned on to how to attract people. What idiots.", "rating": "1", "version": "1.23.1", "date": "2017-01-22T07:19:00-07:00", "title": "Disgusted with the price hike"}, {"content": "The app won't work after u got the new update.  NOT happy😡!", "rating": "4", "version": "1.23.1", "date": "2017-01-22T05:13:00-07:00", "title": "Big"}, {"content": "Ok this app still gets a 👌 from me but the updates you put out barely do anything besides add little detail to the actual game. This app took over the entire god dam world and all you decide to do is: number 1) not listen to fans.\nNumber2) release updates that don't improve the game.\nNumber3) Don't even bother to stay the very best like no one ever was. (bad pun there I know)\nNumber 4) Don't listen to anyone's ideas.\nNumber 5) Let the app fall right in front of you without doing anything.\n\n These are the problems that you can't be bothered to fix because your either too lazy or just think this game is still considered the greatest app on the planet and doesn't need anything else well news flash it does and now no one even says the word Pokemon go anymore and even if someone well they don't follow the newest things.", "rating": "3", "version": "1.23.1", "date": "2017-01-22T02:46:00-07:00", "title": "What have you been doing niantic?!"}, {"content": "Absolutely sh*t won't let me log in and I'm sure everyone else thinks it's rubbish and won't work! God sort the bloody logging in bit! Other than that it's pretty good!", "rating": "2", "version": "1.23.1", "date": "2017-01-22T02:45:00-07:00", "title": "👎🏻"}, {"content": "I've been playing since July and I'm still playing it now. I never liked Pokemon as a kid but I love it now. Really want to get some DS Pokemon games, I'm so excited for the realise of gen 2", "rating": "5", "version": "1.23.1", "date": "2017-01-22T02:38:00-07:00", "title": "Love it"}, {"content": "well done on 'fixing' the wandering GPS issues. I can now sit at home eating a burger while my character with happily run 5k in about an hour... makes egg hatching easy, getting poke-stop and battle gyms simple from my arm chair.", "rating": "1", "version": "1.23.1", "date": "2017-01-22T01:32:00-07:00", "title": "GPS still not fixed 😂😂😂"}, {"content": "i got a new phone and i pressed my account and it kept saying \"Incorrect password\"\nWorst game ever in life\nThe creators should also fix the password reset that it must have symbols such as ?!-/:;()$&@@ or something like that\nIts stupid🖕🏻🖕🏻🖕🏻🖕🏻\nWORST GAME EVA\nupdates are crap 🖕🏻🖕🏻🖕🏻🖕🏻🙄🙄🙄🙄🙄🙄🙄🙄", "rating": "1", "version": "1.23.1", "date": "2017-01-21T22:37:00-07:00", "title": "Wont let me in"}, {"content": "This Update made me lose all my Pokemon :( I was a very high lvl I was player lvl 34 and I payed money and my character got reset 😡😭 Pls help me niantic PS When will mewtwo be added", "rating": "1", "version": "1.23.1", "date": "2017-01-21T18:48:00-07:00", "title": "Lost All My Pokémon's and items"}, {"content": "Niantic - I live in the countryside, the nearest pokestop is 2 miles away. I used to play Pkmn Go on the bus in the mornings/evenings but alas your update now stops me from doing so. Solutions: (1) reverse the update that forbids catching Pokemon at speeds > 3 mph or (2) give free pokeballs to each player on a frequent basis or (3) increase the number of pokestops.\n\nI have other gripes of course, such as the interminable number of pidgeys and rattatas that would normally demand some sort of cull. Until one of the solutions offered above is enacted I of course can't and won't be playing the game. Ta-ra", "rating": "1", "version": "1.23.1", "date": "2017-01-21T14:07:00-07:00", "title": "Rural location"}, {"content": "Keeps crashing,massive price increase?NO THANKS!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-21T13:54:00-07:00", "title": "Price hike?jog on"}, {"content": "The new update has destroyed the last few good things about this game as mainly a passenger in a car I can no longer get Pokémon or spin pokestops ???? Unfair . Also game keeps freezing and saying no gps signal ( not had that issue before) .... Walked 3/4 in yesterday with app open and eggs incubating and it registered less than 1 km ??? Same crappy Pokémon all the time .... do I need to go on ?", "rating": "2", "version": "1.23.1", "date": "2017-01-21T13:36:00-07:00", "title": "So passengers can't play in cars ??"}, {"content": "After the last update, the app no longer works... It gets to the white screen and the closes. I have reported this and still no luck! I have deleted the app and now I have to go back to my normal life.", "rating": "1", "version": "1.23.1", "date": "2017-01-21T13:18:00-07:00", "title": "App no longer works"}, {"content": "It wont let me get passed the loading screen. Says an update is available, then takes me to the app store... no update available?\n\nCant even play now.", "rating": "1", "version": "1.23.1", "date": "2017-01-21T12:40:00-07:00", "title": "No longer works"}, {"content": "This game is getting worse day by day even update will not help now. God help you as pokemon used to such a good game", "rating": "1", "version": "1.23.1", "date": "2017-01-21T12:27:00-07:00", "title": "Something is always wrong"}, {"content": "I cant play it . It says to continue playing update the app and when I'm on the App Store i cant update it so whats going on???", "rating": "1", "version": "1.23.1", "date": "2017-01-21T08:27:00-07:00", "title": "I cant play anymore"}, {"content": "Since the update the app won't even open.", "rating": "1", "version": "1.23.1", "date": "2017-01-21T04:52:00-07:00", "title": "Rubbish"}, {"content": "Almost a month now and every time I go to open the app it crashes, doesn't even try to load. \nThere is Pokèmon to catch!!!", "rating": "3", "version": "1.23.1", "date": "2017-01-21T04:19:00-07:00", "title": "Please Fix 🙏🏻"}, {"content": "Been playing this since July. Actually was really enjoying it even with a few glitches. Now they have put the prices right up for purchasing pokemoney. Now it's a rip off. Won't be playing anymore.", "rating": "1", "version": "1.23.1", "date": "2017-01-21T04:11:00-07:00", "title": "Such a shame."}, {"content": "I recently did an update on my I-phone 5s and now can't even access the game. It just pulls up the white Niantic screen then crashes out to my phone screen. I've tried soft rebooting, uninstalling and reinstalling. I have plenty of memory.......So frustrating!!!! 😖 Can't find any contact details for a helpline etc or any indication as to what the problem is 😔", "rating": "1", "version": "1.23.1", "date": "2017-01-21T04:03:00-07:00", "title": "Update - crash"}, {"content": "Been playing it since it came out in the uk. GEN 2 needs to come out. Getting bored of the same crap", "rating": "1", "version": "1.23.1", "date": "2017-01-21T03:54:00-07:00", "title": "If I could give no stars I would. BORING!!"}, {"content": "Whenever I log in, it says No GPS signal found. I got oh! I'll refresh, but it never goes away and doesn't let me catch Pokémon. It used to work until the new update. I want this fixed. I want to play with game because I love it so. But I can't. Please help. 😭", "rating": "3", "version": "1.23.1", "date": "2017-01-21T03:49:00-07:00", "title": "I love this app but..."}, {"content": "I am 7 my parents got me a iPhone 5c and I play Pokemon everyday after school it's great I love it", "rating": "5", "version": "1.23.1", "date": "2017-01-21T03:49:00-07:00", "title": "Great"}, {"content": "I've played this game since launch and loved it but the recent 25% increase in the cost of in-game currency has killed it for me. The player base was declining anyway and this will only push people further away. Very short-sighted.", "rating": "2", "version": "1.23.1", "date": "2017-01-21T02:00:00-07:00", "title": "Disappointing"}, {"content": "Price for 2,500 PokéCoins has increased by over 33% thanks to Apple's recent App Store price increase in the UK.  You won't be getting any more of my money.", "rating": "1", "version": "1.23.1", "date": "2017-01-21T00:54:00-07:00", "title": "Apple's UK app price hike makes this game unaffordable"}, {"content": "The gps drift fix is an absolute joke. I could put distance on my eggs by walking around my garden but now, after walking around my fairly large garden for 30 mins I had generated nothing. More needs to be done to stop the cheats, had one person putting Farfetch'd, Kangaskhan and Tauros in 3 gyms in my area and reported them but they are still playing. Highly unlikely they are that well travelled?! Too many spoofers which is frustrating when you have spent money to advance in the game. Also the price hike on coins is absolutely disgraceful. Haven't you made enough yet??? Thieves", "rating": "1", "version": "1.23.1", "date": "2017-01-21T00:46:00-07:00", "title": "Fix the problems"}, {"content": "This game really hasn't improved since launch, in fact it  has got worse.", "rating": "1", "version": "1.23.1", "date": "2017-01-20T15:32:00-07:00", "title": "Each update makes it worse!"}, {"content": "Locks when loading. Locks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.\nLocks when loading.", "rating": "1", "version": "1.23.1", "date": "2017-01-20T15:13:00-07:00", "title": "Latest update"}, {"content": "When i first started Playing it workowe now it doesn't... simple as that", "rating": "2", "version": "1.23.1", "date": "2017-01-20T13:20:00-07:00", "title": "Wont work"}, {"content": "I keep clicking on the app then it opens but keeps going back out on the homepage. Keep deleting it and redownloading it but just keeps doing it over and over again. What should I do?", "rating": "1", "version": "1.23.1", "date": "2017-01-20T12:42:00-07:00", "title": "Lagging"}, {"content": "I love playing this game a lot. It gets harder to level up the further along you get but it has added the chance to get more xp each day by visiting pokestops and for your first catch of the day and if you do it for 7 days in a row then you can get a lot more xp and stardust.", "rating": "5", "version": "1.23.1", "date": "2017-01-20T12:37:00-07:00", "title": "Great game"}, {"content": "Pokestops aren't working for me and GPS is taking me all over the place", "rating": "1", "version": "1.23.1", "date": "2017-01-20T12:15:00-07:00", "title": "Not working"}, {"content": "Boring... had the game since release. Completed the Pokédex for all I can get in this country. But now I have zero motivation to walk off the 100's of kilometres for to hatch the baby Pokémon. The events are sparse and ridiculous. Some are already hacking the game. Goes to show if the interest was there in the first place hackers wouldn't bother.", "rating": "1", "version": "1.23.1", "date": "2017-01-20T11:57:00-07:00", "title": "Mr Kitster"}, {"content": "Is there anyone have a issue on iPhone 5s? I can't open it, when run the game it just flash out, hope can fix this problem soon.", "rating": "2", "version": "1.23.1", "date": "2017-01-20T10:52:00-07:00", "title": "Can't play on iPhone 5s"}, {"content": "Used to buy coins for £14.99 from an iTunes card fairly regularly...same bundle of coins now £19.99!! That's a hell of a price hike 😡", "rating": "2", "version": "1.23.1", "date": "2017-01-20T10:30:00-07:00", "title": "Coins gone up by a fiver!!"}, {"content": "Current version is in a boot / crash cycle after latest update!", "rating": "1", "version": "1.23.1", "date": "2017-01-20T10:05:00-07:00", "title": "Currently not working"}, {"content": "After level 20 the game becomes boring at level 26 and only need a few Pokemon to capture, not had a 10km egg in 4 months and now they put the price up of the pokecoins bad move less buy buy and more bye bye", "rating": "2", "version": "1.23.1", "date": "2017-01-20T09:36:00-07:00", "title": "Needs excitement"}, {"content": "SLOWBRO IS TOO UNDERATED MAKE HIM LIKE 3000 CP", "rating": "4", "version": "1.23.1", "date": "2017-01-20T09:22:00-07:00", "title": "SLOWBRO"}, {"content": "Forces an update (not even optional!) every Friday afternoon at school time meaning you have to use mobile data to update or have to go home. Do you people not think about this?!", "rating": "1", "version": "1.23.1", "date": "2017-01-20T09:01:00-07:00", "title": "What a joke!"}, {"content": "Pokémon go has gotten boring as I've been playing scince July and nothing new has changed so I think there should be more poke stops and more Pokémon!!!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-20T08:20:00-07:00", "title": "Pokémon go"}, {"content": "Beware of price increases, less people playing so punish the 1's that have stayed??? Time to delete???", "rating": "1", "version": "1.23.1", "date": "2017-01-20T05:53:00-07:00", "title": "Latest update has faults"}, {"content": "Started the game a few months ago and it was fine,now after every update it gets worse,crashes all the time and pokestops just keep saying try again later", "rating": "2", "version": "1.23.1", "date": "2017-01-20T00:28:00-07:00", "title": "Going down hill"}, {"content": "Mewtwo tried to kill me with his psychic powers", "rating": "1", "version": "1.23.1", "date": "2017-01-20T00:22:00-07:00", "title": "Omg I almost died"}, {"content": "The new update is annoying 😔 I tap ok and it takes me to the AppStore but then it says just go into the app 'open' then it takes me back to the start I don't know what this is but it needs to stop!😓😥🙄", "rating": "3", "version": "1.23.1", "date": "2017-01-19T23:23:00-07:00", "title": "PROBLEM"}, {"content": "Can't get past loading screen... again.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T23:20:00-07:00", "title": "Can't get past loading screen... again"}, {"content": "Says I've seen Pokemon that I definitely haven't but would of loved to of had the chance to catch !!", "rating": "3", "version": "1.23.1", "date": "2017-01-19T23:09:00-07:00", "title": "Slight error"}, {"content": "It starts to load then says a new version is available. Doesn't let you click off it. When you click 'upload' it takes you to iTunes. Click on open the app for it to do the same thing over and over....and over. So how do I update the app if it's telling me it was last update 18.01.17 but won't actually let me start the game???\nWould really like the game back please.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T22:52:00-07:00", "title": "Can't load game after last update"}, {"content": "This used to be a great app, but with the recent changes it has gone downhill. Things like not being able to spin and catch Pokèmon whilst  driving killed the game, and I understand it's to stop people playing while driving, but it affects passengers too. It's quite stale and we aren't getting any new content, to be blunt.", "rating": "2", "version": "1.23.1", "date": "2017-01-19T17:25:00-07:00", "title": "Disappointing"}, {"content": "This app is dead. Constant prompts to update despite having the latest version installed. Had enough of this nonsense. App deleted. Won't have anything more to do with Pokemon so long as Niantic are involved.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T16:28:00-07:00", "title": "Pokémon GO f**k yourself"}, {"content": "I used this EVERY time I went out. Now it just circles between loading screen - update - App Store - loading screen - update... you get the picture. On wifi or 3G. No difference. \nAnd it won't even let me play the non-updated game. \n\nPLEASE FIX THIS!!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T15:59:00-07:00", "title": "Stopped loading"}, {"content": "Been playing the game since the release and almost every update seems to make the game less playable. It gets worse on the iwatch and now they updated that, the account doesn't even appear anymore. \nDon't even get me started on the gps tracker😩😵. delete.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T15:32:00-07:00", "title": "It just gets worse"}, {"content": "Have run 7k in last 2 days yet my egg has moved 1k. Disappointing :(", "rating": "2", "version": "1.23.1", "date": "2017-01-19T14:57:00-07:00", "title": "Apple Watch not hatching eggs even though it tells me I have run more than needed..."}, {"content": "Game use to work amazing and load fine. The game won't work without the update which constantly fails download. The updates removed Pokemon Go from my life, and with it a part of my soul. Without Pokemon I now have no reason to leave the house. Vitamin D deficiency due to this update has already started to take hold.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T14:25:00-07:00", "title": "Update has broken Pokemon"}, {"content": "Hate trying to log in to this game. Just going round in circles!!! Please make this easier!", "rating": "3", "version": "1.23.1", "date": "2017-01-19T13:52:00-07:00", "title": "Logging In"}, {"content": "Slight issue with logging in with this update BUT apart from that this is awesome! Also I've been buying LOTS of Pokeballs so bit disappointed when at 4p a throw when Pokémon escape them.", "rating": "4", "version": "1.23.1", "date": "2017-01-19T13:29:00-07:00", "title": "Addicted"}, {"content": "Since the new update I've tried logging back in after the screen crashing on me all the time...... when I eventually do manage to log back in it's cleared my whole account I have to start from scratch!! No chance, won't be playing again!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T13:23:00-07:00", "title": "Logged me out and wiped my catch history!!!"}, {"content": "😫", "rating": "1", "version": "1.23.1", "date": "2017-01-19T13:16:00-07:00", "title": "Doesn't work !!!!"}, {"content": "After I updated today, the game crashes regularly and doesn't connect to Pokémon Go device. Please fix this as I am a fan to the franchise", "rating": "1", "version": "1.23.1", "date": "2017-01-19T13:11:00-07:00", "title": "Don't Update"}, {"content": "No longer works after update, wont let me sign in. Game is now unplayable.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T13:07:00-07:00", "title": "Not working"}, {"content": "Can't open the app since the update as it keeps crashing!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:54:00-07:00", "title": "Do not update!"}, {"content": "This is a shame because it's saying to update but won't let me and because I'm a very big Pokemon go away player this is driving me away from this game. Until it's fixed like someone else said, if I had the choice to rate 0 I would. Normally I would be rating A 5", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:54:00-07:00", "title": "Not working"}, {"content": "Since this update can no longer login", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:48:00-07:00", "title": "Can't login"}, {"content": "Since updating all I get is failed to log in. Useless 😒", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:37:00-07:00", "title": "Latest update has ruined my game"}, {"content": "What's going on, all of my music and sound effect buttons are on and I only get a few sounds. Think something needs to be sorted hear, I used to love this app but without sound, not so great", "rating": "2", "version": "1.23.1", "date": "2017-01-19T12:26:00-07:00", "title": "No music, no Pokémon sounds but some in game sounds"}, {"content": "App often needs restarting several times when opening it as pokestops and gyms don't load at all. \n\nHatching eggs is still massively inaccurate, again this was supposed to be fixed in the update. \n\nGyms frequently error or freeze when trying to battle them even after the app update. \n\nPokestops often become out of range or just tell you to try again later even though you've got nothing from them. \n\nShame Niantic don't get the app fixed and move the game on rather than just meddling with it.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:13:00-07:00", "title": "Big disappointment"}, {"content": "Can't load or open app without downloading latest update. Not nice", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:11:00-07:00", "title": "Unpleasant user experience"}, {"content": "Come on, get ur act together....\n:-(\n\nUpdated to latest version earlier today, can't get past first screen.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:07:00-07:00", "title": "Servers too busy???"}, {"content": "Newest update has caused problems again. I now can't even sign in again because of restarting app. Sort it out!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:05:00-07:00", "title": "UPDATE ISSUE"}, {"content": "I've got a very distraught son who's worrying that all the Pokémon we've captured are gone for good now, as since the update I'm constantly receiving a failed to authenticate details message via google and trainer club. I'm hoping this is just a temporary server fault or simple bug fix.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:03:00-07:00", "title": "Upset son"}, {"content": "Just updated after months of play. Won't let me log in even if I re-set online with Pokémon club. What a way to treat your fans who have stuck with you after the hype of the first few months. Game gets boring after first 10 levels so delete and save your time and money.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:03:00-07:00", "title": "Don't update or play long term"}, {"content": "Can't log in since the latest update.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:03:00-07:00", "title": "Crashes since update"}, {"content": "Since today's update I can't get the game to load. Do not update", "rating": "1", "version": "1.23.1", "date": "2017-01-19T12:01:00-07:00", "title": "Game will not load"}, {"content": "Since the update it won't let me log in!\n\nJust saying", "rating": "2", "version": "1.23.1", "date": "2017-01-19T12:00:00-07:00", "title": "Aggghhhh"}, {"content": "Not working after I used the update", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:58:00-07:00", "title": "Not working after update"}, {"content": "App does not work since the latest update.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:58:00-07:00", "title": "18/01 update crashes app"}, {"content": "The app was working fine earlier but it is no longer working. I cannot get logged on at all! ☹️", "rating": "5", "version": "1.23.1", "date": "2017-01-19T11:58:00-07:00", "title": "No longer working"}, {"content": "Since this update I've had nothing but problems with the game crashing and not loading.\nI enjoy the game but I'm starting to get tired of the problems and updates that don't improve play.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:56:00-07:00", "title": "Problems since update"}, {"content": "The new update has signed me out, I can't access the google log in and it keeps saying my password is incorrect and now I have one try left!!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:56:00-07:00", "title": "Very social and healthy"}, {"content": "Love this game but since the new update I can not sign in through my google account really disappointed 😢", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:54:00-07:00", "title": "😢"}, {"content": "The game makes you update but this update crashes the game and won't allow you to play!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:53:00-07:00", "title": "Rubbish Update"}, {"content": "Won't let me play since update 😡😡😡😡", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:52:00-07:00", "title": "Crap"}, {"content": "Since updating my account no longer exists and I won't be starting from scratch so it's the end so it seems, poor very very poor.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:51:00-07:00", "title": "Flawed update"}, {"content": "Was made to update this app this morning and tonight I can't log in, says it failed to authenticate. I've tried deleting app, restarting phone and re-installing app but didn't make a difference. So I can't use it at all, useless!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:51:00-07:00", "title": "Can't log in"}, {"content": "I've been playing this game since it came out but with the new update, I can't get on it. I've uninstalled and re-installed, but it still says it can't authenticate - that's before giving me the option to sign in.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:51:00-07:00", "title": "5S USERS, DO NOT UPDATE"}, {"content": "I've done the latest update today and now the app won't work at all ( iPhone 6s). Seems like this is happening to lots of people. What a shame that there are so many issues with this app. :(", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:50:00-07:00", "title": "Do not do the update!!!"}, {"content": "App forced update yesterday and now won't open! Why make an update if it makes it worse than before. Don't update if you can get away with it.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:50:00-07:00", "title": "Crashed!"}, {"content": "Can't log in with google account after this update. I play everyday and this update means I can't play and they're so slow with updates I won't be able to play for a long while. Useless", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:49:00-07:00", "title": "Can't play"}, {"content": "New update seems to have crashed on my phone. App won't load to login. Rubbish. 😢", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:46:00-07:00", "title": "New update crashes"}, {"content": "Updated the app the other day and now it won't log in at all. A waste.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:45:00-07:00", "title": "Ruined by update"}, {"content": "The update has caused sign in issues. Don't update if you want to continue using Pokemon go.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:42:00-07:00", "title": "Update:"}, {"content": "New update doesn't let me log in. Great game but keeps crashing!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:42:00-07:00", "title": "Keeps crashing!!"}, {"content": "Installed new update this evening, now the game fails to log in whenever I open it.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:40:00-07:00", "title": "New update doesn't work"}, {"content": "Your game is getting boring so add gen 2", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:39:00-07:00", "title": "Add gen 2"}, {"content": "I play Pokémon everyday as I commute to work, however the new update won't even load the game! :( please fix this!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:38:00-07:00", "title": "Update crash"}, {"content": "New update has caused me to be thrown out of my game and now can't access my account. \nThis needs sorting", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:34:00-07:00", "title": "New update issues"}, {"content": "Love the game andwas  working a few hours ago but now when I try to open the app and login it says it's 'unable to authenticate please try again' I've been trying for the past hour and it's still saying that 🙄", "rating": "4", "version": "1.23.1", "date": "2017-01-19T11:34:00-07:00", "title": "Can't login"}, {"content": "Since it updated today, it logged me out, now when I go to log in with my google account, pokeball spins round for 5 mins then says \"unable to authorise\"", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:34:00-07:00", "title": "Update? Screw up more like"}, {"content": "Not been playing long, game wouldn't load until I updated it, now that I have, I can't log in as it crashes as soon as the first screen appears!\nDeleted and reinstalled now doesn't even allow me to log in!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:33:00-07:00", "title": "Do not update"}, {"content": "I'm not sure what's going on with the app on IOS but it's been dodgy all day. If you can avoid this update, make sure you do. Won't load at all begad!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:32:00-07:00", "title": "Pants update"}, {"content": "Loved this game until the new update when it stopped working!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:30:00-07:00", "title": "New update"}, {"content": "Once again, it won't load...", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:25:00-07:00", "title": "Good when it works"}, {"content": "Update doesn't work!! Can't login now.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:24:00-07:00", "title": "New update"}, {"content": "So you make us have to do the update for Apple Watch use (never mind that not everyone has an Apple Watch) and now my app won't let me log in, after crashing twice during game play ... thanks for that 👍🏼", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:22:00-07:00", "title": "Terrible update"}, {"content": "The new update for this app has partially ruined this game. Not only have third party maps been shut down but the new update has DISABLED the battery saving option?! Why oh why?! Good luck playing this game for more than an hour on your iPhone without an external charger! That's with the sound turned off and the brightness right down! BRING BACK THE BATTERY SAVE OPTION!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:22:00-07:00", "title": "NEW UPDATE RUBBISH"}, {"content": "Updated my game today and now I can't even get back onto it! Now I'm going to loose my daily catch/spin streaks thanks......", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:20:00-07:00", "title": "Update"}, {"content": "Since I've updated I can't login anymore I'm lvl 27 and think I've lost everything ! Not happy", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:18:00-07:00", "title": "Don't update"}, {"content": "Great game! Played since the start but a simple update crashes your app! No loggy no loggy", "rating": "4", "version": "1.23.1", "date": "2017-01-19T11:15:00-07:00", "title": "Do not update!!"}, {"content": "New update is terrible, it logged me out and now won't recognise my log in!!  >:(", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:13:00-07:00", "title": "Don't update!"}, {"content": "The latest update crashes the game. It then doesn't allow you to log back in. Comes up with a message \"unable to authenticate, please try again\"", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:10:00-07:00", "title": "DO NOT UPDATE"}, {"content": "Can't even log in now. Wonder why it's losing players? Also, Gen 2 please!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:10:00-07:00", "title": "Don't UPDATE!"}, {"content": "I love this game and love playing it but it has crashed and I am devastated please sort this quick or me and my girlfriend can't go on our walk tonight", "rating": "5", "version": "1.23.1", "date": "2017-01-19T11:10:00-07:00", "title": "Crash"}, {"content": "Ever since 18th January update it's constantly crashing. At stage now it won't even sign into the game. Shocking!!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:10:00-07:00", "title": "Update"}, {"content": "Just updated and now won't log in/ load", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:06:00-07:00", "title": "Update not working"}, {"content": "I LOVE this game but ever since I updated it my game has suddenly crashed and now it isn't letting me lose gin or retrieve an email saying my username or password!! PLEEASSSEEE HEEELLPPP😫😫😫😤😤", "rating": "3", "version": "1.23.1", "date": "2017-01-19T11:04:00-07:00", "title": "New Update Crash"}, {"content": "The game only ever worked right in the first week, after that every single update added new bugs that the lazy 4 man company Niantic never even tried to fix just like everything to come out of America it never works right and even if it looks hopeful it is secretly ran by Russia so will never go anywhere other than to self destruction.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:03:00-07:00", "title": "Flopped after the first week"}, {"content": "Latest version (January 18th 2017) does not allow users to login via their google accounts. It states it's unable to authenticate.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:01:00-07:00", "title": "DO NOT UPDATE"}, {"content": "My game closed itself upon opening after the update and logged me out. It won't let me even attempt to log back in... as much as I love the game, it's completely unplayable right now hence the 1star review.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T11:00:00-07:00", "title": "Game crash"}, {"content": "Downloaded the new version & all it's done since I've downloaded it is freeze, and completely shut me out the whole thing so now I can't get back on to it, Needs to go back to the last one!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:59:00-07:00", "title": "Bad"}, {"content": "I updated the game today as apparently it was necessary because I couldn't get past the loading screen without it saying update required, I updated it and noticed my nearby list was not changing so I tried to reset my game, when trying to reload the game the loading bar would stay at a quarter full... after a while it would eventually say \"failed to log in\" and it would do this every time", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:56:00-07:00", "title": "DONT UPDATE"}, {"content": "I was forced to update it, so I did. When the updates were installed, I went to play and now it won't let me log back in! I have lost all my progress now 😡", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:50:00-07:00", "title": "Pokémon go update"}, {"content": "Been enjoying this since the start however the latest update fails to log in. You are unable to play without updating & once updated you can't play....sort it out please.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:49:00-07:00", "title": "Update does not work"}, {"content": "Forced an update and now it won't load again...poor bug fix and no resolution 😡", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:48:00-07:00", "title": "Forced update"}, {"content": "Update means the screen freezes and goes white after the loading screen. Have to update the game to play, yet can't play the game due to updating. iPhone 6.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:36:00-07:00", "title": "Broken due to update"}, {"content": "I couldn't play for weeks because it kept on coming up with this weird magnemite with a box under it", "rating": "2", "version": "1.23.1", "date": "2017-01-19T10:33:00-07:00", "title": "Magnemite I am not a robot???"}, {"content": "Dont update it makes app on iwatch unusable dont these people check updates!!!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:23:00-07:00", "title": "Update buggers iwatch app"}, {"content": "Game is a total ripoff now.\n\nUnable to play game until You've updated to new version. Well, considering the size of app and iTunes suggest to download by WiFi. Can't do that when you're in the middle of nowhere and miles away from home.\n\nAlso, expanding items by 50 when upgrading your bag. Well, this is total 💩 as I've expanded my bag 5 times, so in theory, I should be able to carry 250 additional items but no, it allows me to collect a few more, then says bag is full again.\n\nTOTAL RIPOFF I will not spend any further money on this drivel.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:16:00-07:00", "title": "Poké ripoff mon Go"}, {"content": "Edg rcc rdhf degree Ed", "rating": "1", "version": "1.23.1", "date": "2017-01-19T10:09:00-07:00", "title": "Gee tfc testy"}, {"content": "Update has broken game on 5S. Won't load, keeps crashing, have to restart phone etc. Don't download.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T09:54:00-07:00", "title": "Broken update"}, {"content": "I really enjoy the game but the new update has led to the app instantly crashing when loading up on 5s", "rating": "1", "version": "1.23.1", "date": "2017-01-19T09:13:00-07:00", "title": "New update!!"}, {"content": "Like previous review, unable to load the game now on IPhone 5s. Keeps going round in circles telling me new version is available but not opening. Please advise how to fix before I delete the game in frustration!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T09:00:00-07:00", "title": "New version of Pokemon Go"}, {"content": "Also iPhone 5 and cannot update or enter. Children devastated 😢", "rating": "1", "version": "1.23.1", "date": "2017-01-19T08:32:00-07:00", "title": "Pokémon lost"}, {"content": "When the game first game out but now I've got everything it's so dead need gen 2", "rating": "2", "version": "1.23.1", "date": "2017-01-19T08:13:00-07:00", "title": "Was good"}, {"content": "Love this game so much no matter what people say but niantic awesome job 👍🏻", "rating": "5", "version": "1.23.1", "date": "2017-01-19T07:48:00-07:00", "title": "Best game yet🖤"}, {"content": "I love Pokemon Go in fact I'd say it was one of my games of last year but this new update has crashed my game. Once getting past the loading screen it loads my game and then freezes. I have lost out on a whole day of catching Pokemon. This needs sorting out", "rating": "1", "version": "1.23.1", "date": "2017-01-19T07:05:00-07:00", "title": "Never wrote a review but had to"}, {"content": "I love the game and have played it since it came out, but recent update has caused it not to work...", "rating": "5", "version": "1.23.1", "date": "2017-01-19T07:00:00-07:00", "title": "Update doesn't work"}, {"content": "Not able to open new formats love playing but now I can't", "rating": "5", "version": "1.23.1", "date": "2017-01-19T06:12:00-07:00", "title": "Disappointed"}, {"content": "Can't even play the game since its been updated in December on my iPhone 5 really a let down I miss out on loads of new stuff", "rating": "1", "version": "1.23.1", "date": "2017-01-19T05:30:00-07:00", "title": "Let down"}, {"content": "I've played this game since July and was hoping this update might be the one to liven it up but no. It's getting tedious with the same Pokémon all the time", "rating": "2", "version": "1.23.1", "date": "2017-01-19T04:48:00-07:00", "title": "Why bother?"}, {"content": "With this new update I am finally completely unable to play. Since this app stopped working inexplicably on my phone (and Niantic's best help was \"use a different device, we don't know what's wrong\") I have switched to my iPad. But luckily Niantic have updated it now, so that it kinda loads and then freezes, without exception, everytime.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T04:28:00-07:00", "title": "DON'T UPDATE"}, {"content": "Niantic have a real communication problem. Everything appears to be \"top secret\". Your lack of communication is a joke. Why can't you just tell people what you're doing, instead of ignoring them for four weeks. All the money you've made you can't hire a few people to deal with that? Greedy! Won't be playing this game anymore. What's the point don't know how to catch certain Pokemon, and who knows when gen 2 is coming. Don't waste your time trainers!", "rating": "1", "version": "1.23.1", "date": "2017-01-19T04:16:00-07:00", "title": "Niantic \"top secret\""}, {"content": "I have been playing since July and have achieved lvl 31, the game is getting stale, updates of any substance are too sparse and the rate of receiving a 2 or 10km egg compared to a 5k (which gives junk) feels infinitesimally small and frustrating. Furthermore the gyms need to be overhauled to be similar to the handheld games where there is a choice of moves instead of the current system of just blindly tapping the screen (no skill)\nLastly, it is evident there are many gps spoofers still around and are not getting banned and in my area they control all the gyms non stop with the hugely overpowered Pokemon (all +3000cp) \nA good start for reviving this stale game would be release Gen 2 fully", "rating": "1", "version": "1.23.1", "date": "2017-01-19T04:15:00-07:00", "title": "Boring"}, {"content": "Can't wait for gen 2 😁😁", "rating": "5", "version": "1.23.1", "date": "2017-01-19T04:12:00-07:00", "title": "Great game"}, {"content": "My guy stands still now, no extra steps from GPS drift :/ Probs won't play.", "rating": "3", "version": "1.23.1", "date": "2017-01-19T03:10:00-07:00", "title": "RIP GPS Drift"}, {"content": "The latest update (18th Jan) has made the app not work on my phone. On the initial loading screen it says I need to update, when I go to the App Store the only option is 'open', not update. If I click open the same thing happens again.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T02:59:00-07:00", "title": "New update stops it working on your phone"}, {"content": "Just switched on my Pokémon go and it went to straight to update and now stuck in loop of updating and Pokémon so disappointed could this be fixed so I don't lose my game and stuff ? Thanks", "rating": "1", "version": "1.23.1", "date": "2017-01-19T02:39:00-07:00", "title": "Update"}, {"content": "I love this game but I couldn't open the app after the latest update. Please fix asap..", "rating": "4", "version": "1.23.1", "date": "2017-01-19T02:05:00-07:00", "title": "Bug after update"}, {"content": "I love this game but since updating before Xmas the app will not open. I've even deleted / reinstalled but no success so I current cannot play and have lost my daily streak bonus as a result", "rating": "1", "version": "1.23.1", "date": "2017-01-19T01:59:00-07:00", "title": "Stopped working!"}, {"content": "I love the concept of this game but sadly a few points really hold it back. Back when it first started you would find all sorts of Pokemon in gyms, but now it's only ever one of four or five Pokemon - Dragonite, Gyarados, Snorlax, Vaporeon and Lapras. It makes gyms incredibly boring and actually limits the amount of Pokemon you actually care about catching. Once you've got the pokedex completed there's no reason to catch anything other than those Pokemon or their pre evolutions. Fix the balance and make more Pokemon viable and the game will be infinitely better!", "rating": "3", "version": "1.23.1", "date": "2017-01-19T01:35:00-07:00", "title": "Work in progress"}, {"content": "Update not updating. Update to continue.\nOpen app.\nYou have to update to continue.\nNot updating.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T01:08:00-07:00", "title": "Update"}, {"content": "The Pokemon Go app today has stated when i go on it that it needs to be updated, however when it takes me to the App Store, it just says open, not update, and if you click the open button, it does it all over again. This game is a really good game, as i play it non stop all the time, so i hope this issue is resolved soon!", "rating": "2", "version": "1.23.1", "date": "2017-01-19T00:59:00-07:00", "title": "Pokemon Go App NOT Working"}, {"content": "GPS distance still rubbish, regularly walk/cycle 15km everyday, barely measures 10% is registered... App crashes all the time, and needs restarting, complete pain in the behind... And, I'll decide when I update an app, not the app.", "rating": "2", "version": "1.23.1", "date": "2017-01-19T00:45:00-07:00", "title": "Buggy buggy buggy..."}, {"content": "I started playing this game in London and got extremely addicted to this awesome game but as I was coming to Bangladesh I thought I would not be able to play anymore but fortunately niantic released it here and I love it!! Recommended to all", "rating": "5", "version": "1.23.1", "date": "2017-01-19T00:43:00-07:00", "title": "Fantastic"}, {"content": "I'm still one of the users that opens Pokémon every now and again, but with every update the game becomes worse. Events bring excitement to the game as you catch new Pokémon once this is gone the game becomes boring again. Speed caps are the most annoying thing ever, this seems to cause lots of problems spinning poke stops even when I'm standing next to it. Make it interesting again, REMOVE SPEED CAPS! This may draw gamers back in.", "rating": "1", "version": "1.23.1", "date": "2017-01-19T00:34:00-07:00", "title": "Gets worse with every update"}, {"content": "I think Pokémon go got a bit boring but at least there is now baby Pokémon and a sign of gen2", "rating": "5", "version": "1.23.1", "date": "2017-01-19T00:23:00-07:00", "title": "Great game"}, {"content": "But there is no update.\nSo is a broken game for now, can't be played", "rating": "1", "version": "1.23.1", "date": "2017-01-19T00:17:00-07:00", "title": "Can't play because of update...."}, {"content": "All worked completely fine all day yesterday, no updates on the App Store... Today, all of the sudden, an update is available, and old version stops working straight away. You used to have a one day window to give people time to update - what happened this time? You risk losing a lot of users if you do this.\n(the app itself is all right)", "rating": "3", "version": "1.23.1", "date": "2017-01-18T23:57:00-07:00", "title": "What happened with this update?"}, {"content": "The new version does not work.  Press to update to new version , open in AppStore only to be to told press to update.  No option to continue the game in the previous version until the new version actually opens.  Im going to assume a million people are currently downloading and the game can't handle it, and try again later.  Not that impressed", "rating": "1", "version": "1.23.1", "date": "2017-01-18T23:40:00-07:00", "title": "Round and round we go"}, {"content": "Hj", "rating": "3", "version": "1.23.1", "date": "2017-01-18T23:33:00-07:00", "title": "I stopped playing the game because they have not released anything mayor yet"}, {"content": "I will quit this game because this update has been to long and it wasn't gen 2 or trading or shiny or more bye niantic", "rating": "5", "version": "1.23.1", "date": "2017-01-18T23:22:00-07:00", "title": "Update"}, {"content": "Very disappointed the makers removed this perk. This will harm user experience!", "rating": "1", "version": "1.23.1", "date": "2017-01-18T23:20:00-07:00", "title": "GPS Drift"}, {"content": "Won't even open, *sigh*", "rating": "1", "version": "1.23.1", "date": "2017-01-18T23:10:00-07:00", "title": "Much glitch"}, {"content": "Nearly a year on and this game still needs improvements, the solution is simple...listen to what the users are saying!! \nMore pokestops in rural areas, higher switch rates on spawning points, release the regional exclusives to every user and also release the promised breeding and trading update. \nThis game has had major improvements since it was released and hopefully it will keep moving in the right direction before every user looses interest.", "rating": "3", "version": "1.23.1", "date": "2017-01-18T22:34:00-07:00", "title": "Listen to the users!!"}, {"content": "So much fun gets me out the house too", "rating": "5", "version": "1.23.1", "date": "2017-01-18T21:13:00-07:00", "title": "Awesome"}, {"content": "stuck, frozen a lot. the programming can be improved much more!\n\nThe activities are good, add points to the boring pokemon catch routine, looking forward to next activity!", "rating": "3", "version": "1.23.1", "date": "2017-01-18T20:50:00-07:00", "title": "not smooth"}, {"content": "Forced me to update to play the game. \nNo longer loads on my iphone 5 and doesn't work completely!! 😣 very disappointed", "rating": "1", "version": "1.23.1", "date": "2017-01-18T19:43:00-07:00", "title": "Not working anymore"}, {"content": "Play this game every time I go out without fail. However since the update it no longer goes past the loading screen, freezing on the opening screen preventing me from playing. Have tried to open it with and without a wifi connection yet still won't work. Needs to be sorted as I fear I will lose my streaks and of course won't be able to play the game at all", "rating": "1", "version": "1.23.1", "date": "2017-01-18T15:51:00-07:00", "title": "No longer working"}, {"content": "No audio at all", "rating": "3", "version": "1.23.1", "date": "2017-01-18T15:49:00-07:00", "title": "Sound????"}, {"content": "This is the THIRD time that an egg has just disappeared!!! I had 2 eggs at 4.6km..went to check them & they'd gone, this is an absolute joke, get your crap sorted so people can play the game properly, once again, I'm FUMING!!! FIX THE FU**ING ISSUE for god sake!!!!!!!!!!!", "rating": "1", "version": "1.23.1", "date": "2017-01-18T14:51:00-07:00", "title": "FUMING!"}, {"content": "One step to far, broken promises and a total failure to acknowledge what the fans wanted along with the latest update meaning car travel and Pokémon no longer work as the Pokémon disappear of the map even at slow speeds when traveling in a car is ridiculous. New update shows again, developer does not care one bit about the user base and was purely cosmetic and more time spent on blocking 3rd party apps.", "rating": "1", "version": "1.23.1", "date": "2017-01-18T14:09:00-07:00", "title": "Final Straw"}, {"content": "I updated the game to the latest version and when I tried to load the game after the loading screen passed it would just give me a blank screen pls niantic fix this problem", "rating": "2", "version": "1.23.1", "date": "2017-01-18T14:01:00-07:00", "title": "Blank screen"}, {"content": "They 'fix' people getting a little extra distance from GPS drift but still only track 3km on a 10k run!\n\nThe problems with this game crashing are mostly fixed.\n\nPut three 5k eggs in a to incubate and went for a 10k run (in a good gps area) with the app open. \n\nWhen I returned the eggs only showed as 2k through the hatching process. \n\nI ran 8 min miles so I would not have thought this would have been too fast to track. \n\nI would also add that the pop up asking if I'm a passenger pops up sometimes when I'm stationary. \n\nRunning tracking apps don't have s problem with gps so just this app.", "rating": "1", "version": "1.23.1", "date": "2017-01-18T13:52:00-07:00", "title": "Distance tracking worse in this update!"}, {"content": "I absolutely love this game and have been playing since it came out and really enjoy it. But the new Apple Watch update has caused the game to crash instantly after trying to load past the initial Niantic screen on the iPhone 5S.\n\nNew update and still no bug fix", "rating": "1", "version": "1.23.1", "date": "2017-01-18T10:52:00-07:00", "title": "DO NOT UPDATE"}, {"content": "Please😁", "rating": "5", "version": "1.23.1", "date": "2017-01-18T10:50:00-07:00", "title": "Can I have better stuff please"}, {"content": "This game is terrible I,m still yet to play the game my dad tried to create a account for me it took us a week and when we finally did it we tried logging in and it said plz accept the terms and conditions and we logged in to my dad,s parent account and it said nothing about accepting the terms and conditions so at that point we gave up so it's the worst game ever!!!!", "rating": "1", "version": "1.21.2", "date": "2017-01-18T08:38:00-07:00", "title": "Worst game I have ever tried in my life"}, {"content": "Warning hidden stalker I pikas eyes", "rating": "1", "version": "1.21.2", "date": "2017-01-17T10:04:00-07:00", "title": "Warning"}, {"content": "1) When looking at gyms, the game can just crash, especially ones in the distance more often than not\n2) The power save mode is  useless - ie put phone in pocket and goes into power save in your pocket. Then the screen locks. Take it out your pocket the right way round to unlock screen with password and the game thinks it's still upside down and the screen is still dark. If I input password with screen pointing down its ok, but this is very hard to do \n3) The shop page (for collecting coins) often fails to load even though the rest of the game is OK", "rating": "3", "version": "1.21.2", "date": "2017-01-17T08:47:00-07:00", "title": "Great game, but still buggy"}, {"content": "Got boring now I've got every Pokemon apart from legendaries and regionals", "rating": "2", "version": "1.21.2", "date": "2017-01-17T07:43:00-07:00", "title": "Joe"}, {"content": "This game is what I would have killed for as a kid, now it's here. It is the only game on my phone, if you like Pokémon this is most definitely the game for you.", "rating": "4", "version": "1.21.2", "date": "2017-01-17T00:32:00-07:00", "title": "Amazing"}, {"content": "Amazing game. Needs more content like all of gen 2, breeding etc. My phone may not be able to handle it well but that isn't Niantics fault by any means, hopefully they read this because many iPhone 5 players play and cannot hear Pokemon cries and music and it lags fox and when there's new content this will be 5 stars", "rating": "4", "version": "1.21.2", "date": "2017-01-16T22:57:00-07:00", "title": "Amazing game but where's the updates?"}, {"content": "Without any new Pokémon, or new features being added to the game it has become stale and boring...  the Christmas and New Year \"events\" helped somewhat; however, if Niantic don't realise a substantial update soon (within a week or two) they will lose what seems to be a dwindling player base even more.", "rating": "1", "version": "1.21.2", "date": "2017-01-16T16:50:00-07:00", "title": "Dull, monotonous and repetitive"}, {"content": "Really decent!", "rating": "5", "version": "1.21.2", "date": "2017-01-16T16:09:00-07:00", "title": "What a great game!!!"}, {"content": "On iPad mini 2 the game crashes constantly, does not get past loading screen it's ridiculous", "rating": "2", "version": "1.21.2", "date": "2017-01-15T14:38:00-07:00", "title": "Crashes constantly"}, {"content": "Obsessed.", "rating": "5", "version": "1.21.2", "date": "2017-01-15T13:44:00-07:00", "title": "The best app ever"}, {"content": "Apple Watch app keeps stopping during walk for no reason, so having to restart it even though app is running on my phone too!!!", "rating": "3", "version": "1.21.2", "date": "2017-01-15T11:51:00-07:00", "title": "Frustrating"}, {"content": "Should get it best game I've played on my phone for ages", "rating": "5", "version": "1.21.2", "date": "2017-01-15T11:15:00-07:00", "title": "OMG REALLY GOOD"}, {"content": "If you go out with mates or family in a city then it is so fun. Especially when you find rare pokemon.", "rating": "5", "version": "1.21.2", "date": "2017-01-15T08:42:00-07:00", "title": "SO MUCH FUN"}, {"content": "If they didn't spend all their time on minor text fixes and trying to wring every penny out of us and instead gave us some content like gen 2, trading etc then this review might be better. Too concerned with cash rather than giving us anything to do.\n\nGiving us baby pokes to get us to buy more incubators doesn't count either.", "rating": "2", "version": "1.21.2", "date": "2017-01-15T07:27:00-07:00", "title": "Much to be desired"}, {"content": "When I log in I try to look at the sightings but there are no Pokémon and apparently there is no \"GPS\" when I have it turned on and no pokestops show up and the road on the game don't show up, the whole game is messed up for me HELP MMEEEEE I SPENT MONEY ON THIS GAME!!!!!!!", "rating": "3", "version": "1.21.2", "date": "2017-01-15T06:05:00-07:00", "title": "Good but..."}, {"content": "I love this game and I play it everyday. The only problem is that there are some glitches that need fixing such as the frozen pokeball, loading glitches and the glitch where the gym opponent is undefeatable. Apart from this, great game!", "rating": "4", "version": "1.21.2", "date": "2017-01-15T04:08:00-07:00", "title": "Amazing game with glitches and bugs"}, {"content": "This game is awesome but pls add trading thank you", "rating": "5", "version": "1.21.2", "date": "2017-01-15T03:47:00-07:00", "title": "Awesome but"}, {"content": "YO YO YO ME NAIME ES JOE ANDE ME GIT AL DA POKMONS ANDE FINESH DA GAMME", "rating": "1", "version": "1.21.2", "date": "2017-01-14T12:59:00-07:00", "title": "I HAV NU FWENDS LEL!!!!"}, {"content": "It's amazing but it kicked me off my account and wouldn't let me back on it", "rating": "2", "version": "1.21.2", "date": "2017-01-14T10:57:00-07:00", "title": "Ok"}, {"content": "Just need to add gen 3,4,5,6 and 7!", "rating": "4", "version": "1.21.2", "date": "2017-01-14T08:51:00-07:00", "title": "Yep"}, {"content": "Iphone6, I play this game in long time but this vision cannot open. when I open this, after 3 second, flash out", "rating": "1", "version": "1.21.2", "date": "2017-01-14T08:03:00-07:00", "title": "cannot open"}, {"content": "It will be a good game once they fix the issues with being in the same place or area as a Pokemon and it come up, and I find that all I ever seem to find is pidgy's jinx and rats I mean that's not all the Pokemon in the world when they fix this I might start playing again", "rating": "2", "version": "1.21.2", "date": "2017-01-14T04:34:00-07:00", "title": "Issues"}, {"content": "Love the Apple Watch App, but it has a couple of bugs. Your walk seems to stop when you get a native Apple Watch notification (e.g. the activity progress of a friend) or when you open the activity app on the phone. Restarting it seems to involve closing it completely an opening from scratch rather than opening the app running in the background. But other than that it's great.", "rating": "3", "version": "1.21.2", "date": "2017-01-14T03:36:00-07:00", "title": "Apple Watch App"}, {"content": "So basically the music on it doesn't work. Um so what happened was the music was on and it was fine and then it glitched out and the music on it turned into an an annoying humming noise, but other than that it Amazing its sooooooo cooooollll I absolutely love it I only started playing a week ago and well I've already caught 3 pikachus and a ditto yaaaayyyyyy", "rating": "4", "version": "1.21.2", "date": "2017-01-14T00:59:00-07:00", "title": "Amazing but ye"}, {"content": "WHEN IS THE BABY POKÉMON COMING OUT IVE BEEN WAITING FOR EVER", "rating": "1", "version": "1.21.2", "date": "2017-01-13T23:53:00-07:00", "title": "WHEN IS THE UPDATE"}, {"content": "If you don't t live in a town then don't bother there's like 2 pokéstops where I live unless I want to walk several miles to a town and as you expect I have no freaking pokéballs to do ANYTHING...unless I spend money but then that's no the point of the whole \"walk around and collect stuff\" \"experience\"", "rating": "2", "version": "1.21.2", "date": "2017-01-13T17:16:00-07:00", "title": "It's terrible if..."}, {"content": "1. The update adding legendaries\n2. To track your gps when you arent in the game so you can walk without worrying about your data\n3. Add generation 2 Pokémon\n4. Add more pokéstops", "rating": "4", "version": "1.21.2", "date": "2017-01-13T15:12:00-07:00", "title": "great but needs some things"}, {"content": "It's good and all but really gen 2 before the gen 1 legendarys come on no anticipation fix it", "rating": "5", "version": "1.21.2", "date": "2017-01-13T12:46:00-07:00", "title": "Needs more updated"}, {"content": "All you can catch is eats a pidgeys.  It was exciting in the beginning but now just boring!! Most people have given up with this game!! Just a fad!", "rating": "1", "version": "1.21.2", "date": "2017-01-13T10:39:00-07:00", "title": "Boring!! Just a Fad!!"}, {"content": "I have played this game since it launched and as of 23/12 update I have been unable to play. It just crashes on niantic logo. I have emailed and tweeted to which no response. Frustrating as I've payed a lot of money into playing this game, and me and my son have had lots of fun adventures. Do not update on iPhone 4s IOS 9 😡 1* until it is fixed", "rating": "1", "version": "1.21.2", "date": "2017-01-13T09:11:00-07:00", "title": "Doesn't load Niantic not helping"}, {"content": "The game was good but now I can't capture any Pokémon and when I caught an ivysaur it didn't save to pokedex", "rating": "4", "version": "1.21.2", "date": "2017-01-12T14:45:00-07:00", "title": "Ok"}, {"content": "New Pokemon ok good but not the most amazing, What would be great would be some friendly battles with friends or a way to interact with people nearby - id be interested how many people use the gyms vs how many people play the game - for me they only benefit the elite which limits the game as it's a good big feature and a lot of items/all potions are all pointless but I want to battle ..... come on guys think of a way we can battle non gym related", "rating": "2", "version": "1.21.2", "date": "2017-01-12T14:34:00-07:00", "title": "Developers try be more creative"}, {"content": "Too many bugs and glitches", "rating": "1", "version": "1.21.2", "date": "2017-01-12T14:13:00-07:00", "title": "Terrible"}, {"content": "The concept of this game is great, who'd have thought it hey? I've been playing this game from launch, however after nearing and finally completing my European Pokedex, including new egg babies the novelty has worn off. The events started great with the Halloween one, but the Christmas one was a bit of a let down. The starter event was neither good nor bad. Niantic as a company keeping their customers happy is a non thing. They really need to update or let their fan base know what's going to happen before the game really drifts off. More communication and better regular updates and this game would be 5 star.", "rating": "3", "version": "1.21.2", "date": "2017-01-12T08:20:00-07:00", "title": "Potentially 5 star"}, {"content": "Pointless app, no way to track or find Pokemon. All you can do is blindly wander around.", "rating": "1", "version": "1.21.2", "date": "2017-01-11T23:06:00-07:00", "title": "Terrible"}, {"content": "I tried to buy550 pokecoins on my iPhone 5s and paid the required £3.99 to get them. It has been almost 12 hours and they still have not showed up. I have tried everything that I could find on the internet but none of them worked. DO NOT BUY THEM YOU MIGHT GET SCAMMED", "rating": "1", "version": "1.21.2", "date": "2017-01-11T07:48:00-07:00", "title": "PLEASE HELP ME IVE BEEN SCAMMED!"}, {"content": "I'm a non Pokemon fan and I tried this out but it wasn't good for me but for a Pokemon fan it's a great game", "rating": "3", "version": "1.21.2", "date": "2017-01-10T13:00:00-07:00", "title": "Bad game"}, {"content": "I used to play pokemon go a lot but now I have gotten mostly all the Pokemon I can get in my area so the game has gotten a bit boring they need to add gen 2 then I will start playing again trying to get them", "rating": "3", "version": "1.21.2", "date": "2017-01-10T09:24:00-07:00", "title": "Great before boring now"}, {"content": "Hi I love this game so much but I have an idea which will get people playing again could you maybe do an update where it is switched for a week so mewtwo is as easy as a pidgy and pidgy is as hard as  mewtwo I hope you can take this as a idea thanks", "rating": "5", "version": "1.21.2", "date": "2017-01-10T08:43:00-07:00", "title": "I have an idea ?"}, {"content": "All my other apps work when abroad but Pokémon go just doesn't run when on holiday unless tethered from a fried or wifi", "rating": "3", "version": "1.21.2", "date": "2017-01-10T04:30:00-07:00", "title": "3G when abroad isn't strong enough"}, {"content": "Game crashes at the Niantic logo screen so completely unable to play it.", "rating": "1", "version": "1.21.2", "date": "2017-01-09T15:45:00-07:00", "title": "Game Crashes on Loading"}, {"content": "My hearing is not good and this game dips the volume of my music when it's open. \nThat being said I'm obsessed and have covered hundreds of KM since downloading it (day one of its release!) its fun, updates keep it fresh and interesting, and the gameplay works well mostly.", "rating": "4", "version": "1.21.2", "date": "2017-01-09T15:01:00-07:00", "title": "Wish it didn't dip my music volume"}, {"content": "Since updating it on the 22/12/16 my Pokemon go won't even open any longer. Really not impressed. Deleted and reinstalled loads of times still same problem", "rating": "1", "version": "1.21.2", "date": "2017-01-09T13:27:00-07:00", "title": "Rubbish"}, {"content": "I have iOS 8, but since the latest update I have been unable to open the app! It has been very frustrating as I'm not wanting to update my iOS to see if that will make a difference! Hoping the next app update will sort out the issue.", "rating": "3", "version": "1.21.2", "date": "2017-01-09T10:35:00-07:00", "title": "Was working until the latest update.."}, {"content": "Overall this is a great game, but what annoys me is how overrated it is. It isn't that good, frankly. Got a lot of flaws for example: \nProffesor Willow is a shitshow\n\nBattle system is horrible, doesn't work at all and doesn't work how pokemon games do\n\nConclusion: great game but way too overrated and it's not very composed", "rating": "3", "version": "1.21.2", "date": "2017-01-09T10:16:00-07:00", "title": "good game, horrible everything else"}, {"content": "Such a good game to play alone or out with a group. Iv had this app since it came out and haven't stopped playing yet, its very addictive and at the same time as walking about trying to find a catch or hatch and egg your exercising. Admittedly there's times Iv played it more than others but the holiday bonus events are a great way to catch up with your mates. Keep them coming Pokémon go!!", "rating": "5", "version": "1.21.2", "date": "2017-01-09T09:30:00-07:00", "title": "The Best!!"}, {"content": "Since the new update the game won't open and crashes when on the loading screen. Plz fix this", "rating": "4", "version": "1.21.2", "date": "2017-01-08T12:17:00-07:00", "title": "Good but"}, {"content": "This game is the best", "rating": "5", "version": "1.21.2", "date": "2017-01-08T11:29:00-07:00", "title": "Best Game Ever!!!!!!!"}, {"content": "Ur game is amazing a few bugs about the sound for iPhone 5/5c but I don't rlly care cuz Pokemon is my life and I love this game!10/10 recommend getting this game if you don't have it. Well don't niantic you have made a really fun game 😁", "rating": "5", "version": "1.21.2", "date": "2017-01-08T09:43:00-07:00", "title": "Heyy"}, {"content": "Absolutely crap. It fails to open the app which means I can't play while my brother can. Extremely annoying. 😡 I have tried uninstalling and reinstalling but it doesn't work. I've restarted my phone and it doesn't work.", "rating": "1", "version": "1.21.2", "date": "2017-01-08T09:41:00-07:00", "title": "This Version..."}, {"content": "I make an account and then when I try to log in it won't let me! It says it's incorrect and I have Whatever amount of attempts left. I've tried this many of times but it won't work. How do I fix this???", "rating": "1", "version": "1.21.2", "date": "2017-01-08T04:47:00-07:00", "title": "I need help."}, {"content": "I do really enjoy the game but recently my app will crashes when ever I attempt to open it", "rating": "3", "version": "1.21.2", "date": "2017-01-08T04:15:00-07:00", "title": "Crashes"}, {"content": "This app has always had problems at it's core, it has little to do with Pokémon beyond the characters, there's no sense of community, it's all about grinding through, and the maps function only works against players as you can't track Pokémon but it will penalise you for travelling too fast or not walking exactly where it wants you to. The latest update has totally ruined it by removing the ability to access PokéStops, locking country folk out of the game completely. If you live in town and like walking without meeting anyone then this is the app for you, but a fitness tracker might be better.", "rating": "2", "version": "1.21.2", "date": "2017-01-08T03:18:00-07:00", "title": "Don't bother if you don't live in town"}, {"content": "A very good game. Even though the set up takes long, the gameplay makes up for it. I would say that levelling up is kind of hard but at least u can play without a lot of lag if u are out and about (if u have Data Roaming).", "rating": "5", "version": "1.21.2", "date": "2017-01-08T01:30:00-07:00", "title": "Good game, Recommended for all ages."}, {"content": "I would like to get something else because on my holiday in America I hatched a 10km egg and I got a porygon? You can check if it was a 10 km egg as I'm not sure but can I get sent a Pokémon that is actually meant to be from a 10 km egg", "rating": "5", "version": "1.21.2", "date": "2017-01-08T00:10:00-07:00", "title": "The best game I have but...."}, {"content": "Absolutely brilliant\nHave loved it from the start", "rating": "5", "version": "1.21.2", "date": "2017-01-07T17:29:00-07:00", "title": "What a game!!"}, {"content": "Good when you hack like😝😝", "rating": "1", "version": "1.21.2", "date": "2017-01-07T11:11:00-07:00", "title": "😝😝"}, {"content": "I really like the Pokemon Go app and was looking forward to downloading it on my Apple Watch. It's a great idea to be able to get the pokestops without having to get my phone out, but this seems to have a lot of bugs in and doesn't work properly. Also I would like to see a way to catch Pokemon without using my phone. Please update with these changes instead of giving you what Pokemon are in the area and no indication where we need something similar to the nearby setup used in the phone version.", "rating": "1", "version": "1.21.2", "date": "2017-01-07T11:11:00-07:00", "title": "Disappointed"}, {"content": "I love this game since they made it better and brought like a holiday special for Christmas and New Year.\nI finally get to catch Bulbasaur, Charmander, Pikachu etc and their evolved forms where I'd never even seen one before now. Please continue to do these holiday specials, I haven't played it so much in months", "rating": "5", "version": "1.21.2", "date": "2017-01-07T09:27:00-07:00", "title": "Love the holiday specials!"}, {"content": "The original set up was awful and utterly non intuitive (date selection just didn't work).  Once I persevered for days we eventually got there).  Today, the password wouldn't work. We tried to 'change password' via the email process and, it was even more painful than original set up.  Eventually changed the password, but, it's lost all data and effectively created a new account. A disaster for my 7 year old boy (I run a digital agency so it's not due to lack of user experience - the smartphone App login process is total cr*p).", "rating": "1", "version": "1.21.2", "date": "2017-01-07T09:27:00-07:00", "title": "App login & 'lost password' process is a joke."}, {"content": "Just old, no body has it and it's sad to have", "rating": "3", "version": "1.21.2", "date": "2017-01-07T09:17:00-07:00", "title": "Good but pretty old now"}, {"content": "Had it for iPhone 5. Now the app won't open for my iPhone 6. Any chance this can be sorted?", "rating": "1", "version": "1.21.2", "date": "2017-01-07T04:09:00-07:00", "title": "Was great until I bought an iPhone 6!"}, {"content": "I haven't got the update but my friends have", "rating": "4", "version": "1.21.2", "date": "2017-01-07T03:46:00-07:00", "title": "Love the game but I haven't got the update"}, {"content": "I play Pokemon go everyday, I play Pokemon go", "rating": "5", "version": "1.21.2", "date": "2017-01-07T03:38:00-07:00", "title": "I'm back"}, {"content": "When I click on it on my mums phone it goes to the niantic screen for one second then puts me back on my phone home screen !!!its SO irritating !!!!!please fix it !!!!", "rating": "1", "version": "1.21.2", "date": "2017-01-07T03:34:00-07:00", "title": "Why won't it work"}, {"content": "On the iPhone 4 it doesn't work", "rating": "5", "version": "1.21.2", "date": "2017-01-07T02:21:00-07:00", "title": "Never works"}, {"content": "I've had the game since it came out, got bored of catching the same boring pokemone every day no matter where I went, so I found myself not using the app at all, I then had it hacked to where I could go where I want and it opened up the game for me, meaning I could catch different and new Pokemon rather than pidgey and rattata .... my account has recently been locked ... which means the app is being deleted cause it was all fun walking around at the start catching Pokemon but now, there is no point, pathetic! Learn from the hacked versions of your game because they're much better!", "rating": "1", "version": "1.21.2", "date": "2017-01-07T01:32:00-07:00", "title": "HAVK THE GAME TO MAKE IT PLAYABLE"}, {"content": "Just thank you for bringing Pokémon back! The nostalgia has made me so happy. Amazing job!", "rating": "5", "version": "1.21.2", "date": "2017-01-06T15:48:00-07:00", "title": "Thank you"}, {"content": "As many people have commented, but the developers don't seem to listen to, this is a great game to begin with but becomes tedious at higher levels. The monsters escape more quickly and The goals to achieve the next level go up in logarithmic progression. The bonus for first catch of the day and first Pokémon stop of the day are good ideas. They need to think more about this to achieve customer satisfaction.", "rating": "1", "version": "1.21.2", "date": "2017-01-06T15:42:00-07:00", "title": "Good to start with- the pants"}, {"content": "The game is amazing but I had a venasaur and dragonite and then it kicked me out of the game", "rating": "5", "version": "1.21.2", "date": "2017-01-06T15:13:00-07:00", "title": "Pokemon"}, {"content": "Improvements have been made to the app, but there's still so many bugs it's frustrating.", "rating": "1", "version": "1.21.2", "date": "2017-01-06T13:45:00-07:00", "title": "Still so many bugs"}, {"content": "I love this game because it is very unique! What I think you should add is Gen 2 pokemon, breeding, mega evolutions, shiny pokemon and legendary Pokemon. Overall a very good game! Also ignore haters!", "rating": "5", "version": "1.21.2", "date": "2017-01-06T11:20:00-07:00", "title": "WOW"}, {"content": "Please release U.K. Pokémon go Gen 2 I need it so I can catch a new Pokémon this year 2017 THX.🇬🇧👍🏻", "rating": "5", "version": "1.21.2", "date": "2017-01-06T07:32:00-07:00", "title": "Pokémon Go"}, {"content": "Im a big fan of this game and have put many hours in grindin my way to fill my pokedex but i never see ceritain pokemon the only way ive obtained them is through eggs and the rng on eggs is shocking i always seem to get the same pokemon over and over again and its really fustrating cuz with how long it takes to actually hatch an egg but other than that its an all round great game we just need more pokemon to spawn it out areas", "rating": "4", "version": "1.21.2", "date": "2017-01-06T06:33:00-07:00", "title": "All good but few niggly bits"}, {"content": "I loved this app but since I updated I can no longer open the app, it doesn't even get passed the niantic loading screen before it crashes, I've deleted and redownloaded with no change, ruined it for me tbh", "rating": "1", "version": "1.21.2", "date": "2017-01-06T05:41:00-07:00", "title": "App doesn't work"}, {"content": "This game is very good apart from a few things. When the new pokestop tracking system came out i thougt it was quite gd. Wen  i approached a pokestop there was nothing on the nearby list. However after we drove away it loaded and revealed a snorlax at the same pokestop!!!!!🙁🙁 this is not fair and it should b fixed. Also it is very hard to get candies, especially with the buddy system. The distance should b halfed or quartered like it was at halloween. Finally wen levelling up a gym u hardly level it up at all. Apart from these things it is a very good game", "rating": "4", "version": "1.21.2", "date": "2017-01-05T13:25:00-07:00", "title": "Tracking system not so reliable"}, {"content": "This game was great when it came out, then fell down a bit thanks to the tracking getting messed up and the 'you're going too fast' thing, but now thankfully it is great again. The new feature spawns Pokemon at pokestops and shows which ones they are at, so you always know where to go to find specific ones you want. They sometimes still spawn in the wild anyway, so if you aren't near pokestops you can still find some however they will often be notably less rare, e.g. Pidgeys, eevees etc. \n\nGen 2 is finally here, which is great as some of my favourite Pokemon like scizor, typhlosion and feraligatr will finally be catcheable. Got an elekid this morning from my 10k egg (noticed that these have become notably easier to obtain too). One thing that does irritate me is how rare fire types are in the UK, I've only ever caught one Ponyta in the wild, hatched two more and a magmar from eggs and still haven't got ONE charmander since the game came out!\n\nOverall, Pokemon Go is obviously being improved lots and I will continue playing. I recommend it to anyone, whether they are the best competitive battlers or completely new to Pokemon and just want an excuse to go outside. This game is not dead! The only things I suggest adding are trading and breeding as my brother has an Aerodactyl while I have a lapras, and as I prefer Aero while he prefers lapras, it would be great if we could get them. Also if possible they could add an online trading feature, like the GTS in sun and moon, so I could get Kangaskhan, Tauros and farfetch'd and vice versa for others.  Btw Team Mystic Forever👌🏻❄️🌨\n\nEdit: The new event with starters being more common has really helped me, as I have been able to finally catch some charmanders. Thanks for implementing this and I hope the game will continue to have occasional events like this one!", "rating": "5", "version": "1.21.2", "date": "2017-01-05T11:15:00-07:00", "title": "Mystic FTW"}, {"content": "I update Pokemon go to latest update and now everytime when I go on the app it just cuts out can u please fix this because it won't let me access the game", "rating": "2", "version": "1.21.2", "date": "2017-01-05T09:55:00-07:00", "title": "Pokemon go new update"}, {"content": "I thing it is a very entertaining game, but the lack of trading (either pokemons or items) and complexity of combat, and the fact that you can not fight other pokemons, is exactky what the game needs. When they add those I will rate it 5 stars.\n\nP.D. a ranking sistem woudn't hurt either...", "rating": "3", "version": "1.21.2", "date": "2017-01-05T08:06:00-07:00", "title": "Too many things missing"}, {"content": "This is my favourite game, and I play it all the time, especially with my little cousins. We always go out and play together whenever we see eachother and we both enjoy it very much. It's a lovely concept to get them outside as well as enjoying it. So I can't wait until duelling/trading is out so we can interact with eachother more in game! Overall 5/5 stars for me :)", "rating": "5", "version": "1.21.2", "date": "2017-01-04T23:32:00-07:00", "title": "BEST GAME EVER"}, {"content": "Good game when it works. I've been to about 50 poke stops in the past 3 weeks and 98% of them said try again on their 1st spin and then won't let me spin it again so I've lost out on all of the items. The help and reporting that you get from the makers off this app are absolutely crap", "rating": "1", "version": "1.21.2", "date": "2017-01-04T15:33:00-07:00", "title": "Crashes"}, {"content": "You should make it so you can trade Pokemon and be able to change team", "rating": "5", "version": "1.21.2", "date": "2017-01-04T11:43:00-07:00", "title": "PZZZ LOOK AND TAKE NOTICE😝"}, {"content": "These pokestops are now consistently 'failing' so it's difficult to get items, which means one of the only ways to play the game is through in-game purchases!! (And they keep on releasing a new update to remove the reviews whenever there are too many negative ones!) someone ought to sue them!", "rating": "1", "version": "1.21.2", "date": "2017-01-04T11:03:00-07:00", "title": "It's a scam!!!!"}, {"content": "It's such a good game", "rating": "5", "version": "1.21.2", "date": "2017-01-04T10:47:00-07:00", "title": "Pokémon go is awesome"}, {"content": "December 25th  I went out at 12.30pm went to my nearest pokestops thinking I was getting a free incubator and I didn't get 1. Very disappointed. Just downloaded on the watch and it won't work it keeps telling me to open the app on the phone and it is. Please fix. Please make it so you can have more than 1000 items in your bag if you don't go to any gyms for a while and you collect a lot of items at pokestops and it goes over 1000 even when you collect every Pokemon in sight you can't collect items at any more stops unless you get rid of items. Please let us upgrade the bag for more items. I've not been well over the new year so ive not been out a lot but  I \nwent out today to my nearest stop and the map didn't show anything so I closed the app and tried again and nothing do this means I've missed out on today's pokestop so I will have to start from the beginning again tomorrow.  This has happened before please fix.", "rating": "4", "version": "1.21.2", "date": "2017-01-04T08:34:00-07:00", "title": "Pokemon go"}, {"content": "Can't log on at all on google or trainer club plz fix I will rate 5 stars", "rating": "1", "version": "1.21.2", "date": "2017-01-04T01:14:00-07:00", "title": "Broken"}, {"content": "Brilliant game but there's only 1 problem I always seem to lend up with the same Pokémon every day and it's really hard to catch rare Pokémon and how often is mew and mewtwo gona appear", "rating": "4", "version": "1.21.2", "date": "2017-01-03T23:26:00-07:00", "title": "Pokémon"}, {"content": "🔥🔥🔥🔥🔥", "rating": "5", "version": "1.21.2", "date": "2017-01-03T22:53:00-07:00", "title": "👌👌👌"}, {"content": "I think Pokémon go is the best game ever and send me some poke coins", "rating": "5", "version": "1.21.2", "date": "2017-01-03T10:55:00-07:00", "title": "The best game ever"}, {"content": "Had 4 accounts because it KIKED ME OUT OF ALL OF THEM  slowed down my I pad 📝 AHHHHHHHH \nWOST GAME EVER .!!!", "rating": "1", "version": "1.21.2", "date": "2017-01-03T09:49:00-07:00", "title": "Do not get."}, {"content": "My six year old son has been obsessively playing Pokémon go. Collecting and powering up Pokémon. Unfortunately a glitch resulted in some of the Pokémon collected to disappear without reason. It is extremely upsetting for a child who has spent savings on buying coins in the game. Niantic support is uncontactable and does not reply to support requests.", "rating": "1", "version": "1.21.2", "date": "2017-01-03T08:22:00-07:00", "title": "Glitches causes Pokémon to disappear from collection. Uncontactable customer service."}, {"content": "I'm so hyped about gen 2 and the legends coming out in 2017. I think the only problem is that u can't catch baby Pokemon only hatch them which means if u want a togetic then u have to get 50 togepi candy to evolve I only have 1 togepi and only need elekid anyway apart from that this game is enjoyable and fun😀😀😀", "rating": "4", "version": "1.21.2", "date": "2017-01-03T05:18:00-07:00", "title": "👍This is epic👍"}, {"content": "This game was so big but died Bec of the haxed version and plus no one cared it's just dead", "rating": "2", "version": "1.21.2", "date": "2017-01-02T17:58:00-07:00", "title": "The games dead"}, {"content": "Pokemon go till I die", "rating": "5", "version": "1.21.2", "date": "2017-01-02T16:41:00-07:00", "title": "Pokemon go"}, {"content": "The most recent update won't allow me to open the app", "rating": "1", "version": "1.21.2", "date": "2017-01-02T16:23:00-07:00", "title": "Poor update"}, {"content": "Plz add a daily gift like first you get something small then everyday you go onto the game and play for 5 mins you get a daily gift but if you miss a day the prizes reset back down to day 1! (Plz add this)\n-Ryanh1425", "rating": "4", "version": "1.21.2", "date": "2017-01-02T14:05:00-07:00", "title": "Daily gift!"}, {"content": "How about the incense actually attracts the more unusual Pokémon? And the starter Pokémon are slightly more easy to catch.", "rating": "1", "version": "1.21.2", "date": "2017-01-02T12:39:00-07:00", "title": "So annoying!!"}, {"content": "I have to be honest, the game was lacking previously. It became very boring and repetitive. But now since the update of releasing new Pokemon, it's brought a new world of excitement again. I also appreciate the fact that they have released more of the original starter Pokemon in the game so that everyone will finally get a chance to not only catch them, but to actually evolve them. The only thing that STILL needs fixing is the amount of poke stops that just don't work and also when the game doesn't load properly when it's restarted - there's nothing more frustrating! I would have rated it 5 stars otherwise", "rating": "4", "version": "1.21.2", "date": "2017-01-02T12:12:00-07:00", "title": "My opinion"}, {"content": "Loved every bit of the game, yes there were a few stuff which bothered me but they fixed it. Keeps me very active and I recommend anyone to play this as it's very good. Also there adding gen 2 which is keeping me busy with.", "rating": "5", "version": "1.21.2", "date": "2017-01-02T12:08:00-07:00", "title": "Great game"}, {"content": "Getting tired of Pokemon go muting my music by about 30-40% for nothing. Highly annoying to say the least when you love to walk around with music in your ears for ages. Love the game it's a lot better but no way near where it should really be.", "rating": "4", "version": "1.21.2", "date": "2017-01-02T11:36:00-07:00", "title": "Please fix the background music issue"}, {"content": "Every time I use the watch app it crashes and stops the workout... lasts about 2 minutes before it stops... \n\nWatch app needs improving", "rating": "1", "version": "1.21.2", "date": "2017-01-02T09:47:00-07:00", "title": "Watch app crashes"}, {"content": "My bro was playing and almost got hit by a taxi I do not recommend", "rating": "1", "version": "1.21.2", "date": "2017-01-02T06:56:00-07:00", "title": "My bro almost died"}, {"content": "Stupid that I can't get pokestops while on bus...", "rating": "1", "version": "1.21.2", "date": "2017-01-02T06:10:00-07:00", "title": "City bus"}, {"content": "Whenever I see a Pokémon that I want at a poke stop I get so happy and I run there but then when I get there it just doesn't appear. Soooooooooooooooo annoying.but apart from that it's a great game!(one of the best)", "rating": "3", "version": "1.21.2", "date": "2017-01-02T03:01:00-07:00", "title": "Good but annoying"}, {"content": "Sorry to break it to you but this is a 2016 game and surprise surprise! It's 2017! It was hype for about 10 seconds, now it's a nobody. It's time to move on. The past is the past. Pokemon go is now part of history (unless there's a 2017 worthy update and everything changes, please unread (if possible) the above)", "rating": "2", "version": "1.21.2", "date": "2017-01-02T02:55:00-07:00", "title": "Get with the future"}, {"content": "I have been playing Pokémon go since 05/08/16 it takes me back when I played Pokemon red and Pokemon ruby and Pokemon stadium when I was younger and recently I caught a charizard Saturday(New Year's Eve afternoon) I even when I was younger collected Pokemon cards and my first shiny was charizard it made my Day and to start the new year in the best way possible yh you get Pokemon after Pokemon but if your a fan of Pokemon this is the game for you", "rating": "5", "version": "1.21.2", "date": "2017-01-01T16:24:00-07:00", "title": "Pokemon for life"}, {"content": "Started using the new Apple Watch app, its great as can collect from pokestops and see nearby Pokemon but it's a bit buggy as below.\n\nShowed nearby Pokemon last night but didn't tap my wrist to tell me like the settings say it will.\nThis morning opened the app on my watch and it didn't load properly, didn't show I had any eggs in incubators or a buddy to walk. Closed it and opened again it then asked me to open Pokemon go on my phone, did that and nothing happened, then clicked cancel and it all loaded fine. Watch was then showing no nearby Pokemon but my iPhone had a Squirtle on screen.", "rating": "5", "version": "1.21.2", "date": "2017-01-01T13:56:00-07:00", "title": "New Apple Watch app a bit Caterpie  (buggy)"}, {"content": "It is really good from the start of the game", "rating": "5", "version": "1.21.2", "date": "2017-01-01T13:20:00-07:00", "title": "Pokémon go"}, {"content": "This game is a waste of time, I admit it was good when it came out but now no one plays it because it's boring now. If you want my opinion I would say not to get it, it takes up so much space of your phone and unless you live in a big city or near water you never going to get anything good.", "rating": "1", "version": "1.21.2", "date": "2017-01-01T12:53:00-07:00", "title": "Poop"}, {"content": "Honestly the best iPhone game there is, been loving it since release and 7 months later still just as addicted!! So much fun highly recommend!!", "rating": "5", "version": "1.21.2", "date": "2017-01-01T11:42:00-07:00", "title": "Best game out there"}, {"content": "Don't bother unless you live in a city. They have taken away any chance for rural players to play on an equal footing with those in built up areas.", "rating": "1", "version": "1.21.2", "date": "2017-01-01T10:59:00-07:00", "title": "Only good if you live in a city"}, {"content": "The game is absolutely amazing but it would be better if they added trading", "rating": "5", "version": "1.21.2", "date": "2017-01-01T10:51:00-07:00", "title": "I wish there was trading"}, {"content": "This game used to work fine after its update, it keeps crashing and it never opens! 😡😡😡", "rating": "1", "version": "1.21.2", "date": "2017-01-01T10:48:00-07:00", "title": "Keeps crashing!"}, {"content": "The nearby pokemon thing is showing me pokemon a mile or 2 miles away why", "rating": "3", "version": "1.21.2", "date": "2017-01-01T09:36:00-07:00", "title": "Why"}, {"content": "My character has been stuck in the same place for days. I lost my streaks and no exp for days. The game is unplayable for me now.", "rating": "1", "version": "1.21.2", "date": "2017-01-01T09:20:00-07:00", "title": "Keeps saying GPS not found"}, {"content": "Best mobile game around.\n\nTO DO'S:\n-Buff Incense\n-Make Catch Rates Higher\n-Make The Servers Stable", "rating": "5", "version": "1.21.2", "date": "2017-01-01T08:55:00-07:00", "title": "Its a Love/Hate relationship"}, {"content": "Best game ever I think you will like it.😃😃😃😃😃😃", "rating": "5", "version": "1.21.2", "date": "2017-01-01T08:55:00-07:00", "title": "Best game ever I think it will be yours"}, {"content": "The game is a brilliant game but takes up to much battery please can you fix it", "rating": "5", "version": "1.21.2", "date": "2017-01-01T08:24:00-07:00", "title": "One issue"}, {"content": "After the most recent update, the app does not open at all. I have restarted my phone twice and turned of my connection too. I've decided to delete my app and re-download it. Since I'm in HongKong now instead of UK, App Store redirected me to UK App Store. However, after re-downloading the app it still only blacks out and doesn't open at all.", "rating": "5", "version": "1.21.2", "date": "2017-01-01T08:00:00-07:00", "title": "Help: App won't open"}, {"content": "Brilliant game but unfortunately it now won't work on my phone. The app won't even open anymore and it's so frustrating as the game was so good. I've done everything I can think of to try and get it to work but nothing helps, it's such a shame.", "rating": "2", "version": "1.21.2", "date": "2017-01-01T06:44:00-07:00", "title": "The app won't open"}, {"content": "Unable to get past niantic loading screen without the game crashing and force closing. Please fix.", "rating": "1", "version": "1.21.2", "date": "2017-01-01T05:43:00-07:00", "title": "crashing"}, {"content": "But since the last update, it's crippled the app. It won't even load, the niantic logo will load up for the game to crash immediately. \n\nRestarting/uninstall and install doesn't work. \n\nFYI, I'm still on the old iOS 9.2.1 which may explain why the game crashes constantly.", "rating": "2", "version": "1.21.2", "date": "2017-01-01T04:39:00-07:00", "title": "Been declining for a couple months"}, {"content": "Loving this game!!! Played it religiously when it was first released back in July last year but put it down after a while as the Pokémon popping up were getting boring and relentless! I am now back to playing it religiously and catching so many different and new Pokémon as there are now a wide variety of them popping up that wouldn't have popped up back when I started playing it. I'm still yet to see any of the new Pokémon cropping up, not sure whether they're available in the UK yet, I had a notification about Togepi popping up somewhere. One thing that's annoying me at the moment though is Pikachu wearing a Santa hat!!! I hope in the new update the hat gets removed, it's no longer Christmas!!!!", "rating": "5", "version": "1.21.2", "date": "2017-01-01T04:26:00-07:00", "title": "Love this game"}, {"content": "Ever since the update of the 22nd of december its not letting me on the app i know loads of players are always having this problem so GET IT FIXED!", "rating": "2", "version": "1.21.2", "date": "2017-01-01T03:47:00-07:00", "title": "Still wreaked update"}, {"content": "Pls can you add gyms and poke stops near Linton or in England I really want poke stops\nHere :(", "rating": "4", "version": "1.21.2", "date": "2017-01-01T03:24:00-07:00", "title": "Good but one problem..."}, {"content": "\"I want to be the very best like no one ever was\"\n\nPokémon go unlike Pokémon console games doesn't allow you to be the very best for several reasons\n\nFirstly the gym mechanics doesn't make you feel that you have the best Pokémon in the world but instead it makes you feel that you may have the best team(valor, mystic, instinct). This is because winning gym battles does not make you feel that you have achieved much from working on catching all those rare Pokémons, instead those who have alot of members on their team will \"win\".\nWinning in pokemon go is a very small accomplishment since it literally takes no skill at all(yes you have to learn how to dodge and stuff) but it takes away the strategic part of the game away unlike the console Pokémon games where there are mindgames and prediction and alot of factors such as pokemon abilities and hax moves that will make the game more diverse.\nSince the goal of Pokémon goal is to promote exercise, whats the point of that when there are  lesser and lesser people each day playing the game?\nPromoting exercise is already accomplish from hatching eggs and catching Pokémon, and now in my opinion Pokémon go should now focus on making people actually enjoy playing the game.\n\nThis can be achieved by introducing new mechanics to the game which allows you to make more use of your pokemon such as PvP.\nPvP allows people to believe that they are the very best and will introduce a new competitive sense to the game, it allows more people to spend time on the game and will increase the purpose of catching all those pokemons with high ivs which in turn will promote exercise due to more people will hatch more eggs in hope for a more competitive Pokémon. \n\nAdd shiny Pokémon\nShiny hunting in the console game has been very popular since catching one will give you so much pride and in a sense will make you feel you are the very best in achieving what so little people have achieved if you have a shiny Pokémon \nShiny hunting in console games takes a very long time and is also highly depending on luck\nPokémon go could use the shiny feature of Pokémon to their advantage to achieve their goals in promoting exercise since it will make people go mindless in hunting for all these  shinies \n\nMy opinion on the current Pokémon go roadmap\n\nIf Niantic thinks that slowly adding new generations of pokemon will increase the number of players for the long run they are wrong\n\nBy the time they reach gen3 people will see the pattern of where this is going\nIt is true that some group if people will start to play the game again in hope for getting a mudkip or torchic but after they have their swampert or blaziken they will quit again \nThis is because they will feel that there is no point catching these Pokémons if they are going to use them only for boring gym battles.\n\nIn order for more players to get into the game and keep on playing niantic needs to find a way to make the Pokémon people have caught more useful otherwise people will think that there is no point in catching all these strong pokemons\n\nIf John Hanke continues to follow his current road map for pokemon go it the game will eventually go downhill due to the reasons stated above\nTo fix this John needs to make the players feel committed in playing the game by introducing more fun features because catching Pokémon alone is not the fun aspect of the game but battling with it is.", "rating": "1", "version": "1.21.2", "date": "2017-01-01T02:47:00-07:00", "title": "My opinion on why Pokémon go is going downhill"}, {"content": "All other apps work on 4g but this one, it will say no gps when everything is turned on, ive tried everything to get this to work, your game is broke to 4g networks, cause it works just fine on wifi, please assist,ive reset the phone, deleted the app and reinstalled it, ive turned on some different thing to see if it would help, it dont seem to be affecting everyone just some people, and its not my signal or area, as my partner has the 6s+ and she can play it just fine, maybe  a issue with the iphone 7", "rating": "3", "version": "1.21.2", "date": "2017-01-01T02:20:00-07:00", "title": "Poor service with 4g"}, {"content": "my dad plays this game and he recently got an update that lets him have more pokemon i havent been given this update and neither have any of my friends", "rating": "3", "version": "1.21.2", "date": "2017-01-01T02:05:00-07:00", "title": "doesn't give me all the updates"}, {"content": "Well it's a great game but I can't get an account so please help", "rating": "4", "version": "1.21.2", "date": "2017-01-01T01:41:00-07:00", "title": "Can't get an account 📱📱📱📱📱📱"}, {"content": "Why can't I open the app since last update. Happening also to other people I know. \nSort it please we are missing the holiday Pokemon chances to play !!!!", "rating": "1", "version": "1.21.2", "date": "2016-12-31T23:05:00-07:00", "title": "App not working since last update"}, {"content": "This is the worst time to use Pokémon go. It has been saying no GPS for the last three hours.\n\nWhy would anyone try to play a game that is this bad that can't even get gps yet Facebook, iMessage knows exactly where you are. This is the worst update ever released since July 2016.", "rating": "1", "version": "1.21.2", "date": "2016-12-31T19:21:00-07:00", "title": "New Years Eve"}, {"content": "I never used to like Pokemon I thought it was an awful game, but ever since this game has come out I've been crazy for Pokemon. Now gen.2 is coming out I've been more into it than ever before. But there is just one issue, I've only got what 3 Pokestops near my house and I don't have any Pokémon on my nearby list Whitchurch aren't near Pokestops. I think you should make 2 nearby lists one for the tracking and one for the wild Pokemon.", "rating": "5", "version": "1.21.2", "date": "2016-12-31T18:58:00-07:00", "title": "Love it😍"}, {"content": "This game used to be crazy popular but where I Live by September the game died on interest and no one has even took over the gym I claimed before the game wasn't so popular can you make an update to make this game crazy again I miss the good times me playing with my friends catching Pokemon but now the game is just a bit boring when you are the only one playing it", "rating": "5", "version": "1.21.2", "date": "2016-12-31T17:58:00-07:00", "title": "The app has lost a lot of interest"}, {"content": "I'm a great fan of Pokemon go and play it as often as I can but since I got the latest update just before Christmas it will not allow me onto the game anymore I press the game to open it and It takes me back to my home screen how can I get this fixed?!!", "rating": "5", "version": "1.21.2", "date": "2016-12-31T16:33:00-07:00", "title": "Amazing game massive fan!!"}, {"content": "WHERE ARE GEN2 AND ZAPDOS?????????????!", "rating": "5", "version": "1.21.2", "date": "2016-12-31T16:29:00-07:00", "title": "😎 good but..."}, {"content": "The game is very boring and not fun because all you have got is an avatar that walks around catching Pokemon what is this suppose to meen that I am a idiot but no you really have made the world better haven't you killing people and making them want to play this game that is messed up and has took the level boring to a whole new level", "rating": "1", "version": "1.21.2", "date": "2016-12-31T15:06:00-07:00", "title": "Make the game better"}, {"content": "The game is 1000/10 epic catches and intense egg hatchings", "rating": "5", "version": "1.21.2", "date": "2016-12-31T11:53:00-07:00", "title": "Awesome"}, {"content": "After updating I can no longer open the app 😡", "rating": "1", "version": "1.21.2", "date": "2016-12-31T09:13:00-07:00", "title": "New update"}, {"content": "This game was excellent; I played it every single day and the gradual improvements were making the game more enjoyable with every update. Until this update. The latest update crashed the app and I physically cannot open the app anymore. I started a discussion thread on Reddit and there are thousands of others in the same position. If you have the option, do not update it.", "rating": "1", "version": "1.21.2", "date": "2016-12-31T06:19:00-07:00", "title": "Ruined"}, {"content": "Thanks to the new update (22nd Dec) the app will not open on my phone. Played it since July. Very annoyed. I have paid an embarrassing amount of money on this game. SORT IT OUT.", "rating": "2", "version": "1.21.2", "date": "2016-12-31T06:06:00-07:00", "title": "Latest update makes it unplayable"}, {"content": "This game is absolutely amazing. I have now stopped playing it but when i did i think it was absolutely fabulous. Definitely worth the 5 stars.", "rating": "5", "version": "1.21.2", "date": "2016-12-31T04:51:00-07:00", "title": "Great"}, {"content": "Rubbish game.", "rating": "1", "version": "1.21.2", "date": "2016-12-31T04:46:00-07:00", "title": "Boring"}, {"content": "Just updated the game, now it keeps crashing ... Gutted. Could you fix this bug? Missing this fun game😕", "rating": "4", "version": "1.21.2", "date": "2016-12-31T04:06:00-07:00", "title": "Was great"}, {"content": "Watch app needs more work. Very buggy. Fails to pick up account from phone. Says \"Open Pokémon Go on iPhone\" even when it's open. Freezes on watch. Uninstalling until issues are fixed.", "rating": "3", "version": "1.21.2", "date": "2016-12-31T02:34:00-07:00", "title": "Watch App Buggy"}, {"content": "Forced to update to the latest version and now it won't even load. Embarrassingly poor!", "rating": "1", "version": "1.21.2", "date": "2016-12-31T01:44:00-07:00", "title": "Completely broken"}, {"content": "When I download the game it shows up as the loading screen and then the game crashes!!!   Please Fix!\n\nAlthough I do think the game is really good and I will continue playing as soon as it is fixed!  :)", "rating": "3", "version": "1.21.2", "date": "2016-12-30T17:09:00-07:00", "title": "Won't open"}, {"content": "Sweet just a tiny bit lag", "rating": "5", "version": "1.21.2", "date": "2016-12-30T17:06:00-07:00", "title": "Great game"}, {"content": "This game is peak.", "rating": "1", "version": "1.21.2", "date": "2016-12-30T15:25:00-07:00", "title": "Peak"}, {"content": "Haven't been able to open the app on my iPhone 5S since the update on the 22nd. When I click on the app it crashes and closes without even getting to a loading screen. This is extremely frustrating because I am missing out on the Christmas event. Please hurry up and fix this!", "rating": "1", "version": "1.21.2", "date": "2016-12-30T14:34:00-07:00", "title": "Please fix this bug!!"}, {"content": "I can't register at the start so I can't actually play the game 😕😕😕", "rating": "2", "version": "1.21.2", "date": "2016-12-30T14:17:00-07:00", "title": "Can't register"}, {"content": "This game is dead now", "rating": "1", "version": "1.21.2", "date": "2016-12-30T12:34:00-07:00", "title": "#DEAD"}, {"content": "I love this game bit once you have completed gen 1 pokedex you get 100 poke coins and unlock gen 2?? \nBy mishas brother moscil hi ha hi ha hi", "rating": "5", "version": "1.21.2", "date": "2016-12-30T12:31:00-07:00", "title": "Great but......"}, {"content": "If you still play this game then you must be gay", "rating": "1", "version": "1.21.2", "date": "2016-12-30T12:08:00-07:00", "title": "Pokemon"}, {"content": "I have been playing Pokémon for 5 months now and recently the catch rate has become unbearable......of the last 7 Pokémon 5 ran away this time and this catch ratio is nothing unusual these day..... really not good enough and a great way to stop people playing......", "rating": "1", "version": "1.21.2", "date": "2016-12-30T10:52:00-07:00", "title": "Not good enough!"}, {"content": "It would be good if we can connect to FACEBOOK friends because that will make it competitive and also it would be good if we can send gifts to each other, sometimes take longer to load and sometimes it take long to load when clicking on a Pokémon. I like the new events.", "rating": "4", "version": "1.21.2", "date": "2016-12-30T10:41:00-07:00", "title": "Good update"}, {"content": "I almost got hit by a train 🚂 and died but this game is fun.....I guess", "rating": "2", "version": "1.21.2", "date": "2016-12-30T10:39:00-07:00", "title": "Almost died"}, {"content": "Its fun at first but it gets boring", "rating": "3", "version": "1.21.2", "date": "2016-12-30T10:00:00-07:00", "title": "Good"}, {"content": "It's been weeks since I emailed about a issues with the app shutting down and u have not gotten back to me some support that is", "rating": "2", "version": "1.21.2", "date": "2016-12-30T09:15:00-07:00", "title": "Rubbish"}, {"content": "This game is copywrite of Pokémon go I swear it's even got the same name I mean what the hell 😱", "rating": "1", "version": "1.21.2", "date": "2016-12-30T08:51:00-07:00", "title": "Copywrite"}, {"content": "This game I used to to play but after the most recent a update I can't play anymore so fix this bug plz", "rating": "2", "version": "1.21.2", "date": "2016-12-30T08:41:00-07:00", "title": "Pokemon go is bad"}, {"content": "I updated the app yesterday as suggested. Since then the app refuses to open. I have been unable to play because of this.", "rating": "1", "version": "1.21.2", "date": "2016-12-30T06:03:00-07:00", "title": "App error"}, {"content": "I have played Pokemon Go since the release and it's been good but it's keeps crashing on my iPhone 4s which has the update 9.3.5. What happens is that the sign that comes up on the game \"do not do this or that......\" And i press ok but it crashes the game putting into mind that my iPhone works well with every other game so please fix!", "rating": "5", "version": "1.21.2", "date": "2016-12-30T04:33:00-07:00", "title": "Please fix a bug but game is amazing!"}, {"content": "This is a fantastic game. Don't listen to the haters who say 'uh, no trading, not like original' THEY WILL COME IN FUTURE UPDATES BE PATIENT. It's brilliant, but unfortunately there's one thing. When I swipe a Pokestop for the first time, it says 'Try again later' even if I haven't ever swiped it before. And after it does this, all the Ppkemon on my nearby list disappear. Please fix!!! Other than that, great game!", "rating": "4", "version": "1.21.2", "date": "2016-12-30T04:27:00-07:00", "title": "Amazing"}, {"content": "Hi I've got a good idea for Pokemon go instead of paying for poke coins what ever the CP for the Pokemon is that's how many poke coins you get so that means you can get more stuff please it will make it easier to play", "rating": "5", "version": "1.21.2", "date": "2016-12-30T03:57:00-07:00", "title": "Improvements"}, {"content": "Does not start", "rating": "1", "version": "1.21.2", "date": "2016-12-30T03:38:00-07:00", "title": "Does not start for some time now"}, {"content": "Very good but since a few days ago I have not been able to play it keeps saying no signal", "rating": "5", "version": "1.21.2", "date": "2016-12-30T03:35:00-07:00", "title": "Good game"}, {"content": "Just upgraded to the most recent version and it won't even open the app now!", "rating": "1", "version": "1.21.2", "date": "2016-12-30T03:14:00-07:00", "title": "Don't upgrade"}, {"content": "Omg", "rating": "5", "version": "1.21.2", "date": "2016-12-30T03:10:00-07:00", "title": "Omg"}, {"content": "Firstly, I love the game however I have just updated it and it no longer works. Every time I open it, it shows the niantic logo for a second then crashes (IPhone 6 so it's not too old a phone)", "rating": "1", "version": "1.21.2", "date": "2016-12-30T02:49:00-07:00", "title": "Temp review"}, {"content": "Ever since the upgrade. It seemed not working properly as it keeps shutting down every time you log out ! The worst thing is you can't get back in?????? What a waste of time !!!!!!!! Now I gave up playing the game now....", "rating": "1", "version": "1.21.2", "date": "2016-12-30T02:42:00-07:00", "title": "Waste of time"}, {"content": "Pokemon go is a good game but has stopped working for me I don't know how but when I try and open the app up it turns off someone sort it please it is my favourite game too play when I can", "rating": "3", "version": "1.21.2", "date": "2016-12-30T02:17:00-07:00", "title": "Stopped working"}, {"content": "Since I updated the app I can now no longer open the app. I've turned my phone on and off, deleted the app and reinstalled, and it's still not working. Not happy at all!", "rating": "1", "version": "1.21.2", "date": "2016-12-30T02:08:00-07:00", "title": "Broken app"}, {"content": "I've been playing from day one on a daily basis, fitness has improved since playing.  With the latest version, it won't load on iOS... Help!!!!", "rating": "1", "version": "1.21.2", "date": "2016-12-30T01:41:00-07:00", "title": "Just won't load..."}, {"content": "Having played this game since release, I have been continuously let down by the shoddy development.\n\nEven now Dec 16' the game still crashes out, eggs start to hatch and disappear, the touch selection on the map is endlessly infuriating and catching Pokemon of any level with the \"appropriate\" pokeball is still largely pot luck.\n\nNiantic have been very slow to fix bugs and have focused their efforts on wearables and other endeavours as opposed to the game.\n\nThe game is an overly simplistic entry to the Pokemon franchise and it's clear that niantic are only interested in the in-app purchases that players are making.\n\nI played over the holiday break and have now deleted it from my phone, let's hope they see sense in the future and make the vast improvements the game deserves for the players that are still interested.\n\nAbsolutely disgraceful.", "rating": "1", "version": "1.21.2", "date": "2016-12-30T01:36:00-07:00", "title": "Boring, unimaginative cash cow"}, {"content": "I'm fed up! I was really enjoying playing Pokémon on my iPhone but it takes up loads of memory. The programme insists on upgrading to the new version before I can play again but I haven't enough memory for the upgrade!! Injury can't we have an option to upgrade, not a requirement before you can continue to play? I shall delete this game sadly.", "rating": "1", "version": "1.21.2", "date": "2016-12-30T01:10:00-07:00", "title": "Pokémon"}, {"content": "I've updated and not working", "rating": "1", "version": "1.21.2", "date": "2016-12-29T23:31:00-07:00", "title": "Not working"}, {"content": "What a complete waste. Game has gone downhill massively in recent weeks and now won't load at all.", "rating": "1", "version": "1.21.2", "date": "2016-12-29T21:33:00-07:00", "title": "Won't open since update."}, {"content": "This game is not bad but is very boring easily especially people who dont have wifi.please let it need no wifi", "rating": "2", "version": "1.21.2", "date": "2016-12-29T17:45:00-07:00", "title": "Boring"}, {"content": "It takes forever to find Pokemon I can't belive this is a thing So many bad things have happened death, mugging and people getting hack and how you level up is wrong absolutely hate it!!!!!", "rating": "1", "version": "1.21.2", "date": "2016-12-29T16:31:00-07:00", "title": "Terrible"}, {"content": "I've loved this game since it was first released and I've been playing it for months since... Many of these reviews are positive and mine is too, I love the game. I've recently updated the game and I've noticed that the in-game music has dissapeared it says in settings that it's on but I'm getting nothing. The sound on my phone is on but still nothing, hopefully you would be able to fix this in the new update.", "rating": "5", "version": "1.21.2", "date": "2016-12-29T16:14:00-07:00", "title": "Amazing, one note"}, {"content": "So good. Good for your health ❤️ so fun catch them all!!!", "rating": "5", "version": "1.21.2", "date": "2016-12-29T15:55:00-07:00", "title": "Amazeballs"}, {"content": "I've seen a lot of bad reviews but only by people that can't get the app to work. I've had no trouble using an iPhone 5S. So I'd recommend giving it a go as it should work for most people. If your using a really old device or have very little storage it probs won't run correctly. Also don't expect it to work amazingly with the Apple Watch as there aren't many features but then again that's the Apple Watch for you; stop being lazy and use your phone.", "rating": "5", "version": "1.21.2", "date": "2016-12-29T15:50:00-07:00", "title": "Good as my phone can run it"}, {"content": "Ever since the last update, every time I open the app it just says that there is no GPS signal and my character is standin in totally blank space. Unplayable.", "rating": "1", "version": "1.21.2", "date": "2016-12-29T14:48:00-07:00", "title": "No GPS signal since last update"}, {"content": "Latest update causing my phone to seize (iPhone 6). Can't play game at all. Screen locks on start up page.  Then if does anything at all it just closes. Uninstalled app and reinstalled many times now but no joy. Restarted phone etc. Really annoyed as been playing since release. Please sort this out!!", "rating": "1", "version": "1.21.2", "date": "2016-12-29T14:35:00-07:00", "title": "Latest update"}, {"content": "This game is great I have played it since release date and still enjoy it as much now I will still go out for hours to play it and I think the Apple Watch feature is very good if your in a awkward place where you can't get your phone out all the time also it tracks km's amazing keep up the good work niantic recommended to all to play", "rating": "5", "version": "1.21.2", "date": "2016-12-29T14:10:00-07:00", "title": "Great game played it since release"}, {"content": "After the latest update, every single time I try to open the app, it just crashes. When I click on it, it goes onto the loading screen for a couple of seconds, but then crashes. I used to play Pokemon Go every day, but now I can't play it at all. I've tried restarting my phone, deleting the app and installing it again, but I can't get it to stop crashing.", "rating": "1", "version": "1.21.2", "date": "2016-12-29T13:40:00-07:00", "title": "Doesn't work after new update"}, {"content": "Updated now can't play what a joke, if only the creators had not of been niantic this game could of been amazing! Sort it out niantic it's appalling!", "rating": "1", "version": "1.21.2", "date": "2016-12-29T13:16:00-07:00", "title": "Appalling"}, {"content": "Developers, great game honestly, but please let us have a daily log-in bonus reward system in where you can get like 1-5 pokeballs a day or pokecoins.                                   Thank you!", "rating": "3", "version": "1.21.2", "date": "2016-12-29T10:37:00-07:00", "title": "One thing..."}, {"content": "A brilliant game for kids and adults! A bit annoying when It says gps signal not found. Because then you can't do anything!! It also gives you good exercise if you want to go searching for the  \npokestops!!😆", "rating": "4", "version": "1.21.2", "date": "2016-12-29T10:16:00-07:00", "title": "Livvy"}, {"content": "What even is this game catching the Pokemon is fun but the character don't even move I ran so far but the character just stood still. Lame", "rating": "1", "version": "1.21.2", "date": "2016-12-29T05:58:00-07:00", "title": "Worst game ever"}, {"content": "My 16-year-old son died when trying to catch a Christmas Pikachu some robbers stole his phone and talking that way I know this because they tried calling the cops some people in a van that had cages inside", "rating": "1", "version": "1.21.2", "date": "2016-12-29T04:51:00-07:00", "title": "Died"}, {"content": "Spent. 3 hours just trying to pick my starter Pokemon and when I choose my Pokemon they are all in each other", "rating": "1", "version": "1.21.2", "date": "2016-12-29T03:58:00-07:00", "title": "Crap"}, {"content": "I could give no star for this version if I can. Dont update to this version, I still cannot open this app after updated.", "rating": "1", "version": "1.21.2", "date": "2016-12-29T03:07:00-07:00", "title": "review"}, {"content": "I PLAY POKEMON GO EVERYDAY I PLAY PIKEMON GOO WHEN I WAKE UP IM GRABBING MY PHONE I WANNA CATCH EM ALL I WANT TO PLAY POKEMON ALL DAY LONG ALL DAY LONG I PLAY POKEMON GO EVERYDAY I PLAY POKEMON GO", "rating": "3", "version": "1.21.2", "date": "2016-12-29T02:50:00-07:00", "title": "I'm back..."}, {"content": "appalling apple watch component keeps crashing. im not even going to play it no longer, way way way too many bugs", "rating": "1", "version": "1.21.2", "date": "2016-12-29T02:39:00-07:00", "title": "apple watch component keeps crashing everytime"}, {"content": "[Misha]\nI'm back\n\n[Chorus]\nI play Pokemon Go every day\nI play pokemon Go\nI play Pokemon Go every day\nI play pokemon Go\n\n[Verse 1: Misha]\nWhen I wake up\nI'm grabbing my phone\nI wanna catch 'em all\nI wanna play Pokemon\nAll day long, all day long\n\n[Chorus]\nI play Pokemon Go every day\nI play pokemon Go\nI play Pokemon Go every day\nI play pokemon Go\n\n[Guitar Solo by Metadon]\n\n[Chorus]\n\nI play Pokemon Go every day\nI play pokemon Go", "rating": "5", "version": "1.21.2", "date": "2016-12-28T17:13:00-07:00", "title": "I PLAY POKEMON GO EVERYDAY"}, {"content": "I live in a rural area. My nearest Pokestop is 15 mins walk away, the next one after that is another 15 mins - I'm looking at an hour's walk just to hit two Pokestops that never give out eggs and are extremely tight on the Pokeballs. As such it's very limiting what I can do on the game. I used to rely on \"drive-by\" Pokestops when I am a passenger in the car (husband driving) but thanks to the update, there's now a \"speed limit\" on the game meaning you can't use Pokestops over a certain speed and Pokémon don't spawn. This means I very rarely have any opportunity to play the game now. I have no Pokeballs left and no eggs, and now very few and far between chances to hit Pokestops to stock up. I have 18 month old twins so getting out and about isn't the easiest and frankly I can now no longer be bothered with Pokémon Go thanks to the update. No fun.", "rating": "1", "version": "1.21.2", "date": "2016-12-28T15:23:00-07:00", "title": "No good for non-city dwellers"}, {"content": "Pretty gay bruv", "rating": "2", "version": "1.21.2", "date": "2016-12-28T15:19:00-07:00", "title": "?"}, {"content": "Watch app is very buggy. \nOpen app, press start and it starts counting. Works for about 30 seconds look back down and it's back on the start screen. Press start again and it does the same thing. Then I get the screen saying 'open Pokémon go on phone'.\nSince app has launched I've used it successfully twice.\nEnd up just using phone...\nPlease fix.", "rating": "3", "version": "1.21.2", "date": "2016-12-28T14:11:00-07:00", "title": "Watch app needs work..."}, {"content": "I was playing this from when it was realeased but since the buddy update my phone has been incompatible and can't even download this on my iphone to play please do a version for all phones", "rating": "2", "version": "1.21.2", "date": "2016-12-28T14:11:00-07:00", "title": "Was ok but issue"}, {"content": "I played the original pokemon red and I loved it this game is not the same as the originals however I walk a lot so it is perfect and fun the People who said it was not a good game are just really lazy", "rating": "5", "version": "1.21.2", "date": "2016-12-28T11:54:00-07:00", "title": "The best game ever"}, {"content": "Every time I open the app it goes back off it. Doesn't even load the page before going back on the home screen. I've tried deleting the app and downloading it again several times &\nHave tried refreshing my phone, just won't work whatever I try. Don't know what's going on.", "rating": "2", "version": "1.21.2", "date": "2016-12-28T09:50:00-07:00", "title": "Help?"}, {"content": "Works well but doesn't work at all on 4s", "rating": "3", "version": "1.21.2", "date": "2016-12-28T09:43:00-07:00", "title": "Glitches!!!!!"}, {"content": "Crashes about a second after I load the game ),:", "rating": "1", "version": "1.21.2", "date": "2016-12-28T09:14:00-07:00", "title": "Crashes"}, {"content": "THIS IS RLLY FRUSTRATING BECAUSE I SAW A MR MIME AND I DONT HAVE ONE AND I HAD NO POKEBALLS SO I COLDNT CATCH IT SO I BOUGHT SOME AND IT KEPT MAKING ME PAY AGAIN AND AGAIN AND WHEM I FINNALY GOT THEM, THE MR MIME WAS GONE!!!😡😡😡😡😡😡😡😡😡😰😰😰😰😰😰😰", "rating": "1", "version": "1.21.2", "date": "2016-12-28T09:06:00-07:00", "title": "GGGGGRRRRRRRRR"}, {"content": "I found a ditto when capturing a  sparrow thing. Other than that it was ok", "rating": "4", "version": "1.21.2", "date": "2016-12-28T08:06:00-07:00", "title": "Ummmm"}, {"content": "Like a lot of people I have played this game from the release.. both me and my son loved playing it BUT now things have changed .. 1 my son can't play it anymore while we are going anywhere in the car wither it be only collecting pokastops or looking for any new ones about ... everything now goes blank and says try again later ... now I get the safety thing about not using while driving but that's what the passenger bit was for .. 2 new Pokémon come on 4-5 doesn't count as new... your killing a what was a decent game SORT IT OUT", "rating": "2", "version": "1.21.2", "date": "2016-12-28T07:09:00-07:00", "title": "Ruined a good game 😢"}, {"content": "You should add mini games for Pokemon to earn more candies and other ways to earn poke coins", "rating": "4", "version": "1.21.2", "date": "2016-12-28T05:50:00-07:00", "title": "Add more stuff"}, {"content": "This app has stopped working since the last update. I can delete the app now. To be fair, it was a fantastic game, but it doesn't work anymore. 1 star for the update, 5 star for the game itself.", "rating": "1", "version": "1.21.2", "date": "2016-12-28T03:52:00-07:00", "title": "Keep crashing, worst update ever"}, {"content": "Is there any chance of some new pokestops/gyms? Only, I live in kettlethorpe, Wakefield, uk, and there's none of either around me at all... frustrating.", "rating": "5", "version": "1.21.2", "date": "2016-12-28T03:43:00-07:00", "title": "Pokemon!"}, {"content": "I owuld even bother to outline the hundreds of bugs and issues teh game has, buty the developers don't give a single flying about them, the only point is to GET MORE MONEY, without having to do anything and this updfate is just an other exmaple!\nthe pokemons are just bloody white circles around a piece of shadow way to ofetn, having me relaunch the game too often. these buddy pokemons are so absolutely useless as well as despite their promise they simply NOT REGISTERING your movemenet 80% of the times! last example being when my buddy was at 3.6KM, I've incubated a 5KM egg and when my egg hatched the poemon was at 4.1KM like what the actual....?", "rating": "1", "version": "1.21.2", "date": "2016-12-27T18:23:00-07:00", "title": "GARBAGE GAME FROM USELESS DEVS"}, {"content": "After updating the app won't even open anymore.", "rating": "1", "version": "1.21.2", "date": "2016-12-27T15:55:00-07:00", "title": "It's broken!!!!!!!"}, {"content": "Great game and gets you out and about, it crashes from time to time but still fun to play", "rating": "5", "version": "1.21.2", "date": "2016-12-27T15:02:00-07:00", "title": "Great game"}, {"content": "I use my iPhone and since the Dec 22 update the app won't open or load, and I have done everything to try to fix it. I'm very upset as I'm missing out. I've restarted by phone and reinstalled the app, nothing", "rating": "1", "version": "1.21.2", "date": "2016-12-27T14:28:00-07:00", "title": "Won't load or open"}, {"content": "To be honest the poke stops are like playing a stress game because when you drive by them they never give you anything, saying that you have to try again later", "rating": "2", "version": "1.21.2", "date": "2016-12-27T13:23:00-07:00", "title": "Voldaar69"}, {"content": "Have enjoyed playing this with the children since July. Latest update has just downloaded and now it won't even open. Not impressed!", "rating": "2", "version": "1.21.2", "date": "2016-12-27T12:49:00-07:00", "title": "Won't open!"}, {"content": "Ever since I updated the app it crashes as soon as I open it, restarting my phone hasn't fixed it nor has deleting the app and downloading it again.\n\n(Also the \"free incubator\" promotion didn't work at all when I used pokestops, and I had downloaded the new update because the store was broken and not displaying the new Christmas bundle gifts)", "rating": "1", "version": "1.21.2", "date": "2016-12-27T10:37:00-07:00", "title": "App Won't Open"}, {"content": "Patience with this game being severely tested after  constant app crashes. Fix asap.", "rating": "1", "version": "1.21.2", "date": "2016-12-27T10:19:00-07:00", "title": "Crashes after update"}, {"content": "Game crashes straightaway after the Niantic logo disappears. Disappointed that I cannot play on my time off during Xmas holidays and I am missing out on the daily free incubators. One star till Niantic fixes the bug!", "rating": "1", "version": "1.21.2", "date": "2016-12-27T09:37:00-07:00", "title": "Latest update is bugged!"}, {"content": "Logging in is a complete nightmare its so frustrating that I deleted it after 20 seconds", "rating": "1", "version": "1.21.2", "date": "2016-12-27T09:09:00-07:00", "title": "WORST"}, {"content": "Completely unusable since the most recent update.\nIf it gets past the loading screen it crashes almost immediately. \n\nI am using the most recent IOS on a new phone with lots of space so I am sure its the app.", "rating": "1", "version": "1.21.2", "date": "2016-12-27T08:27:00-07:00", "title": "Unusable"}, {"content": "Since this update we've not been able to open the game once despite deleting and reinstalling it countless times! Fancy being out an update that stops people being able to play!!", "rating": "1", "version": "1.21.2", "date": "2016-12-27T07:45:00-07:00", "title": "Christmas update"}, {"content": "I can't listen to any podcasts when walking around because the volume goes down when the app opens. Why on earth would you add this to an app that you have to walk around outside with?!?", "rating": "1", "version": "1.21.2", "date": "2016-12-27T07:06:00-07:00", "title": "Volume goes down when the app opens"}, {"content": "When go for a walk Apple Watch doesn't count my steps on Pokémon go app??", "rating": "3", "version": "1.21.2", "date": "2016-12-27T07:00:00-07:00", "title": "Apple Watch app"}, {"content": "I really like this app!😁 but, it's really annoying me as I want to change which gym I belong to ,but I can't do this without starting over!😭can you make an update with the option of changing gyms?! Please!🙏🏼", "rating": "4", "version": "1.21.2", "date": "2016-12-27T06:50:00-07:00", "title": "Good!😁"}, {"content": "Game has a glitch need to fix this please as can't play at all all Pokemon are on top of each other!!", "rating": "1", "version": "1.21.2", "date": "2016-12-27T06:36:00-07:00", "title": "Default"}, {"content": "U really need to put more poka stops and a gym in Linton on Ouse", "rating": "4", "version": "1.21.2", "date": "2016-12-27T06:27:00-07:00", "title": "Good but..."}, {"content": "Sooo addictive and really fun! Niantic need to reduce the amount of pidgies though! The amount you see all around is unbelievable and a bit OTT cos everybody knows they are common but seriously? Really fun overall! Download!", "rating": "5", "version": "1.21.2", "date": "2016-12-27T06:15:00-07:00", "title": "Download it. Now."}, {"content": "Not even been able to play since I done this new update only loads to the niantic page then cuts off very frustrating tryd a few things to fix it but nothing working cba with it anymore", "rating": "1", "version": "1.21.2", "date": "2016-12-27T05:14:00-07:00", "title": "Not working"}, {"content": "I'm sick to death of this game crashing. Every time I go past a pokestop it's says try again later, which means I'm running out of pokeballs. I'm not spending anymore money on pokeballs. No wonder people have stopped playing this game. 😡😡", "rating": "2", "version": "1.21.2", "date": "2016-12-27T04:45:00-07:00", "title": "Game crashing every time I play it."}, {"content": "Updated on 22/12/16. Haven't been able to play since as it keeps snapping shut on the niantic screen! Really peed off!!!", "rating": "1", "version": "1.21.2", "date": "2016-12-27T02:45:00-07:00", "title": "Game ruined!!!"}, {"content": "I downloaded this way back in July 16 and have played it everyday since. I love that the updates bring something new each time and I feel they listen to fans to make it even better. It's fun, addictive and it gets you out walking and exploring different places.", "rating": "5", "version": "1.21.2", "date": "2016-12-27T01:35:00-07:00", "title": "My most played app ever"}, {"content": "Someone help me I don't know what to do this game is amazing but then my phone updated Pokemon go and it won't even let me play Pokemon go it's really annoying because I actually love this game but I can't even get on it", "rating": "3", "version": "1.21.2", "date": "2016-12-27T00:31:00-07:00", "title": "HELP ME !!!"}, {"content": "Latest update does not work even after deleting and reinstalling. I have one unhappy boy!", "rating": "1", "version": "1.21.2", "date": "2016-12-26T23:47:00-07:00", "title": "Latest update"}, {"content": "Addictive to start off with but like all games - got boring and YOU should know what this game is all about by now, only the top selling phone game of 2016.", "rating": "3", "version": "1.21.2", "date": "2016-12-26T18:12:00-07:00", "title": "Why are you looking at reviews on this!!!"}, {"content": "Very addictive game and keeps you active by getting you to go outside and try to catch them all.", "rating": "5", "version": "1.21.2", "date": "2016-12-26T13:59:00-07:00", "title": "Very Good Game"}, {"content": "Can you fix the lag on the pokestop and the sighting list, can't get any pokestop or Pokemon spawning with full bar of 4G connection. No GPS signal as well with full connection.", "rating": "2", "version": "1.21.2", "date": "2016-12-26T11:38:00-07:00", "title": "Lag"}, {"content": "Freezes frequently on both phone and pad and gym crashes constantly error out preventing you from battling, they really need to properly release 2nd gen now as it is getting boring catching the same Pokémon over and over", "rating": "2", "version": "1.21.2", "date": "2016-12-26T08:33:00-07:00", "title": "Unplayable"}, {"content": "I used to be a big fan of this game. I was rather good actually I had dragonite, gyrados and snorlax etc. That was until my account locked me out, I went to play the game and it asked for my password. I entered my password correctly (as I had written it down previously) then the game would close. I tried many, many times and was always given the same result. Good to start with but beware getting locked out your account.", "rating": "1", "version": "1.21.2", "date": "2016-12-26T07:30:00-07:00", "title": "Extremely Disappointed"}, {"content": "I updated my app and now it will not load! It crashes on the niantic load up screen meaning I cannot access the app at all and am therefore missing out on the new event! Please fix this! :(", "rating": "1", "version": "1.21.2", "date": "2016-12-26T07:19:00-07:00", "title": "New update causes crashing!"}, {"content": "This game is absolutely terrible", "rating": "1", "version": "1.21.2", "date": "2016-12-26T05:57:00-07:00", "title": "Really bad game"}, {"content": "Great game to keep me occupied on my travels to work and encourages me to go for runs more often to hatch them eggs lmao still a lot of improvements that can be made but I'm sure they're working on them, out with the normal suggestions trading etc I'd like to see little changes like being able to see the gym location of Pokemon you have in gyms without having to be near them since I tend to affect and adding status affect during battles would be an interesting addition. Either way I look forward to future updates :)", "rating": "4", "version": "1.21.2", "date": "2016-12-26T05:27:00-07:00", "title": "Addictive but room for improvement"}, {"content": "Pokémon is a fantastic go get em kind of game that has me playing months after release , my daughter has started playing too she's six and loves it!", "rating": "5", "version": "1.21.2", "date": "2016-12-26T04:49:00-07:00", "title": "Awesome!"}, {"content": "this game has taken over my entire life I LOVE THIS GAME THX Niantic", "rating": "5", "version": "1.21.2", "date": "2016-12-26T03:25:00-07:00", "title": "Review:Pokémon GO"}, {"content": "Such an amazing game! I love it and play it most days - addictive! Also I find you never run out of things to do! I think you should be able to sync the game with a Fitbit or similar device though so the eggs hatch based on how much you actually walk In a day not based on how much you walk with the game open as you end up using all your battery and all of you data usage, but overall I love the game!", "rating": "5", "version": "1.21.2", "date": "2016-12-26T03:02:00-07:00", "title": "Really good game"}, {"content": "It is crap because it won't let me play it because I'm on a iPhone 4s!!!!", "rating": "1", "version": "1.21.2", "date": "2016-12-26T01:51:00-07:00", "title": "😔"}, {"content": "Pokemon go is already so good i loged out because i wanted to join team instinct so i done that and now i get this", "rating": "3", "version": "1.21.2", "date": "2016-12-26T01:33:00-07:00", "title": "Pokemon go is good"}, {"content": "Wish I could change team. I had no choice in my team as a mate chose which team I was on! Update needs too have a chance too at change team at least once!", "rating": "3", "version": "1.21.2", "date": "2016-12-25T21:37:00-07:00", "title": "Change teams"}, {"content": "Getting really boring now", "rating": "1", "version": "1.21.2", "date": "2016-12-25T19:33:00-07:00", "title": "Needs new update"}, {"content": "After playing happily for months, I installed the latest update only to find that I can no longer play. \nThe game crashes after the initial 'Niantic hot air balloon' screen. \nI've deleted the game and reinstalled but it is still the same. My son is absolutely gutted; to make matters worse I done the update in Christmas Day for him. So great, Happy Christmas son, your favourite game is broken! Thanks a lot! \nThis needs fixing ASAP!!!", "rating": "1", "version": "1.21.2", "date": "2016-12-25T18:51:00-07:00", "title": "Game won't play after new update!"}, {"content": "Since the latest update The app opens and shuts off straight away without even loading up. Please fix :(   I thought it was just my phone at First but I've tried everything And just read reviews and lots have the same issue.", "rating": "1", "version": "1.21.2", "date": "2016-12-25T18:17:00-07:00", "title": "Disappointed :("}, {"content": "What happened to the Christmas event ?", "rating": "1", "version": "1.21.2", "date": "2016-12-25T14:40:00-07:00", "title": "App failure"}, {"content": "Absolutely awful company that unfortunately have their finger prints all over the Pokemon franchise. Game has potential too, shame they are holding it back through sheer greed and incompetency!", "rating": "1", "version": "1.21.2", "date": "2016-12-25T14:03:00-07:00", "title": "Niantic Awful!"}, {"content": "Love the game, love Niantic (big Ingress player) but since the 'Apple watch' update (I don't even have one) the app won't even open, it crashes within a split second. Have tried reinstalling and restarting my iPhone. No luck. Cannot access Pokemon Go.", "rating": "1", "version": "1.21.2", "date": "2016-12-25T13:48:00-07:00", "title": "Broken since update"}, {"content": "I still love the game", "rating": "5", "version": "1.21.2", "date": "2016-12-25T13:31:00-07:00", "title": "Good game"}, {"content": "Fantastic addictive collection game. Loving the Apple Watch integration and all the special events being added. Keep it up!", "rating": "5", "version": "1.21.2", "date": "2016-12-25T12:41:00-07:00", "title": "Fantastic with Apple Watch"}, {"content": "Awesome. So much fun and love playing it.", "rating": "5", "version": "1.21.2", "date": "2016-12-25T12:11:00-07:00", "title": "Great game!"}, {"content": "Introduce a joystick or d pad or some sort from 8pm until 12am. Or times around those, it's getting incredibly dark incredibly quick. I really want to play but can't because of the weather and risk of being robbed in the late hours. Please niantic!", "rating": "3", "version": "1.21.2", "date": "2016-12-25T11:58:00-07:00", "title": "My favourite game - needs some adjustments"}, {"content": "The game was great when it first came out and I do still play but where is Gen 2? The same Pokémon over and over again is very boring zzzz", "rating": "3", "version": "1.21.2", "date": "2016-12-25T10:38:00-07:00", "title": "Disappointed with repetitive gameplay"}, {"content": "This game just crashes I can't even play the game at all plzzzz what's wrong with this game how do you fix this do I even need a newer iPad or something??????", "rating": "1", "version": "1.21.2", "date": "2016-12-25T10:34:00-07:00", "title": "Why????????"}, {"content": "Updated to the latest version, but it doesn't even load anymore on my iPhone 5s!  Please fix so I can rate it higher.", "rating": "1", "version": "1.21.2", "date": "2016-12-25T09:12:00-07:00", "title": "Doesn't work"}, {"content": "So right it's a great game and all but it's not letting me catch any Pokemon so it goes in the poke ball for 2 shakes and jumps out and runs away I'm a level 15 and I tryid catching a pigy cp15 come on", "rating": "3", "version": "1.21.2", "date": "2016-12-25T08:46:00-07:00", "title": "Ohh god"}, {"content": "Please add trading and battling, it would be so FUN!!!\nAs for the review this game is good! New tracking update makes it more playable. So highly recommended, some of the magic has gone for me as far as I go.", "rating": "4", "version": "1.21.2", "date": "2016-12-25T07:36:00-07:00", "title": "Some update Ideas"}, {"content": "I've just finished Pokémon Y, and I must say it was much better than this. It's OK for a free game. Just very repetitive. Unfair to rural players. Favoring the US. It's, well, nothing like the real games. No Speed stat, trading, friend list, good tracker, player battles. There's a trainer level added. I suggest play Sun or Moon, yes it costs money but much better. The game is, to be honest, dead ☠️ Niantic is trying to bring it back with 2nd Gen. Nope, it's gone. Could've been amazing.", "rating": "2", "version": "1.21.2", "date": "2016-12-25T07:30:00-07:00", "title": "Well.."}, {"content": "Where's the free Christmas gifts?\n\nIt's 1:30pm December 25th and there have been big updates or anything. \n\nWe were promised extra incubators and stuff. \n\nPlease do the double candies thing for Christmas like you did throughout October for Halloween 😩", "rating": "5", "version": "1.21.2", "date": "2016-12-25T05:35:00-07:00", "title": "It won't update"}, {"content": "Won't load after this new update :(", "rating": "1", "version": "1.21.2", "date": "2016-12-25T02:46:00-07:00", "title": ":("}, {"content": "Great but doesn't work on my phone", "rating": "5", "version": "1.21.2", "date": "2016-12-25T02:19:00-07:00", "title": "Doesn't work on iPhone 5"}, {"content": "Great for tracking distance getting items at stops.", "rating": "5", "version": "1.21.2", "date": "2016-12-24T15:03:00-07:00", "title": "Watch app 👌🏻"}, {"content": "My son and I have been playing Pokemon Go since July 2016. It is truly an amazing concept, beautifully delivered. We find ourselves almost obsessed with it and playing at every opportunity. At times when our interest has waned, updates have ensured that the game has become more interesting and complex. We particularly enjoy working towards evolving various characters and finding rare Pokemon. The less enjoyable parts of the game are being surrounded by fairly ordinary Pokemon such as Rattatas, Pidgeys and Spearows. Hatching eggs brings an extra dimension to the game and an element of surprise. Playing the game has enabled my son (aged 7) to develop his mental arithmetic skills and has also encouraged him to go out and be more adventurous in order to find new Pokemon. I would rate this game very highly - it's certainly the most enjoyable iPhone game I've ever tried.", "rating": "5", "version": "1.21.2", "date": "2016-12-24T13:09:00-07:00", "title": "Lots of fun for kids and adults alike"}, {"content": "I don't really go outside a lot to hatch eggs because Pokémon go drains my battery really quickly so I think this is an issue that puts most people off and should be looked at because I really think more people would play if it didn't drain so quickly, I also think that poke coins are quite hard to build up and not everyone would like to spend money on coins ALL the time so maybe every 10km you walk you get 10 poke coins or maybe 5 or every 2km you walk you get 1 coin? I think this will encourage more people to play as gyms fill up quickly", "rating": "4", "version": "1.21.2", "date": "2016-12-24T11:49:00-07:00", "title": "Additions to game?"}, {"content": "As a real Pokémon fan (since 1999), this game is a real delight to be involved with and a great spin off to the traditional RPG. Can't wait as it 'evolves' and new features are included", "rating": "5", "version": "1.21.2", "date": "2016-12-24T11:46:00-07:00", "title": "Real Fan Appreciates the fun"}, {"content": "Was a ok game but 80% of the time now the game doesn't load up properly and now it's pretty much unplayable. And the Apple Watch app is useless and doesn't work", "rating": "1", "version": "1.21.2", "date": "2016-12-24T10:53:00-07:00", "title": "Game doesn't load watch app doesn't work"}, {"content": "I play this app almost on a daily basis as I've always enjoyed Pokémon games.\n\nAlso, there have been some great additions/updates over the last few months which I do recognise, like the individual pokemon appraisal system, the incentive to come back and play every day for bonuses/streaks, holiday events and improvements to whatever the find and catch system is called in the bottom right corner.\n\nHowever, there's a long way to go. The game mostly feels empty as there's little opportunity to interact with other players and the main gameplay is very repetitive. The Pokémon gym mechanics need a total overhaul as it's too easy for a handful of people to takeover for an indefinite period of time, and the battling system is just awful. Please expand the space one must stand in to interact with the gyms and introduce more creative battling? An alternative PvP system would be welcome too.\n\nLooking forward to trading, as well as Pokémon from the johto region and beyond!", "rating": "4", "version": "1.21.2", "date": "2016-12-24T09:40:00-07:00", "title": "Fun game but has yet to hit the mark"}, {"content": "I love this game, play it every day, but recently I've noticed it's not clocking up my candies. It keeps saying I have 23 rattatta candies and I know I have more as I keep collecting the silly little purple rodent things. I want to evolve it, but it doesn't say I have enough. I hope the next update fixes this issue", "rating": "4", "version": "1.21.2", "date": "2016-12-24T08:59:00-07:00", "title": "Great, but there's issues"}, {"content": "Pokemon go has been a great app, however, generation 2 needs to be 'catchable' because at the moment, we only have the same pokemons popping up and it's getting boring and I think everyone else will agree. I play Pokemon go on the way to school because I catch a bus and it's an hour long. I don't have much time to go out and walk but if I could, I would. I've been thinking, if your cycling, how do you play and how do you stop the 'I'm a passenger\" thing?\nThanks-\nIsy", "rating": "4", "version": "1.21.2", "date": "2016-12-24T08:45:00-07:00", "title": "Fair Review"}, {"content": "Just done the update and the app no longer opens anymore. Tried rebooting the phone and still does not work please get this sorted.", "rating": "1", "version": "1.21.2", "date": "2016-12-24T07:55:00-07:00", "title": "After update on 24/12/16 app now does not work"}]}