{"data": [{"content": "Can't create an account unless ya have a Facebook account, why presume that everyone is on Facebook, I'm not, this app don't even tell ya that you need Facebook to use it unless I couldn't find that bit, anyways think about making it so people that aren't on Facebook can use it, until then I think it's crap", "rating": "1", "version": "7.1.0", "date": "2017-03-06T12:59:00-07:00", "title": "No Facebook"}, {"content": "👌🏻 what else", "rating": "5", "version": "7.0.1", "date": "2017-03-06T04:47:00-07:00", "title": "Top banana"}, {"content": "This app is the worst it wouldn't stop crashing when I went on it so I deleted and tried to download it again but surprise surprise the app won't download", "rating": "1", "version": "7.0.1", "date": "2017-03-06T03:44:00-07:00", "title": "Terrible"}, {"content": "Very cool", "rating": "5", "version": "7.0.1", "date": "2017-03-06T02:07:00-07:00", "title": "👅❤❤"}, {"content": "Worst dating app i have ever used. \nIt always says server error or problems connecting to facebook, it will work if you have wifi but that is no good. \nThis has been going on for months and months and still not fixed so Tinder obviously has no interest in fixing the issue. \nWould i recommend to use this site NOT a hope in hell its CRAP.", "rating": "1", "version": "7.0.1", "date": "2017-03-06T00:09:00-07:00", "title": "Tinder"}, {"content": "Good app I like it", "rating": "5", "version": "7.0.1", "date": "2017-03-05T16:10:00-07:00", "title": "Good app"}, {"content": "The hyperlinks don't bloody work so when sisters are out to help eachother it's a massive let down! Please fix this xoxo", "rating": "3", "version": "7.0.1", "date": "2017-03-05T13:25:00-07:00", "title": "Recommend a Friend"}, {"content": "I've used Tinder for approximately six months. At first, Tinder showed relevant singles according to my settings. I met a few people but nothing serious. However, in 2017, Tinder is increasingly showing FAKE profiles. In my opinion, this is due to the fact that it's linked with Facebook. Facebook has recently and still is suffering from an influx of FAKE profiles. I recommend you avoid wasting your time with Tinder until Facebook and Tinder resolve this highly irritating virus!", "rating": "1", "version": "7.0.1", "date": "2017-03-05T13:25:00-07:00", "title": "Used to be Good! It's Terrible Now!"}, {"content": "Rubbish", "rating": "1", "version": "7.0.1", "date": "2017-03-05T07:26:00-07:00", "title": "Won't log in"}, {"content": "I like the new look but the location needs fixing I live in Manchester (UK) now unless I'm mistaken and I'm actually in Texas/California/Washington DC.. basically the whole of the United States not to mention a small hint of Eastern Europe then the location is in a state of FUBAR... get it fixed. For a app so wildly used as this I find it hard to believe the devs keep getting the basics wrong..", "rating": "2", "version": "7.0.1", "date": "2017-03-05T01:53:00-07:00", "title": "Improvement needed"}, {"content": "Tinder user for over a year and have enjoyed the app.\nHowever Tinder is now 95% fake profiles and fraudsters.\nWill have to start looking at other apps...", "rating": "1", "version": "7.0.1", "date": "2017-03-05T00:48:00-07:00", "title": "Fake profiles and fraudsters"}, {"content": "Tried 7 times this weekend to load profile pic and look at other people in app. New download of app five times and deleted five times. The App is broken so much that you can't even delete yourself when you want to get rid of the App.", "rating": "1", "version": "7.0.1", "date": "2017-03-05T00:10:00-07:00", "title": "The App doesn't work."}, {"content": "Can't get on it!!! It quits every time I try to open it", "rating": "5", "version": "7.0.1", "date": "2017-03-04T16:12:00-07:00", "title": "Force Quits'R'us"}, {"content": "Dear tinder team,\nThanks for this amazing application. For the last 5/6 weeks I am unable to use tinder on my iOS 7 on iPhone 4. Please fix it. This application is one of my favourite on iOS.", "rating": "2", "version": "7.0.1", "date": "2017-03-04T10:41:00-07:00", "title": "Tinder comparability on iPhone 4"}, {"content": "Cannot look at current matches/conversations when you're hidden. Who codes this crap?", "rating": "1", "version": "7.0.1", "date": "2017-03-04T08:14:00-07:00", "title": "Broken"}, {"content": "App doesn't work with 3G only wifi.", "rating": "3", "version": "7.0.1", "date": "2017-03-04T07:25:00-07:00", "title": "3G"}, {"content": "I installed this and it gave me chlamydia", "rating": "1", "version": "7.0.1", "date": "2017-03-04T04:35:00-07:00", "title": "Not great"}, {"content": "I think it's a great app and a great way of meeting people but unfortunately I have met some real weirdos and I'm still single.", "rating": "4", "version": "7.0.1", "date": "2017-03-03T23:23:00-07:00", "title": "Still single"}, {"content": "If you're old enough to know what it's like to use Ceefax then you'll know what I mean. Every SINGLE tap / swipe takes a full second, if not more. That's literally a lifetime these days. It's embarrassing", "rating": "1", "version": "7.0.1", "date": "2017-03-03T17:14:00-07:00", "title": "Ceefax"}, {"content": "Great for meeting interesting people to chat but if you're looking for love, you could be in for a very frustrating experience. \nExpect disappointment when you have no chemistry with people you meet. \nMany people expect instant Hollywood magical love and when you can't give them it you feel bad.\nI've had more fulfilling experiences meeting people in my day to day life even though I'm shy.", "rating": "3", "version": "7.0.1", "date": "2017-03-03T13:50:00-07:00", "title": "Ultimately flawed"}, {"content": "Rubbish app..... pay a premium price, for a load of bugs and I'm assuming \"bots\" asking you to click links.... waste of time.... doesn't get me in touch with anyone local...... sorry but this is just a scam...", "rating": "1", "version": "7.0.1", "date": "2017-03-03T13:31:00-07:00", "title": "Same old, same old..."}, {"content": "Really good to get to know someone offers really good profile and is not expensive at all", "rating": "5", "version": "7.0.1", "date": "2017-03-03T10:02:00-07:00", "title": "Amazing"}, {"content": "Too many dormant accounts. \nCompare it to bootyshake that might only have 10 ppl in your area online at a time, but at least they're ready to chat. Tinder should address this if it's serious about getting the UK audience back", "rating": "1", "version": "7.0.1", "date": "2017-03-03T01:48:00-07:00", "title": "No active accounts in my area"}, {"content": "Fake intentions...", "rating": "1", "version": "7.0.1", "date": "2017-03-02T23:30:00-07:00", "title": "Fake people"}, {"content": "Very poor very very poor user services just said try again another day . The issue is still happening for a month now , it shows there is no effort to fix this issue Ametures", "rating": "1", "version": "7.0.1", "date": "2017-03-02T22:44:00-07:00", "title": "Verification code"}, {"content": "Nice application, should have more functions but over all works fine.\nMore precise location set will help more .", "rating": "5", "version": "7.0.1", "date": "2017-03-02T17:39:00-07:00", "title": "Nice app."}, {"content": "Got me laid. Twice. Thanks.", "rating": "5", "version": "7.0.1", "date": "2017-03-02T17:03:00-07:00", "title": "Works"}, {"content": "95% of the profiles on Tinder are fake or an advertisement for a cash grab website. Awful app. I'll continue to use it though because I'm desperately sad and like a good perv after a hard day's graft in the mill.", "rating": "1", "version": "7.0.1", "date": "2017-03-02T15:36:00-07:00", "title": "Bag of old dicks"}, {"content": "I can't fault tinder for being popular but it has now been infested with fake profiles that 8/10 average looking female profiles are actual actual scammers that will send you a webcam link to click on in about 2 seconds of matching! \nI have the tinder plus version and if this doesn't get stopped people will leave this app! \n\nYou can tell a fake profile from a mile away within seconds!", "rating": "1", "version": "7.0.1", "date": "2017-03-02T11:44:00-07:00", "title": "Too many fake profiles!"}, {"content": "Be aware that if you have issues with this app you will get very very poor customer support.  All support is only by email.  They have a very very slow response time (weeks in some cases) and no ability to fix technical issues.  Be careful with add on features that simply do not activate correctly.  Apple will only advise deal with the Tinder App support team so be careful.", "rating": "1", "version": "7.0.1", "date": "2017-03-02T06:56:00-07:00", "title": "Terrible support and Plus does not always work"}, {"content": "👍🏻", "rating": "5", "version": "7.0.1", "date": "2017-03-02T06:19:00-07:00", "title": "Tinder"}, {"content": "Okay so it has its down sides, but if you're using it properly then it's great! Over two years ago I met my boyfriend on tinder. Now two years on we live together, have our own pug puppy and have never been this happy. Thanks tinder, without you I would have never met the love of my life 🎀", "rating": "5", "version": "7.0.1", "date": "2017-03-02T05:02:00-07:00", "title": "Thanks tinder!"}, {"content": "I couldn't login in, it says issue connecting to tinder", "rating": "1", "version": "7.0.1", "date": "2017-03-02T04:57:00-07:00", "title": "Issue logging in to tinder"}, {"content": "On 4G with nearly a full signal and won't log on unless I use wifi. What's the point. \nUseless app. Same faces mainly spam Mail unless you purchase a bundle then all goes quiet and them girls who messaged you never message again.", "rating": "1", "version": "7.0.1", "date": "2017-03-02T02:30:00-07:00", "title": "Won't log In"}, {"content": "It stopped working suddenly after the update. It kept on freezing and when i re-installed it, it shows error message and asks me to contact customer service!! Help!", "rating": "1", "version": "7.0.1", "date": "2017-03-01T18:24:00-07:00", "title": "Stopped working"}, {"content": "Very good app and meet some wonderful people.", "rating": "5", "version": "7.0.1", "date": "2017-03-01T14:28:00-07:00", "title": "Tinder"}, {"content": "Found Maddy McCann on here. Super liked her so her ma and pa can find her through me 👍", "rating": "5", "version": "7.0.1", "date": "2017-03-01T14:18:00-07:00", "title": "👀"}, {"content": "This app used to be so good. They keep changing it for the worst. The new layout when you're swiping is awful. You should get unlimited likes or at least be able to like more people before you have to wait 12 hours.", "rating": "1", "version": "7.0.1", "date": "2017-03-01T08:39:00-07:00", "title": "BRING BACK MOMENTS"}, {"content": "I have matched with quite a few people and actually met up with some so no issue there. \nHowever the only issue is if you set your maximum distance it still shows you people miles and miles out of your range! Please fix this", "rating": "4", "version": "7.0.1", "date": "2017-03-01T06:32:00-07:00", "title": "Mostly good"}, {"content": "Ok if you're on wifi but leave the house and you'll never be able to connect to their server! Waste of time!!", "rating": "1", "version": "7.0.1", "date": "2017-03-01T03:10:00-07:00", "title": "Poor"}, {"content": "I love tinder the amount of people I've met and became friends with is Unbeilable .its by far the best dating app out there. It's so easy to use and there's so many new people everyday. I do think there should be more features on it as it's abit basic. I also think u should let people have a 30 day trail of the gold membership to get to test it out and see if it's worth the money you are charging", "rating": "5", "version": "7.0.1", "date": "2017-03-01T01:09:00-07:00", "title": "Love it"}, {"content": "No cards load. No images load. Just pulsates away. Deleted and reinstalled. Now it looks like my profile, all my photos and my bio has gone.\n\nHow does a company with millions upon millions of pounds worth of investment, resources and staff manage to release so many unstable builds and maintain such an unreliable service??\n\nThere are literally no other apps that give me as much grief as the Tinder app.\n\nI would completely ditch this one in favour of the other more reliable ones if this didnt have such smart matching algorithms and such a large user base. \n\nPlease please sort out whatever is causing this much downtime and general crappiness!!!!", "rating": "1", "version": "7.0.1", "date": "2017-02-28T16:22:00-07:00", "title": "Yay! Server errors are back!! 😤"}, {"content": "Came to find a lover but I won't if I can't upload any photos! Surely you've got enough money now to pay someone to run this technology properly!", "rating": "1", "version": "7.0.1", "date": "2017-02-28T15:11:00-07:00", "title": "Crap technology"}, {"content": "I think Tinder had lost the plot. They give you a limited number of profile searches per day, but many of the profiles are names with blank photos. So your actual profile search is limited. It's about the money and for hing us to sign up to improve our chances of getting matched.", "rating": "3", "version": "7.0.1", "date": "2017-02-28T15:09:00-07:00", "title": "Too many Blank profiles"}, {"content": "A complete waste of time. It won't let me add photos, well who's going to like a profile with no picture, uglies and fatties that's who!", "rating": "1", "version": "7.0.1", "date": "2017-02-28T15:01:00-07:00", "title": "Useless if you can't add a photo"}, {"content": "😈👿why not", "rating": "5", "version": "7.0.1", "date": "2017-02-28T14:52:00-07:00", "title": "Wh not"}, {"content": "I download and then go to log in via Facebook and then nothing... never works for me.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T14:19:00-07:00", "title": "Won't even let me log in..."}, {"content": "Can't upload any photos", "rating": "1", "version": "7.0.1", "date": "2017-02-28T13:50:00-07:00", "title": "Can't upload any photos"}, {"content": "I can't add new photos. Keeps saying 'failed to upload' this needs fixing.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T13:45:00-07:00", "title": "Not working"}, {"content": "Can't change picture takeing the pisssss", "rating": "1", "version": "7.0.1", "date": "2017-02-28T13:43:00-07:00", "title": "M"}, {"content": "Block the fat girls please", "rating": "4", "version": "7.0.1", "date": "2017-02-28T13:33:00-07:00", "title": "Cool"}, {"content": "Trying to add a photo and it's not letting me upload, not letting me see matches photos or message matches.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T12:49:00-07:00", "title": "Poor"}, {"content": "Useless lately", "rating": "1", "version": "7.0.1", "date": "2017-02-28T12:35:00-07:00", "title": "Slow"}, {"content": "Whether you Facebook upload or camera roll upload, this idiotic app will not let you update your profile with any new photos, hope you all look exactly the same as you did a year ago because that's what tinder wants us all to believe!!", "rating": "1", "version": "7.0.1", "date": "2017-02-28T12:14:00-07:00", "title": "No new pictures"}, {"content": "Tinder has been plagued by fake profiles worse than ever recently, this new update is ultra glitchy and really struggles to load pictures of matches. Worst of all though, the tinder plus service went from being 5 super like every 12 hours and a boost a week, to a boost a month and 5 supers every 24 hours... for the money, it's ridiculous. GO DOWNLOAD BUMBLE INSTEAD.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T12:13:00-07:00", "title": "Fix it!"}, {"content": "Have met few people off tinder in the past, now there are more fake profiles than real ones though.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T12:11:00-07:00", "title": "Getting worse"}, {"content": "Images not loading, switches profiles as you swipe, 90% reduction in ordinary matches since premium features introduced. Should be so easy for someone to beat this rubbish by reinventing the tinder of a year ago!", "rating": "1", "version": "7.0.1", "date": "2017-02-28T11:59:00-07:00", "title": "Buggy"}, {"content": "Terrible app. No photos load, it's slow and constantly asks you to review it...", "rating": "1", "version": "7.0.1", "date": "2017-02-28T11:32:00-07:00", "title": "Tom"}, {"content": "Some matches are no longer displaying, just forever loading. Photos aren't loading properly in the main feed which is rubbish", "rating": "2", "version": "7.0.1", "date": "2017-02-28T11:05:00-07:00", "title": "Profiles don't load properly"}, {"content": "App doesn't load when other ones do.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T10:59:00-07:00", "title": "Network issues"}, {"content": "Sort this app out now. I'm paying you money each month, for spam accounts and now currently since it changed layout over night peoples pictures aren't loading at all! Sort it. I want my money back.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T10:47:00-07:00", "title": "Sort it out"}, {"content": "There are appear to be a lot of empty / spam profiles. Not much point in someone putting up a profile without saying anything about themselves is there..? Be careful of the distances shown.... Have had a few saying they're 40-50km away, and it turns out they're in the USA or Australia..!!!", "rating": "3", "version": "7.0.1", "date": "2017-02-28T08:45:00-07:00", "title": "False & Empty Profiles"}, {"content": "Crashes loads and messages don't send which is a massive cockblock", "rating": "1", "version": "7.0.1", "date": "2017-02-28T06:51:00-07:00", "title": "Always crashes, messages don't send"}, {"content": "Please fix. Update stopped app working on my phone.", "rating": "1", "version": "7.0.1", "date": "2017-02-28T03:35:00-07:00", "title": "Update stopped app working"}, {"content": "Rubbish it worked for an evening then nothing, can't log in can't see my messages!!!\nHow annoying", "rating": "3", "version": "7.0.1", "date": "2017-02-28T00:32:00-07:00", "title": "Can't log in!"}, {"content": "It would be so much better if it actually loaded... just get the circles forever. Sort it out!", "rating": "1", "version": "7.0.1", "date": "2017-02-27T23:02:00-07:00", "title": "Frustrating!"}, {"content": "This app never works login problem always", "rating": "1", "version": "7.0.1", "date": "2017-02-27T16:27:00-07:00", "title": "Crap never works"}, {"content": "I was using the app fine before I changed my distance preferences now no one is showing up. Logged in - out, deleted and reinstalled app. Changed distance preferences again and partner preferences with nothing!", "rating": "2", "version": "7.0.1", "date": "2017-02-27T15:54:00-07:00", "title": "Stopped working??"}, {"content": "Decent ui too.", "rating": "5", "version": "7.0.1", "date": "2017-02-27T15:21:00-07:00", "title": "Met some right nutters!"}, {"content": "Easy!!! Easy!!!Easy!!!\nBack to basics functionality which a chimpanzee could master! You click yes/no and the rest is easy lol!!'", "rating": "5", "version": "7.0.1", "date": "2017-02-27T09:39:00-07:00", "title": "No Brainer!!!"}, {"content": "Great app", "rating": "5", "version": "7.0.1", "date": "2017-02-27T09:37:00-07:00", "title": "Love chasing"}, {"content": "About the only app that works \nMet a few on here", "rating": "4", "version": "7.0.1", "date": "2017-02-27T06:04:00-07:00", "title": "Good"}, {"content": "App is stuck loading new people, have tried uninstalling still the same problem", "rating": "1", "version": "7.0.1", "date": "2017-02-27T05:40:00-07:00", "title": "Crap"}, {"content": "Does it's job, sometimes takes a bit of time and money but still cheaper than trawling bars", "rating": "4", "version": "7.0.1", "date": "2017-02-27T05:10:00-07:00", "title": "Does the job"}, {"content": "Really good had 4 matches and had one date so far", "rating": "5", "version": "7.0.1", "date": "2017-02-27T04:42:00-07:00", "title": "Really good"}, {"content": "Not working on 4G (using UK carrier) This way, app has become useless when traveling.", "rating": "1", "version": "7.0.1", "date": "2017-02-26T14:28:00-07:00", "title": "Not working on 4G"}, {"content": "Not sure what's happened but recently it doesn't work a lot - particularly on an evening.", "rating": "3", "version": "7.0.1", "date": "2017-02-26T10:22:00-07:00", "title": "Good when it works!"}, {"content": "It's a cool app!", "rating": "4", "version": "7.0.1", "date": "2017-02-26T05:31:00-07:00", "title": "Good"}, {"content": "Can't alter profile pictures etc. Distances are totally wrong - matches appear in other countries (what?!)\nTinder DON'T CARE.\nIt's a mess!", "rating": "1", "version": "7.0.1", "date": "2017-02-26T00:23:00-07:00", "title": "LOUSY"}, {"content": "10/1", "rating": "5", "version": "7.0.1", "date": "2017-02-25T17:37:00-07:00", "title": "10/10"}, {"content": "Used to be filled with bots but they sorted that.\n\nTop tips:\n\nNever pay for boosts or super likes.\n\nActually talk to your matches.\n\nWear sunscreen.", "rating": "5", "version": "7.0.1", "date": "2017-02-25T15:29:00-07:00", "title": "Alright alright alright"}, {"content": "Awesome app. Although the rewinds, passport and super likes should be unlimited and free because sometimes you accidentally swipe off against you potential life partner and you accidentally spend that super like you've been saving on someone because you accidentally swiped up when trying to check their profile.", "rating": "5", "version": "7.0.1", "date": "2017-02-25T08:54:00-07:00", "title": "Best App Ever !"}, {"content": "Great love it", "rating": "4", "version": "7.0.1", "date": "2017-02-25T07:35:00-07:00", "title": "Great"}, {"content": "Love it!", "rating": "5", "version": "7.0.1", "date": "2017-02-25T07:06:00-07:00", "title": "Great app!"}, {"content": "Solid 10/10 and I can't even get a match! smh", "rating": "1", "version": "7.0.1", "date": "2017-02-25T06:59:00-07:00", "title": "Give up"}, {"content": "...but with actual birds! It's up to the user to make them angry or not.", "rating": "5", "version": "7.0.1", "date": "2017-02-25T04:42:00-07:00", "title": "A bit like \"Angry Birds\""}, {"content": "Great app. Changed dating for the better!", "rating": "5", "version": "7.0.1", "date": "2017-02-25T03:28:00-07:00", "title": "5 star"}, {"content": "First it would only connect on wifi, then it just crashes upon open. Deleted and reinstalled, now it won't sign in. Rubbish.", "rating": "1", "version": "7.0.1", "date": "2017-02-24T21:58:00-07:00", "title": "Doesn't work at all."}, {"content": "You know, just fine", "rating": "5", "version": "7.0.1", "date": "2017-02-24T19:14:00-07:00", "title": "Just fine"}, {"content": "Good app. Please stop asking me to review x", "rating": "5", "version": "7.0.1", "date": "2017-02-24T17:12:00-07:00", "title": "Really good!"}, {"content": "Without the ability to react to fake profiles tinder has become another field for scams. I had to rate one star as I couldn't rate catfish", "rating": "1", "version": "7.0.1", "date": "2017-02-24T16:40:00-07:00", "title": "Just like POF"}, {"content": "I really enjoy this app. In a world of unconnectedness tinder really helps.", "rating": "5", "version": "7.0.1", "date": "2017-02-24T15:11:00-07:00", "title": "Very good app"}, {"content": "Great way to meet new ppl", "rating": "5", "version": "7.0.1", "date": "2017-02-24T15:06:00-07:00", "title": "Tinderella 10"}, {"content": "Review!", "rating": "5", "version": "7.0.1", "date": "2017-02-24T13:40:00-07:00", "title": "Yeah Tinder"}, {"content": "I've downloaded / deleted it so many times and it doesn't bloody load!!! Absolute rubbish", "rating": "1", "version": "7.0.1", "date": "2017-02-24T12:41:00-07:00", "title": "Doesn't open"}, {"content": "I'd rate 5 stars if it actually worked! My experience of Tinder was very glitchy. I lost my profile, couldn't log on, constantly spinning, no matches, when I got a match they would disappear, location errors... There's minimal support, and nothing that can be done other than to constantly log off and back on. But the cycle continues 99% of the time. So for that, it's a 1 star from me. However, if it works for you, then it's great...", "rating": "1", "version": "7.0.1", "date": "2017-02-24T12:30:00-07:00", "title": "Tinder App is very glitchy"}, {"content": "I've not paid for the premium yet, but I've met a couple nice people on tinder. I think it's the best dating app out there. And I love it❤", "rating": "5", "version": "7.0.1", "date": "2017-02-24T11:57:00-07:00", "title": "Amazing"}, {"content": "Very nice if you use it correctly", "rating": "5", "version": "7.0.1", "date": "2017-02-24T11:15:00-07:00", "title": "Nice app"}, {"content": "Its good, give it a go.", "rating": "5", "version": "7.0.1", "date": "2017-02-24T10:55:00-07:00", "title": "Good"}, {"content": "It takes a while to load hardly ever works for me.", "rating": "1", "version": "7.0.1", "date": "2017-02-24T06:42:00-07:00", "title": "Not as good as I thought"}, {"content": "Personally, I think this app is a cynical attempt to get money from lonely people. You can't get anyone to even respond, let alone go on a date. Quite often people will unmatch you at exactly the point at which you suggest a date. And, on top of this, it's killing offline dating too! Less people go out to meet other people cause they're all supposedly at home doing it on tinder. \n\nRegarding the app itself, it's a bit buggy and there are the same old people on it again and again. Overall it feels more like work than anything fun or enjoyable. Most guys just select yes to every woman and see who bites - if it has to work this way why not have an option so men can say yes to all of Tinder and only women get to choose? I think it's horrible either way, I really do, it's a cynical app.", "rating": "1", "version": "7.0.1", "date": "2017-02-24T05:26:00-07:00", "title": "Same old people"}, {"content": "I'm literally writing this so the notification goes away about writing a review", "rating": "5", "version": "7.0.1", "date": "2017-02-24T01:27:00-07:00", "title": "1"}, {"content": "It's good fun, get to meet lots of like minded fun people.", "rating": "5", "version": "7.0.1", "date": "2017-02-23T23:57:00-07:00", "title": "Candy shop"}, {"content": "Writing a review because you mither me too every day!! X", "rating": "4", "version": "7.0.1", "date": "2017-02-23T16:21:00-07:00", "title": "Miss"}, {"content": "Ok", "rating": "5", "version": "7.0.1", "date": "2017-02-23T12:49:00-07:00", "title": "Ok"}, {"content": "Yes I have had quite the banter on here so far with some gorgeous girls, however my dick has not yet been sucked, so it's 4 stars for from me!", "rating": "4", "version": "7.0.1", "date": "2017-02-22T17:19:00-07:00", "title": "If there's grass on the pitch, play ball!"}, {"content": "So many fake profiles it's almost pointless using this anymore.", "rating": "1", "version": "7.0.1", "date": "2017-02-22T14:06:00-07:00", "title": "Too many fakes"}, {"content": "Lovely app very easy to use & cramed packed full of lovelys", "rating": "5", "version": "7.0.1", "date": "2017-02-22T13:43:00-07:00", "title": "Blinding app"}, {"content": "This app is great...so great that I got gold membership (unfortunately a well written review won't change my relationship status). But it might give me a better chance. I love the boost feature and I see a point in only one a month however I think either one a week or 3 a month would be better. The first one would make people keep going on tinder and perhaps get more used to the boost where they feel the need to buy. The other would be good as people would either use them all quickly, think it's ace and pay out or space them out which would result in more app usage and perhaps make them feel the need to buy more. Just a thought.", "rating": "4", "version": "7.0.1", "date": "2017-02-22T12:24:00-07:00", "title": "Fantastic but needs one adjustment"}, {"content": "I hate tinder with a passion! There are so many fake profiles on this app and I think the problem is it's so easy to sign up I would not recommend this app to anyone what so ever tinder needs to sort it out", "rating": "1", "version": "7.0.1", "date": "2017-02-22T11:26:00-07:00", "title": "So bad!"}, {"content": "Lots of fun for your appendages!!", "rating": "5", "version": "7.0.1", "date": "2017-02-22T10:32:00-07:00", "title": "Good workout for your thumbs!!!"}, {"content": "Please fix the issue where a different profile comes up as you're swiping. I've missed many profiles I actually like because of this.", "rating": "3", "version": "7.0.1", "date": "2017-02-22T10:04:00-07:00", "title": "App Issue"}, {"content": "Just a review in the hope it stops the 'Review us now' thing from keep popping up.", "rating": "4", "version": "7.0.1", "date": "2017-02-22T06:25:00-07:00", "title": "Whatever."}, {"content": "✅", "rating": "4", "version": "7.0.1", "date": "2017-02-22T05:17:00-07:00", "title": "Don't like the update but overall okay"}, {"content": "Rahh!! mans still copping hella peng tings on here, stay blessed still", "rating": "5", "version": "7.0.1", "date": "2017-02-22T02:44:00-07:00", "title": "All the peng tings"}, {"content": "The people rating 4 star and 5 star all work for Tinder.\n\nYou won't get matches if you're not paying for boost - simple as.", "rating": "1", "version": "7.0.1", "date": "2017-02-22T00:59:00-07:00", "title": "Ads and money money"}, {"content": "I still haven't found the love of my life - If only I'd been charged for this app I would now ask for a refund. All I want is someone to carry me to bed and tickle my back until I fall asleep is that too much to ask? \nP.s can you make a tinder for friends so when I wanna find someone to paint my nails with I don't have to think of an excuse as to why I haven't text my actual friends back before I can make plans with them. Help a sister out 😘", "rating": "4", "version": "7.0.1", "date": "2017-02-21T15:37:00-07:00", "title": "No such luck"}, {"content": "Good app easy matches", "rating": "5", "version": "7.0.1", "date": "2017-02-21T15:31:00-07:00", "title": "Brilliant"}, {"content": "Fast and easy. No other app comes close.", "rating": "4", "version": "7.0.1", "date": "2017-02-21T14:53:00-07:00", "title": "It's the daddy!"}, {"content": "Good app if it didnt interrupt every other swipe with 'write a review'", "rating": "2", "version": "7.0.1", "date": "2017-02-21T14:35:00-07:00", "title": "Pestering to write a review"}, {"content": "The first of its kind ... the best of its kind!", "rating": "5", "version": "7.0.1", "date": "2017-02-21T12:11:00-07:00", "title": "Great app!"}, {"content": "Hook up or fook up", "rating": "5", "version": "7.0.1", "date": "2017-02-21T12:09:00-07:00", "title": "Mad tings brudda"}, {"content": "Stop asking me to review now please", "rating": "5", "version": "7.0.1", "date": "2017-02-21T11:33:00-07:00", "title": "Pretty decent"}, {"content": "Can't even swipe right without getting pestered to write a review", "rating": "2", "version": "7.0.1", "date": "2017-02-21T11:28:00-07:00", "title": "🖕🏻"}, {"content": "Pestered to write review", "rating": "5", "version": "7.0.1", "date": "2017-02-21T10:18:00-07:00", "title": "Review"}, {"content": "💋", "rating": "5", "version": "7.0.1", "date": "2017-02-21T10:11:00-07:00", "title": "Easy way of meeting new people"}, {"content": "Not bad for a free app. I feel that the like matches may not always be highlighted which is a shame.", "rating": "3", "version": "7.0.1", "date": "2017-02-21T09:58:00-07:00", "title": "Good & Bad"}, {"content": "Got loads of attention on this app, 100% recommend", "rating": "5", "version": "7.0.1", "date": "2017-02-21T09:01:00-07:00", "title": "Great app"}, {"content": "Crapppppo", "rating": "1", "version": "7.0.1", "date": "2017-02-21T06:33:00-07:00", "title": "Tinder"}, {"content": "1. There needs to be an added \"swipe according to filter\" option where users can specify, hair colour, height essentially only matching with people of their type.\n\n2. Add what you're looking for (privately in profile) so you only match with other people searching for that, i.e. Love fun etc\n\n3. As a must, I really think based on how frequently you're liked by others, you gain a higher rating (not visible) which means you're just naturally paired with other attractive people, for too long I'm just constantly swiping left. I know it's condoning vanity but you should employ this strategy (leagues essentially) haha.\n\nI think these should all be optional additions in which users can switch on or off in their profile so you can still swipe for fun, but if you wanna search specifically green eyes, black hair etc, then you can.", "rating": "3", "version": "7.0.1", "date": "2017-02-21T05:40:00-07:00", "title": "Improvements"}, {"content": "The limit on how many matches a day you can have is a bit annoying and the amount of fake profiles you can come across. Needs to be more verification of profiles but otherwise a pretty standard app.", "rating": "2", "version": "7.0.1", "date": "2017-02-21T05:37:00-07:00", "title": "It's alright..."}, {"content": "🎣", "rating": "4", "version": "7.0.1", "date": "2017-02-21T05:37:00-07:00", "title": "Stop spamming for a review"}, {"content": "Pulling machine", "rating": "5", "version": "7.0.1", "date": "2017-02-21T04:38:00-07:00", "title": "Decent"}, {"content": "Asks every 10 minutes for a review. Only asks for an iTunes review if you give 5 stars on the app pain in the hole.", "rating": "1", "version": "7.0.1", "date": "2017-02-21T02:38:00-07:00", "title": "Constant review requests"}, {"content": "Won't sign in, doesn't send messages, constantly crashes. Not even worth 1 star but have to input 1 to leave this review.", "rating": "1", "version": "7.0.1", "date": "2017-02-21T00:27:00-07:00", "title": "Rubbish"}, {"content": "Great sound bit sketchy", "rating": "5", "version": "7.0.1", "date": "2017-02-20T16:50:00-07:00", "title": "Great"}, {"content": "So it's supposed to be a location driven service right? Then why does it only work on WIFI psssh. Also I keep getting random crashes then losing the matches it even happened after I said hi- what the hell.", "rating": "2", "version": "7.0.1", "date": "2017-02-20T16:08:00-07:00", "title": "Only works on WIFI and random crashes losing matches"}, {"content": "Good app!", "rating": "4", "version": "7.0.1", "date": "2017-02-20T15:21:00-07:00", "title": "Decent app"}, {"content": "love dusting gals, nothing beats a little tinderella", "rating": "5", "version": "7.0.1", "date": "2017-02-20T15:15:00-07:00", "title": "sick"}, {"content": "Forced me to write a review", "rating": "1", "version": "7.0.1", "date": "2017-02-20T14:46:00-07:00", "title": "Hate reviews"}, {"content": "Why is the tinder app always so bad? Messages not showing up after notifications, messages not sending, continually telling you how to use it, eternal loading screens, all messages disappearing. Frustrating annoying buggy and crap. Not only all that but constantly asking to be rated, which is hugely annoying. Well here you go. Hope you're happy now.", "rating": "1", "version": "7.0.1", "date": "2017-02-20T14:44:00-07:00", "title": "BUGGY AND ANNOYING!"}, {"content": "I met the love of my life on tinder so thank you for that", "rating": "5", "version": "7.0.1", "date": "2017-02-20T13:59:00-07:00", "title": "Thanks tinder"}, {"content": "I find wife here very good 5 star this is best app ever seen.", "rating": "5", "version": "7.0.1", "date": "2017-02-20T11:00:00-07:00", "title": "Tinder review"}, {"content": "I downloaded it a while ago and it won't let me log in with Facebook, and when it does it is super glitchy and won't let me update my profile, and every time I close the app it asks me to log into Facebook.", "rating": "1", "version": "7.0.1", "date": "2017-02-20T09:36:00-07:00", "title": "Doesn't support iOS 10"}, {"content": "Kill me", "rating": "4", "version": "7.0.1", "date": "2017-02-20T09:30:00-07:00", "title": "Good but shouldn't have like limits"}, {"content": "Only writing this because you constantly spam me with \"please write us a review\"", "rating": "1", "version": "7.0.1", "date": "2017-02-20T09:09:00-07:00", "title": "Stop asking me to write reviews"}, {"content": "..", "rating": "5", "version": "7.0.1", "date": "2017-02-20T08:55:00-07:00", "title": "Good for yer hole"}, {"content": "Pestered to write review I don't even use app p*ss off", "rating": "1", "version": "7.0.1", "date": "2017-02-20T08:33:00-07:00", "title": "Z"}, {"content": "It's gd", "rating": "5", "version": "7.0.1", "date": "2017-02-20T07:46:00-07:00", "title": "Mr"}, {"content": "For an app that is used a lot, there as so many issues. The worst being the fact that 9 times out of 10 it doesn't load. Shocking app. Needs massive improvements.", "rating": "1", "version": "7.0.1", "date": "2017-02-20T07:35:00-07:00", "title": "Shocking."}, {"content": "Meh", "rating": "3", "version": "7.0.1", "date": "2017-02-20T07:23:00-07:00", "title": "Meh"}, {"content": "A lot of matches easy app :)", "rating": "5", "version": "7.0.1", "date": "2017-02-20T06:45:00-07:00", "title": "Great app!"}, {"content": "The app is absolutely littered with fake profiles and spam ! Not sure if tinder has placed them there themselves but it is ruining the app ! They're easy enough to spot as if something looks too good to be true it usually is . Avoid to they fix the problem !!!", "rating": "1", "version": "7.0.1", "date": "2017-02-20T05:59:00-07:00", "title": "Avoid !!"}, {"content": "Will you stop asking me to write a review now?", "rating": "5", "version": "7.0.1", "date": "2017-02-20T05:38:00-07:00", "title": "It's Tinder"}, {"content": "Doesn't work unless using wifi.", "rating": "1", "version": "7.0.1", "date": "2017-02-20T04:43:00-07:00", "title": "Useless"}, {"content": "Great app", "rating": "5", "version": "7.0.1", "date": "2017-02-20T02:37:00-07:00", "title": "Tinder"}, {"content": "Decent app, no problems", "rating": "4", "version": "7.0.1", "date": "2017-02-20T02:30:00-07:00", "title": "Good"}, {"content": "Can't use when out and about. Issues connecting when other apps are fine. Beginning to wonder if frequent releases are to avoid bad reviews in older versions!!!", "rating": "1", "version": "7.0.1", "date": "2017-02-20T00:41:00-07:00", "title": "Another release botched again"}, {"content": "V good", "rating": "4", "version": "7.0.1", "date": "2017-02-19T23:51:00-07:00", "title": "Tinder"}, {"content": "👌", "rating": "5", "version": "7.0.1", "date": "2017-02-19T22:21:00-07:00", "title": "Sorted"}, {"content": "If there were a distinction process between just a hook up and desiring a relationship, then that'd be helpful!", "rating": "4", "version": "7.0.1", "date": "2017-02-19T16:19:00-07:00", "title": "Needs a specific function for a desired relation"}, {"content": "i keep clicking sign in with facebook then allow but it's not working, have deleted & redownloaded but i'm not that fussed about it, not an essential app, but there should be an ulterior method of signing up if 1 is going to continually not work", "rating": "1", "version": "7.0.1", "date": "2017-02-19T15:55:00-07:00", "title": "not letting me sign up"}, {"content": "I signed up for the costly premium account before the introduction of the boost feature. Suddenly matches are suspiciously less frequent, using the incredibly expensive boost then they become abundant. It has become a way to fleece money from people. Ironically what I get with premium was once free, fair enough. What I get with the paid boosts was just the standard algorithm. It has bled the joy out of the experience for me.", "rating": "1", "version": "7.0.1", "date": "2017-02-19T15:49:00-07:00", "title": "Pay a premium get nothing. Keeps getting worse."}, {"content": "It might be that I'm ugly or that the app is broken..", "rating": "3", "version": "7.0.1", "date": "2017-02-19T14:58:00-07:00", "title": "Decisions"}, {"content": "Doesn't load, doesn't let me send messages broken app deleting this-no more nudes for me", "rating": "1", "version": "7.0.0", "date": "2017-02-19T14:21:00-07:00", "title": "Bad to worse"}, {"content": "Won't load any potential matches???", "rating": "1", "version": "7.0.0", "date": "2017-02-19T13:18:00-07:00", "title": "Not loading!!"}, {"content": "Fun app. Great for meeting new people.", "rating": "5", "version": "7.0.0", "date": "2017-02-19T10:26:00-07:00", "title": "Tinder"}, {"content": "Brilliant app", "rating": "5", "version": "7.0.0", "date": "2017-02-19T09:22:00-07:00", "title": "Brilliant app"}, {"content": "Good app", "rating": "4", "version": "7.0.0", "date": "2017-02-19T06:33:00-07:00", "title": "Tinder"}, {"content": "This app is very buggy, profiles sometimes change to a different person when you click on them. Messages often fail to send for no apparent reason.", "rating": "1", "version": "7.0.0", "date": "2017-02-19T05:42:00-07:00", "title": "Very Buggy"}, {"content": "Major problems are that after getting a match the next profile or card is hidden under another one so it tricks you into swiping someone you can't see. \nThen there's the multitude of fakes; Karol, Karola - her! She comes up every tenth swipe! \nDoesn't show about a third of matches profiles now and let's honest snce Moments went and bootyshake started doing it better, there's little point until they sort it out. I hope they do, but it looks like they're focusing on the money and not the customer", "rating": "2", "version": "7.0.0", "date": "2017-02-19T05:38:00-07:00", "title": "Buggy and getting buggier"}, {"content": "Gets stuck on loading 90% of the time and can't send messages. Worst app ever. Deserves 0 stars", "rating": "1", "version": "7.0.0", "date": "2017-02-19T03:58:00-07:00", "title": "Shite"}, {"content": ".\"4", "rating": "4", "version": "7.0.0", "date": "2017-02-19T02:32:00-07:00", "title": "Good"}, {"content": "The latest update has f**ked the entire app. Won't let me log in at all now yet I'm still getting notifications. You guys need to fix this quickly!", "rating": "1", "version": "7.0.0", "date": "2017-02-19T01:50:00-07:00", "title": "Fix needed for latest app update"}, {"content": "Give it a try it's easier than a dating sight", "rating": "5", "version": "7.0.0", "date": "2017-02-18T22:54:00-07:00", "title": "Fun"}, {"content": "Brilliant app", "rating": "5", "version": "7.0.0", "date": "2017-02-18T22:43:00-07:00", "title": "Amazing"}, {"content": "App doesn't seem to be connecting to Fb for some reason so can't log on", "rating": "1", "version": "7.0.0", "date": "2017-02-18T17:37:00-07:00", "title": "Not connecting"}, {"content": "I meet lots of nice people which is good but then every so often I get a random woman pop up sending me links to \"inappropriate\" websites etc and apps! Need to stop these people", "rating": "4", "version": "7.0.0", "date": "2017-02-18T15:59:00-07:00", "title": "Good"}, {"content": "Love tinder, helps me get bare tidy minge when my banging girlfriend is working away😻 loving the easy drippin poon😻😻 hit me up girls, im a footlong sub", "rating": "5", "version": "7.0.0", "date": "2017-02-18T15:41:00-07:00", "title": "Tinder"}, {"content": "So \nA) since update no location found, yes all switched on\nB) who would pay for this 🤔\nVerdict is out", "rating": "1", "version": "7.0.0", "date": "2017-02-18T15:01:00-07:00", "title": "Hmmmm"}, {"content": "Good app but should be able to see who likes you. Maybe a new feature for Tinder plus ??", "rating": "4", "version": "7.0.0", "date": "2017-02-18T13:18:00-07:00", "title": "Decent App"}, {"content": "so i matched with this bird and she was 21 and i'm 13 and she sucked my dick so i'm very pleased with your services and i would like to continue using them if you come across me make sure to hit me", "rating": "5", "version": "7.0.0", "date": "2017-02-18T13:08:00-07:00", "title": "i got my dick sucked"}, {"content": "Not bad..", "rating": "4", "version": "7.0.0", "date": "2017-02-18T12:11:00-07:00", "title": "Meh"}, {"content": "Great app but needs to be free", "rating": "5", "version": "7.0.0", "date": "2017-02-18T11:04:00-07:00", "title": "Great"}, {"content": "Gets me my hole. 10/10", "rating": "5", "version": "7.0.0", "date": "2017-02-18T10:40:00-07:00", "title": "Aye"}, {"content": "If your single the app is a no brainier. Seems a bit shoddy on mobile data, absolutely fine on wifi though! 👌🏻", "rating": "4", "version": "7.0.0", "date": "2017-02-18T07:32:00-07:00", "title": "Buggy, but useable and essential!"}, {"content": "When I open the after it won't load anything and I've just updated it", "rating": "1", "version": "7.0.0", "date": "2017-02-18T06:47:00-07:00", "title": "Doesn't work"}, {"content": "I can't complain about Tinder I've really had a great experience on it so far.", "rating": "5", "version": "7.0.0", "date": "2017-02-18T06:24:00-07:00", "title": "Great"}, {"content": "This app barely works. Always has a problem", "rating": "1", "version": "7.0.0", "date": "2017-02-18T06:13:00-07:00", "title": "Always an error"}, {"content": "Since update my location is forever searching", "rating": "2", "version": "7.0.0", "date": "2017-02-18T03:41:00-07:00", "title": "Location not showing"}, {"content": "Bring back snap stories just like Snapchat and Instagram", "rating": "5", "version": "7.0.0", "date": "2017-02-18T03:06:00-07:00", "title": "Bring back stories"}, {"content": "Sick", "rating": "5", "version": "7.0.0", "date": "2017-02-18T02:17:00-07:00", "title": "Ye"}, {"content": "Does exactly what it says on the tin der", "rating": "5", "version": "7.0.0", "date": "2017-02-17T21:32:00-07:00", "title": "Ronsons"}, {"content": "Didn't work", "rating": "1", "version": "7.0.0", "date": "2017-02-17T21:30:00-07:00", "title": "Didn't work"}, {"content": "Go for it guys and girls and make it happen 🤙", "rating": "5", "version": "7.0.0", "date": "2017-02-17T20:50:00-07:00", "title": "What an apps 😍😍😍"}, {"content": "Used to be good. Reloaded after a few months and app runs rubbish. Sometimes you get different profiles pop up during swiping so you dont know who youve swiped. Tinder, get back to basics.", "rating": "1", "version": "7.0.0", "date": "2017-02-17T19:37:00-07:00", "title": "Rubbish"}, {"content": "boring", "rating": "1", "version": "7.0.0", "date": "2017-02-17T18:46:00-07:00", "title": "the man"}, {"content": "Overall I would say this is the best dating app around as its free an accessible to everyone", "rating": "4", "version": "7.0.0", "date": "2017-02-17T15:44:00-07:00", "title": "Great app"}, {"content": ".£?", "rating": "5", "version": "7.0.0", "date": "2017-02-17T15:33:00-07:00", "title": "Good"}, {"content": "The app's gone from working fine to opening the app and nothing will load. So frustrating when I keep getting notifications and the App doesn't work", "rating": "1", "version": "7.0.0", "date": "2017-02-17T13:48:00-07:00", "title": "Ahhhhhhhhh"}, {"content": "I've been using Tinder for the past month and haven't had the best experience.\n\nI am no longer getting any cards in my area even though others that use it are.", "rating": "1", "version": "7.0.0", "date": "2017-02-17T13:35:00-07:00", "title": "Disappointed"}, {"content": "Lovely app, does the job 😊", "rating": "4", "version": "7.0.0", "date": "2017-02-17T13:08:00-07:00", "title": "Lovely app"}, {"content": "Always searching", "rating": "1", "version": "7.0.0", "date": "2017-02-17T13:07:00-07:00", "title": "Location never loads"}, {"content": "App crashes when I open chats and sometimes just spontaneously.  \n\nSoftware Engineers have c**k blocked a fellow developer. Not cool lads.", "rating": "1", "version": "7.0.0", "date": "2017-02-17T12:31:00-07:00", "title": "Absolute traaaash software dev"}, {"content": "Been using it for two weeks. Completely broken mess. Half the time it just doesn't work at all, like it can't reach the Tinder servers or something. Other half the time notifications are FUBAR. Two recent app updates have only added more problems.", "rating": "1", "version": "7.0.0", "date": "2017-02-17T10:12:00-07:00", "title": "Bugs bugs bugs"}, {"content": "This app is honestly addictive, if it wasnt for the 12hr ban i could swipe for days", "rating": "5", "version": "7.0.0", "date": "2017-02-17T09:02:00-07:00", "title": "Cant get enough"}, {"content": "An easy effective app, very quick and easy anyone could use the app", "rating": "4", "version": "7.0.0", "date": "2017-02-17T08:05:00-07:00", "title": "Overall satisfied"}, {"content": "Amazing , fantastic app .\nBut nothing happened onestly !\nNo matches no nothing \n😬😐😕", "rating": "4", "version": "7.0.0", "date": "2017-02-17T07:36:00-07:00", "title": "Amazing!"}, {"content": "Bad update, doesn't load at all now", "rating": "1", "version": "7.0.0", "date": "2017-02-17T04:55:00-07:00", "title": "Doesn't work"}, {"content": "It is good, only getting 150 likes per 12 hours is actually quite little considering the millions that use it; I know you can get tinder plus for unlimited likes but I think it's a waste of money.\nSetting distances is useful cause I hate matching with people on Badoo that live 500 miles away haha\nAlways a little glitch where sometimes I like someone but then it'll show the animation of liking someone else then going back to the person you intended to like.\nA lot of people aren't active on tinder any more so I wish there was a way to filter people who have been on the app in the last month so you're not wasting 299 likes a day on people who deleted the app a year ago.", "rating": "4", "version": "7.0.0", "date": "2017-02-17T04:51:00-07:00", "title": "Might as well get it"}, {"content": "Stealing your money useless app rubbish highly recommended to NOT use loosers", "rating": "1", "version": "7.0.0", "date": "2017-02-17T03:20:00-07:00", "title": "Absolutely rubbish"}, {"content": "Continual bug problems; will say I have messages waiting and then there is nothing new. The same in reverse. I'll click on the convos icon in the corner and I'll have five messages that it didn't notify me about. Annoying", "rating": "1", "version": "7.0.0", "date": "2017-02-17T02:57:00-07:00", "title": "Continual bug problems"}, {"content": "Only downloaded the app to try it as recommended by a friend and so far it's mainly a bunch of dickheads. Just being honest.", "rating": "3", "version": "7.0.0", "date": "2017-02-17T02:21:00-07:00", "title": "Sorrynotsorry"}, {"content": "Mainly  a response to a message below from Tanya! She's using you guys wake up!", "rating": "1", "version": "7.0.0", "date": "2017-02-16T23:45:00-07:00", "title": "Tanya needs to stop using guys!"}, {"content": "Doesn't notify when notifications are on, every time it updates it resets and tells me how to use it again with annoying pop ups I have to click before it lets me continue, and now I can't login at all since I've upgraded my phone!", "rating": "1", "version": "7.0.0", "date": "2017-02-16T17:02:00-07:00", "title": "Awful app"}, {"content": "It is a good app aside from 90% of girl who \"like\" you just send you links to stupid websites that want your credit card details... Please fix this and add anti spam filters or something!", "rating": "1", "version": "7.0.0", "date": "2017-02-16T16:29:00-07:00", "title": "Fix the spam"}, {"content": "Seriously, you can only log in with a bookface account?? Great for the normal people that don't have one!  Fail.", "rating": "1", "version": "7.0.0", "date": "2017-02-16T15:43:00-07:00", "title": "Only Facebook log in??"}, {"content": "It's a great app.. easy to get along with, best thing your actually having conversations with real people for once. And don't forget it's free. So what's to loose.. if your single get on tinder and get ready to mingle..", "rating": "5", "version": "7.0.0", "date": "2017-02-16T15:34:00-07:00", "title": "Dr."}, {"content": "Yea boi yes ladies shout out to the dtf gyalla out dere lovin the vibes", "rating": "5", "version": "6.9.4", "date": "2017-02-16T14:47:00-07:00", "title": "Sexy gyal do the lean and bop"}, {"content": "99% made up and fake profiles....waste of time", "rating": "1", "version": "6.9.4", "date": "2017-02-16T14:41:00-07:00", "title": "Fakes Galore"}, {"content": "The rumours aren't true. I have meet ups with some lovely respectful men. It's fantastic that people can not contact you unless they matched. Happy to continue until I find the one.", "rating": "5", "version": "6.9.4", "date": "2017-02-16T14:41:00-07:00", "title": "Great"}, {"content": "I would like to say this app is buggy because I get matches, but I can't as I maybe a genuine munter, which is my problem not your's I blame my mother poor choice in men", "rating": "3", "version": "6.9.4", "date": "2017-02-16T14:22:00-07:00", "title": "😏"}, {"content": "Such a great app now stop asking me to review", "rating": "4", "version": "6.9.4", "date": "2017-02-16T13:42:00-07:00", "title": "Great"}, {"content": "The app constantly bugs out. Constantly. Sometimes for days. I swear I don't know any other app that is so buggy. Sort it out tinder.", "rating": "1", "version": "6.9.4", "date": "2017-02-16T05:11:00-07:00", "title": "Bugs all day every day"}, {"content": "Great app", "rating": "5", "version": "6.9.4", "date": "2017-02-16T03:43:00-07:00", "title": "Good app"}, {"content": "Been on it for 2 months and after a series of dates, mostly good, have met a really nice guy who was direct and upfront from the onset. 👍🏾", "rating": "5", "version": "6.9.4", "date": "2017-02-16T03:06:00-07:00", "title": "Great for meeting guys who are serious"}, {"content": "This app is a joke it never works at all now either not logging in or saying a server error! So it's a joke people buy it and it never works frauds..", "rating": "1", "version": "6.9.4", "date": "2017-02-16T02:31:00-07:00", "title": "Painful"}, {"content": "I've come to terms with the fact it isn't faulty haha", "rating": "5", "version": "6.9.4", "date": "2017-02-16T02:10:00-07:00", "title": "Good fun. My face is not their fault"}, {"content": "Stuck on \"you must wait another 11:59\" forever.", "rating": "1", "version": "6.9.4", "date": "2017-02-16T01:03:00-07:00", "title": "Broken update"}, {"content": "Tinder is tinder but I've noticed a few bugs, such as when swiping the next profile will jump in front of the one i was look at. \n\nAlso, wow theres quite a lot of fake accounts or chat bots, they often try to get you to download some chat program or something. My friend had the same bot, word for word, same occupation etc. This REALLY needs to be fixed, this isn't plenty of fish which was just me and 40,000 asian scammers.", "rating": "2", "version": "6.9.4", "date": "2017-02-16T00:48:00-07:00", "title": "A few bugs and some fake accounts"}, {"content": "Doesn't work, at all.", "rating": "1", "version": "6.9.4", "date": "2017-02-15T22:53:00-07:00", "title": "Worthless broken app"}, {"content": "Full of bots / dead accounts\nLack of matches to sell Boost feature", "rating": "2", "version": "6.9.4", "date": "2017-02-15T16:39:00-07:00", "title": "Not good anymore"}, {"content": "Well I downloaded tinder because like me I'm  horny man who's always after abit of putang! After swiping left or right to chose the right fitty on this app I was shocked that I didn't get that many like and I had to wait 12hours for more likes!! But that's just a minor issue I'm sure they'll sort it one day! Anyways after spending most of my time on here it turns out I'm still a horny single and am looking for abit on the side but I'm sure I'll find something soon! Keep swiping folks!!", "rating": "4", "version": "6.9.4", "date": "2017-02-15T14:31:00-07:00", "title": "Not too bad but need a few more likes"}, {"content": "All good", "rating": "5", "version": "6.9.4", "date": "2017-02-15T14:20:00-07:00", "title": "Thumbs up"}, {"content": "🌟🌟🌟🌟🌟", "rating": "5", "version": "6.9.4", "date": "2017-02-15T08:53:00-07:00", "title": "Jq"}, {"content": "I swiped to accept someone and it's saying that matched with me but it's just a clear circle and every time I go to click it, I get kicked out of the app, also it sometimes adds two accents to one bit and I either match or not match the correct person. Other than that it's really good", "rating": "3", "version": "6.9.4", "date": "2017-02-15T06:17:00-07:00", "title": "It's a good app but there's bugs"}, {"content": "Would be great, if it worked. 50% of people are spam.\nVery buggy.", "rating": "1", "version": "6.9.4", "date": "2017-02-15T05:28:00-07:00", "title": "Diabolical"}, {"content": "Sort out please I just starting to the cool chick sort out please!!", "rating": "1", "version": "6.9.4", "date": "2017-02-15T02:57:00-07:00", "title": "AP lad"}, {"content": "Signed up for preimum and now its not working tried deleting app and restoring my phone no luck piss take i want a refund", "rating": "1", "version": "6.9.4", "date": "2017-02-15T02:28:00-07:00", "title": "Signed up for premium"}, {"content": "This is where me and my girl met", "rating": "5", "version": "6.9.4", "date": "2017-02-14T14:54:00-07:00", "title": "Class!"}, {"content": "Piece of rubbish hasn't worked for me for months. Every time I try to log in it says error 40303. I have the latest version, connected to Facebook on an iPhone SE with the latest OS. Tried reinstalling it several times but no use. Bad!", "rating": "1", "version": "6.9.4", "date": "2017-02-14T11:19:00-07:00", "title": "Doesn't work"}, {"content": "Doesn't work on 4g just wifi", "rating": "1", "version": "6.9.4", "date": "2017-02-14T11:12:00-07:00", "title": "Rubbish"}, {"content": "Can't change distance settings so uninstalled and reinstalled app now I can't log in at all! Always been buggy since I have had it but getting worse recently, shame it is a really good concept and well presented!", "rating": "2", "version": "6.9.4", "date": "2017-02-14T10:29:00-07:00", "title": "A few too many bugs"}, {"content": "don't waste your time this app is a joke, crashes, profiles appear that you didn't save or click on etc etc buggy complete waste of time!\nJOKE!", "rating": "1", "version": "6.9.4", "date": "2017-02-14T09:37:00-07:00", "title": "joke!"}, {"content": "Gets rid of my boredom", "rating": "4", "version": "6.9.4", "date": "2017-02-14T04:34:00-07:00", "title": "Pretty decent"}, {"content": "Cannot even open the app", "rating": "1", "version": "6.9.4", "date": "2017-02-14T02:17:00-07:00", "title": "Mrs"}, {"content": "Won't even let me log in. Really really really really bad app.", "rating": "1", "version": "6.9.4", "date": "2017-02-13T17:03:00-07:00", "title": "Really really bad"}, {"content": "Just reviewing to get the pesky prompt to go away! But the app works, it's good, doesn't crash, and is very intuitive! \n\nBesides the above, I do actually think the app itself is great. The concept is fantastic and I never get any issues when using this app!", "rating": "5", "version": "6.9.4", "date": "2017-02-13T15:16:00-07:00", "title": "Review"}, {"content": "I think it's actually better now that the age has been risen. I'm loving that nothing hasn't changed too much , however like they need to bring back 'moments' it was a quick signal for you to message someone. Since we are able to connect to instagram, I think it'd be great if instagram videos from our pages could play, not just the images appearing .", "rating": "3", "version": "6.9.4", "date": "2017-02-13T15:02:00-07:00", "title": "Great but..."}, {"content": "Is really frustrating. Starts really well and after a while stops working, can't login, doesn't let send emails.\nDon't spend the money with it, I did and regret.", "rating": "1", "version": "6.9.4", "date": "2017-02-13T13:13:00-07:00", "title": "Crashes a lot. Doesn't work."}, {"content": "Seems to do what it says", "rating": "3", "version": "6.9.4", "date": "2017-02-13T07:44:00-07:00", "title": "It works"}, {"content": "Met an absolute 10/10 on here. Possibly the best looking guy Ive ever met and a personality of a gem. Rating tinder highly", "rating": "5", "version": "6.9.4", "date": "2017-02-13T05:26:00-07:00", "title": "10/10"}, {"content": "Lovely app", "rating": "5", "version": "6.9.4", "date": "2017-02-13T04:14:00-07:00", "title": "So fun"}, {"content": "It would be a decent app if it worked on phone data and not only wifi. Never works unless I'm on wifi", "rating": "2", "version": "6.9.4", "date": "2017-02-13T00:55:00-07:00", "title": "Not too bad"}, {"content": "Tinder helped me 💦 a good few times so it's a 👍🏽 from me", "rating": "5", "version": "6.9.4", "date": "2017-02-12T18:10:00-07:00", "title": "Thanks tinder"}, {"content": "The concept of the app is ok I guess, but in 2017 I shouldn't be experiencing errors for something which I have paid money for! \n\nConstantly being told there is an error logging in - WHY?", "rating": "1", "version": "6.9.4", "date": "2017-02-12T17:56:00-07:00", "title": "Poor app"}, {"content": "Just a brilliant app", "rating": "5", "version": "6.9.4", "date": "2017-02-12T17:41:00-07:00", "title": "Brilliant"}, {"content": "this app has had really bad bugs for a while now. most recent one being that after i've clicked on a profile it takes too long to load the next after but loads the one after that so i often accidentally end up swiping left on people without getting to look at them", "rating": "1", "version": "6.9.4", "date": "2017-02-12T15:47:00-07:00", "title": "PLEASE FIX"}, {"content": "Really easy to use straightforward app. I've used a few dating apps now. Most the others I've found to be terrible. It's not as good as bumble though.", "rating": "4", "version": "6.9.4", "date": "2017-02-12T08:13:00-07:00", "title": "It's good but bumble is better"}, {"content": "🤤🤤🤤👊🏻💦💦", "rating": "5", "version": "6.9.4", "date": "2017-02-12T08:07:00-07:00", "title": "🤤"}, {"content": "Paid for unlimited swipes but it's still limited!!! Don't pay for tinder plus. It's not limited swipes. It's about 500 instead of 100 free and then it blocks you for 1 day. False advertising from tinder to make u pay and very poor customer service.", "rating": "1", "version": "6.9.4", "date": "2017-02-12T07:33:00-07:00", "title": "Don't pay for tinder plus. !!!"}, {"content": "As soon as I paid for a 6 months it stops working. Only had it for about 4 days was getting a lot of matches and actually was arranging dates it suddenly stopped letting me log in. This is shocking.", "rating": "1", "version": "6.9.4", "date": "2017-02-12T03:53:00-07:00", "title": "Paid and it stopped working"}, {"content": "I swiped about 200 people then all the profiles disappeared and everything I try they still gone , just keeps searching", "rating": "1", "version": "6.9.4", "date": "2017-02-12T03:24:00-07:00", "title": "Buggy"}, {"content": "Bought the app for 6 months and it keeps crashing and not usable anymore after the 1st month.\n\nTried their support and reinstalling the app and etc and all was useless.", "rating": "1", "version": "6.9.4", "date": "2017-02-12T02:49:00-07:00", "title": "crashes with no solution"}, {"content": "When I am out and about I can't message people unless I have wifi sort it out", "rating": "1", "version": "6.9.4", "date": "2017-02-12T02:00:00-07:00", "title": "Terrible"}, {"content": "Can be glitchy at times, but other than that a good app", "rating": "4", "version": "6.9.4", "date": "2017-02-12T01:56:00-07:00", "title": "Tinder"}, {"content": "Can't log in, Doesn't load anything, Won't even let me delete my account because of \"errors\".", "rating": "1", "version": "6.9.4", "date": "2017-02-12T01:34:00-07:00", "title": "I can't even log in"}, {"content": "Top notch for meeting new people and got hookups...", "rating": "5", "version": "6.9.4", "date": "2017-02-11T16:47:00-07:00", "title": "Nash hepburne"}, {"content": "Lovely works well", "rating": "5", "version": "6.9.4", "date": "2017-02-11T16:15:00-07:00", "title": "Tinder"}, {"content": "Please sort it out.", "rating": "1", "version": "6.9.4", "date": "2017-02-11T15:54:00-07:00", "title": "Doesn't work without wifi"}, {"content": "Tinder is Full of fake profiles. \n\nI have been paying for tinder plus for about 16months but I've finally cancelled my subscription due to the amount of fake profiles. I am Sick of paying tinder a monthly fee when they are Doing absolutely nothing to stop fake profiles. \n\nI report fake profiles all time but I think it's a waste of time because you report one then a few swipes later you have come across another lot of fake profiles. \n\nTinder use to text a code to your mobile so you could verify your not a fake person but tinder got rid of that verification process. It's as if tinder wants fake profiles on there site as they are doing nothing to prevent them.", "rating": "1", "version": "6.9.4", "date": "2017-02-11T14:21:00-07:00", "title": "Full of Fake profiles. It's a JOKE"}, {"content": "I download this app just for confidence building I think it's brill", "rating": "5", "version": "6.9.4", "date": "2017-02-11T14:08:00-07:00", "title": "Great"}, {"content": "Can't edit my profile, can't upload pics, can't change distance, forever searching for matches then it'll say error. Wtf", "rating": "1", "version": "6.9.4", "date": "2017-02-11T11:39:00-07:00", "title": "Stopped working"}, {"content": "Great app, especially in a big city.", "rating": "5", "version": "6.9.4", "date": "2017-02-11T11:18:00-07:00", "title": "Great App"}, {"content": "You can't use the app unless you have a Facebook account and then it wants to access all your friends' data. I'm sure this must breach the data protection because I don't have their permission. Avoid.", "rating": "1", "version": "6.9.4", "date": "2017-02-11T08:50:00-07:00", "title": "Terrible"}, {"content": "It's okay but you guys need to improve on so many things, I mean read up on the rest reviews", "rating": "3", "version": "6.9.4", "date": "2017-02-11T08:42:00-07:00", "title": "👍"}, {"content": "Great jokers up on tinder banter", "rating": "5", "version": "6.9.4", "date": "2017-02-11T07:32:00-07:00", "title": "Banter"}, {"content": "A curious app that is surprisingly fun and addictive. A nice way to be introduced to new people. On the other hand a cruel hot or not game.", "rating": "4", "version": "6.9.4", "date": "2017-02-11T07:21:00-07:00", "title": "Intriguing"}, {"content": "I used to like this app a lot but now it's so laggy and wants nothing but ur in-app purchases.", "rating": "1", "version": "6.9.4", "date": "2017-02-11T03:37:00-07:00", "title": "No longer working well"}, {"content": "This app has seriously gone down hill. No one ever talks anymore. Bring back moments!", "rating": "3", "version": "6.9.4", "date": "2017-02-11T03:08:00-07:00", "title": "Bring back moments!"}, {"content": "A solid app but the messaging is very temperamental", "rating": "4", "version": "6.9.4", "date": "2017-02-11T01:29:00-07:00", "title": "Solid"}, {"content": "Worked fine the first couple of days! Now can't even get on the thing! Sort it out!", "rating": "1", "version": "6.9.4", "date": "2017-02-10T14:14:00-07:00", "title": "Would help if you could actually get on the app!!!!"}, {"content": "Not sure about how the ladies find this, but 66% of 'people' on this are now bots / fake profiles. \nThey match, send you a message to visit another link/site. It basically means that communication for males to females is not really happening as its more than likely a bot, not a person. I think Tinder has had its innings now.", "rating": "1", "version": "6.9.4", "date": "2017-02-10T14:08:00-07:00", "title": "Bots everywhere"}, {"content": "Yeh pretty decent", "rating": "4", "version": "6.9.4", "date": "2017-02-10T12:37:00-07:00", "title": "It's alright"}, {"content": "The quality of the pictures of users is good. One can easily abuse oneself whilst  looking and enjoying images.\nSadly the ladies think 'they're better'n me!' But you're going to get that with singles who go first by looks and then say stuff like 'it's what's inside that counts!' \nSo, good images and a wide variety of people to look at. But if you want anything more than a bit pretty faces...try a local bar, public house or club.", "rating": "3", "version": "6.9.4", "date": "2017-02-10T09:55:00-07:00", "title": "Tepid"}, {"content": "Shamefully paid for a month of this, not impressed. After an initial load of profiles it fails to load anymore, despite being in a city of 9 million people then travelling across country 100 miles to another city yet still it can't find any new profiles? Have to wait 12-24 hours then suddenly about two hundred appear out of no where. Tells me I've matched but shows nothing until I turn my phone off and on and then the match finally appears. People I've unmatched still show as notifications so the app icon just keeps clocking up, till I get a new new match then it goes to '1' again. Half way through typing a reply and the app crashes out so I lose what I've typed. Very disappointing. For reference I've got a 4 week old iPhone 7 plus with a fresh install 🙄 sort it out tinder.\nEdit - just tried boost, suddenly loaded loads of profiles, and I was matching a new person every 10 seconds was crazy, soon as boost runs out no one new around me. What a con!", "rating": "1", "version": "6.9.4", "date": "2017-02-10T02:43:00-07:00", "title": "Buggy buggy buggy"}, {"content": "This app is ok, but in my experience it's full of single mums who ponce a living from the government, not my cup of tea. Trying to find a hard working woman that owns her own home is like trying to find a needle in a haystack. Little dodgy on mobile data", "rating": "2", "version": "6.9.4", "date": "2017-02-09T21:20:00-07:00", "title": "Not bad but"}, {"content": "Can't log in on my iPhone 7 plus and support is pretty much non-existent.", "rating": "1", "version": "6.9.4", "date": "2017-02-09T16:29:00-07:00", "title": "Useless"}, {"content": "It was working fine before the update, but now it won't actually show any potential matches - just is forever searching!! So annoying", "rating": "1", "version": "6.9.4", "date": "2017-02-09T13:46:00-07:00", "title": "SO BAD"}, {"content": "I love this app", "rating": "5", "version": "6.9.4", "date": "2017-02-09T12:10:00-07:00", "title": "Great app"}, {"content": "Simply the best place to get great company.", "rating": "5", "version": "6.9.4", "date": "2017-02-09T10:47:00-07:00", "title": "Reviewing"}, {"content": "It just gets worse and worse with every update, hardly ever lets me log in and if it does it just crashes over and over again, used to be fun but it's just frustrating, If you don't have it i wouldn't bother getting  it.", "rating": "1", "version": "6.9.4", "date": "2017-02-09T08:52:00-07:00", "title": "Awful"}, {"content": "Broken app.. Keeping getting notifications but nothing refreshes in app..\nSwipe left or right, close the app, then the same people show up again..\nPay for premium too, so service is terrible..", "rating": "1", "version": "6.9.4", "date": "2017-02-09T08:33:00-07:00", "title": "Appalling for the money they charge!"}, {"content": "Done", "rating": "5", "version": "6.9.4", "date": "2017-02-09T04:56:00-07:00", "title": "."}, {"content": "Is not worth the tinder plus I am paying. I'm not happy at all. Just isn't working at all. Get it sorted!!!", "rating": "1", "version": "6.9.4", "date": "2017-02-09T01:53:00-07:00", "title": "Last update wrecked it"}, {"content": "My tinder plus is supposed finish on the 22nd of feb, yet since the new bs update it keeps telling me that my subscription has ended. Im not subscribing again if this crap continues.", "rating": "2", "version": "6.9.4", "date": "2017-02-09T00:41:00-07:00", "title": "Warriors blew a 3-1 lead"}, {"content": "Wow", "rating": "5", "version": "6.9.4", "date": "2017-02-08T18:43:00-07:00", "title": "Ohhh wow"}, {"content": "Lately, I've been noticing an uprising of spam bots and they needs to be removed. \n\nPlease implement something like a bot detector/filter. \nT I A", "rating": "3", "version": "6.9.4", "date": "2017-02-08T16:29:00-07:00", "title": "Needs a spam bot detector/filter"}, {"content": "I would give you 4 or 5 stars but you constantly ask me to rate your app and it's sooo annoying!  And an iPad would be great too.", "rating": "1", "version": "6.9.4", "date": "2017-02-08T15:23:00-07:00", "title": "Please rate me every five minutes because I'm desperate"}, {"content": "Easy to use and no hidden agendas to make u pay", "rating": "5", "version": "6.9.4", "date": "2017-02-08T14:50:00-07:00", "title": "Simples"}, {"content": "App doesn't even let me log in with Facebook since update. I still receive notifications, absolutely awful.", "rating": "1", "version": "6.9.4", "date": "2017-02-08T13:06:00-07:00", "title": "ERROR 40303"}, {"content": "Honestly? It's just fun. Don't take yourself too seriously, and enjoy the opportunity to say funny stuff to strangers. If anyone offends you? Unmatch!", "rating": "5", "version": "6.9.4", "date": "2017-02-08T11:46:00-07:00", "title": "Plain old fun"}, {"content": "Perfect apart from the odd fake account and the fake notifications you sometimes get.", "rating": "4", "version": "6.9.4", "date": "2017-02-08T09:11:00-07:00", "title": "Great"}, {"content": "Found myself permently banned within a week of using this site though I never sent a message to anyone so I find it hard to believe so many users reported me in that time just because I didn't have any pictures up. I was only testing the water and if I had known I would get permently banned for this of course I would of had a recent picture up. Seemed a decent site too, oh well I have no luck..", "rating": "1", "version": "6.9.4", "date": "2017-02-08T06:59:00-07:00", "title": "Banned just for checking it out"}, {"content": "It's banging. I've turned into a right whore😈come at me boys", "rating": "5", "version": "6.9.4", "date": "2017-02-08T06:20:00-07:00", "title": "Tinder babe"}, {"content": "I chat to loads of people. Meetings are few and far between and usually not great matches for relationships. But great for meeting new people", "rating": "4", "version": "6.9.4", "date": "2017-02-08T06:01:00-07:00", "title": "Alright for chatting"}, {"content": "You know what you're getting and it does exactly what it says on the tin.", "rating": "5", "version": "6.9.4", "date": "2017-02-08T05:14:00-07:00", "title": "Is what it is"}, {"content": "Simple and easy to use !", "rating": "5", "version": "6.9.4", "date": "2017-02-08T04:09:00-07:00", "title": "Great dating app"}, {"content": "Good easy to use", "rating": "4", "version": "6.9.4", "date": "2017-02-08T00:29:00-07:00", "title": "Tinder"}, {"content": "The app keeps crashing after the most recent update and won't work on network data only on wifi.", "rating": "2", "version": "6.9.4", "date": "2017-02-07T23:22:00-07:00", "title": "Crashes all the time after update"}, {"content": "Great app easy and fun to use. I hope it doesn't ask me again to review the app as I have done it now.", "rating": "5", "version": "6.9.4", "date": "2017-02-07T20:02:00-07:00", "title": "Great app"}, {"content": "The app used to work great untill few weeks back, now all of a sudden i get a small number of people no matter what radius, and once im done swiping it keeps searching forever. ONLY SHOWS PEOPLE IF I USE BOOST FEATURE. I ONLY get matches if i use boost and if i change locations aswell it doesn't show new people the apps gone reallly buggyy.", "rating": "2", "version": "6.9.4", "date": "2017-02-07T18:29:00-07:00", "title": "Not the same as before"}, {"content": "NOT BAD", "rating": "4", "version": "6.9.4", "date": "2017-02-07T16:35:00-07:00", "title": "OK"}, {"content": "Fantastic", "rating": "5", "version": "6.9.4", "date": "2017-02-07T15:17:00-07:00", "title": "Fantastic"}, {"content": "Tinder needs to learn that it needs a login system, because it's forever breaking and not working because it relys on linking with Facebook!", "rating": "1", "version": "6.9.4", "date": "2017-02-07T15:09:00-07:00", "title": "One day tinder you'll make it big...."}, {"content": "Good", "rating": "5", "version": "6.9.4", "date": "2017-02-07T13:46:00-07:00", "title": "Good"}, {"content": "Decent", "rating": "2", "version": "6.9.4", "date": "2017-02-07T13:20:00-07:00", "title": "Merh"}, {"content": "I mean it's tinder...we all know tinder. \nNo need to review", "rating": "4", "version": "6.9.4", "date": "2017-02-07T13:16:00-07:00", "title": "Just want it to stop popping up saying Write a review!"}, {"content": "Constantly displays server error, asks me constantly to log in with facebook. Gives me notifications but can't get on to respond, only occasionally works via 4G normally need to be on wifi. Piss poor!", "rating": "1", "version": "6.9.4", "date": "2017-02-07T12:40:00-07:00", "title": "Endless problems"}, {"content": "Decent", "rating": "5", "version": "6.9.4", "date": "2017-02-07T12:13:00-07:00", "title": "Good"}, {"content": "Great to meet peeps.", "rating": "4", "version": "6.9.4", "date": "2017-02-07T11:51:00-07:00", "title": "Fun"}, {"content": "What's the point you can never get logged on 😡😡 absolutely grade A dog 💩", "rating": "1", "version": "6.9.4", "date": "2017-02-07T09:52:00-07:00", "title": "Waste of time"}, {"content": "Very happy with results", "rating": "5", "version": "6.9.4", "date": "2017-02-07T08:34:00-07:00", "title": "Great App"}, {"content": "Occasionally, whenever I match with a group or a female the icons disappear but when I click on the blank space, it sends back to my homescreen as if it has crashed. Some of these bishes are hot too and I wanna get my schlomg wet.", "rating": "2", "version": "6.9.4", "date": "2017-02-07T06:40:00-07:00", "title": "Matches dissapear"}, {"content": "Overall a good and easy to use app, but there should be something in place for people who match and don't talk, which happens a lot and kind of defeats the purpose of a dating app. Perhaps a max silence period after which the match gets deleted from your list..?", "rating": "4", "version": "6.9.4", "date": "2017-02-07T06:32:00-07:00", "title": "Too many silent match collectors!"}, {"content": "I've experienced issues with this since the most recent update. \n\nI've tried changing settings and location, however all no use. I've contacted support and was told to do everything I've already tried and no use.\n\nIm no longer able to find any matches.", "rating": "1", "version": "6.9.4", "date": "2017-02-07T06:15:00-07:00", "title": "App broken since update"}, {"content": "Kthanks", "rating": "3", "version": "6.9.4", "date": "2017-02-07T03:19:00-07:00", "title": "I just want it to stop popping up when I use it"}, {"content": "It's pish! Crashes all the time", "rating": "1", "version": "6.9.4", "date": "2017-02-07T03:07:00-07:00", "title": "Jabroney"}, {"content": "Brill app great to get ur pic from Facebook easy to use simple plenty of meets excellent work tinder", "rating": "5", "version": "6.9.4", "date": "2017-02-07T02:02:00-07:00", "title": "Great brilliant app"}, {"content": "Does the job 😂", "rating": "5", "version": "6.9.4", "date": "2017-02-06T23:14:00-07:00", "title": "It's decent"}, {"content": "It crashes NINE time out of 10 (LITERALLY!!) as written in plenty of other reviews. Tried on various phones (all original unmodified OS) including 2 brand new ones with no other apps installed. Always the same.", "rating": "1", "version": "6.9.4", "date": "2017-02-06T16:36:00-07:00", "title": "Appalling...!!!!!!!!!"}, {"content": "App is always breaking on me. So I always delete it.", "rating": "1", "version": "6.9.4", "date": "2017-02-06T14:27:00-07:00", "title": "Terrible"}, {"content": "App is on but don't find girls I like. Still waiting and hope for the best", "rating": "4", "version": "6.9.4", "date": "2017-02-06T13:22:00-07:00", "title": "Tinder"}, {"content": "I don't like that the info of a person disappears once you match with them", "rating": "2", "version": "6.9.4", "date": "2017-02-06T12:55:00-07:00", "title": "Just one problem"}, {"content": "Spam bots and catfish everywhere. Location services poor, lots of profiles from the USA (I'm in the south west U.K.)\n\nOther than that people don't talk if they do match... (not really something tinder can do to rectify that...but) just so you know!", "rating": "1", "version": "6.9.4", "date": "2017-02-06T12:43:00-07:00", "title": "More spam than a meat factory"}, {"content": "Good for ez shegs", "rating": "5", "version": "6.9.4", "date": "2017-02-06T12:36:00-07:00", "title": "Slags on tap"}, {"content": "It's constantly giving me a \"server error\" - yet I get notifications.\nIt's deleted my profile and matches TWICE.\nAnd I've been allowed on once in the last three months due to never ended issues.", "rating": "1", "version": "6.9.4", "date": "2017-02-06T10:35:00-07:00", "title": "THE WORST"}, {"content": "***Update: the latest app update has brought in several bugs with months old matches appearing in my 'most recent' section, and their messages are flying to the top of the list too... As soon as Tinder fixes this bug, the below is true again***\n\nThe original. And the best. Thankfully they've done a good job eradicating the bots and fake 'casual top o' profiles. Back to making more genuine connections!", "rating": "2", "version": "6.9.3", "date": "2017-02-06T00:29:00-07:00", "title": "Back on top!"}, {"content": "Until proven otherwise", "rating": "3", "version": "6.9.3", "date": "2017-02-05T22:12:00-07:00", "title": "Ok"}, {"content": "Unusable without wifi and therefore pointless.", "rating": "1", "version": "6.9.3", "date": "2017-02-05T15:27:00-07:00", "title": "Mostly fake profiles"}, {"content": "Getting laid 24-7", "rating": "5", "version": "6.9.3", "date": "2017-02-05T11:02:00-07:00", "title": "😍"}, {"content": "I loved this app, however since I lost my old phone! the new one, I've no way of switching.. logging out and in just logs me into the same account, even if I switch my FB around, even via the safari app.. please fix! I've even tried deleting the account, but nothing", "rating": "1", "version": "6.9.3", "date": "2017-02-05T10:49:00-07:00", "title": "No option to switch accounts"}, {"content": "Notifications come through fine, but then when I open the app to see them nothing loads? Terrible service on 3/4G only seems to work properly when connected to wifi. Otherwise it's constantly logging me out and then taking forever to reload matches. App also consistently asks for a review which is annoying af", "rating": "1", "version": "6.9.3", "date": "2017-02-05T04:22:00-07:00", "title": "Constant issues"}, {"content": "I've banged 25% of my tinder matches 😉✌🏽 sick app to find rebound after a break up", "rating": "5", "version": "6.9.3", "date": "2017-02-05T04:16:00-07:00", "title": "Stop Asking me for reviews"}, {"content": "The latest update for tinder seems to have added more bugs to it! Me and my friends do not receive notifications when we receive a new connection meaning that we sometimes miss out on matches and conversations as a result. Another big bug is that when you get a connection whilst on the app the notification appears but it also adds an extra connection that is blank that you cannot get rid of. If you click on this blank connection it freezes the app then kicks you off of it. The notification stays too meaning you have many notifications remaining on the app that you cannot get rid of. I hope that these bugs can be fixed in the next update to the app because it is a great app that you can have a lot of fun with!", "rating": "2", "version": "6.9.3", "date": "2017-02-05T03:55:00-07:00", "title": "A Few bugs that need fixing!"}, {"content": "When it's working it's an alright app but twice in the last 2 days it stops finding people no matter how big I make the distance. I've tried various things to get it working but I've been stuck on it for the last 12 hours so hopefully the app will work soon", "rating": "1", "version": "6.9.3", "date": "2017-02-05T00:29:00-07:00", "title": "It's okay when it works"}, {"content": "Can't use it properly as it always crashes and most of the time says cannot connect to Facebook. Server error always 😒", "rating": "2", "version": "6.9.3", "date": "2017-02-04T15:26:00-07:00", "title": "App always crashes"}, {"content": "I've just paid for your tinder plus and you've decided not to let me find anybody at all! I either want a refund or at least fix this problem thanks for wasting my money...", "rating": "1", "version": "6.9.3", "date": "2017-02-04T13:03:00-07:00", "title": "Joke?"}, {"content": "I wasn't able to log in for a week (emailed tinder support and got no reply) so I had to create a new account which also stopped working, it got stuck on searching for matches near me (I live in a city so what are the odds that it ran out of people - real slim) so overall this app is a good idea with terrible functionality", "rating": "1", "version": "6.9.3", "date": "2017-02-04T12:22:00-07:00", "title": "It's bugging"}, {"content": "Tinder randomly logged me out around Christmas time, and despite deleting and reinstalling the app numerous times, the app will not let me log in. Please sort this out :(", "rating": "1", "version": "6.9.3", "date": "2017-02-04T11:53:00-07:00", "title": "Won't let me log in"}, {"content": "I downloaded the app a few weeks ago, ever since then I have had non-stop issues. I've been losing matches.. messages aren't delivering to other people.. most of the time the main problem is the app not actually loading up. I loved the app when I first downloaded it, now it seems every day there is some type of problem. I also find the problem occurs with my mobile data more than with wifi. But I have just changed wifi provider and may not have wifi for a couple of weeks as I need to wait for the installation. If I can't access it using my data, then I guess that's another person that this company will lose to another company such as plenty of fish or okcupid etc. Please fix it tinder, I don't want to have to delete your app permanently and also tell any of my friends that are considering using the app that they will just be wasting their time and phone battery.", "rating": "1", "version": "6.9.3", "date": "2017-02-04T08:01:00-07:00", "title": "Loading and message problems."}, {"content": "It's getting really annoying\nTry fixing your bugs instead", "rating": "1", "version": "6.9.3", "date": "2017-02-04T06:53:00-07:00", "title": "STOP asking for reviews"}, {"content": "Full of fake profiles and spammers, waste of time and money", "rating": "1", "version": "6.9.3", "date": "2017-02-04T06:08:00-07:00", "title": "Full of fake profiles and spammers, waste of time and money"}, {"content": "I've never used an app that crashes and falsely accuses so many times. Tinder need to hire an all-new dev team as clearly the current monkeys are incapable. Considering the price, it's unforgivable. Guess I'll have to look some place else for easy hookups.", "rating": "1", "version": "6.9.3", "date": "2017-02-04T05:18:00-07:00", "title": "Lazy build quality"}, {"content": "Is good!", "rating": "5", "version": "6.9.3", "date": "2017-02-04T01:04:00-07:00", "title": "Good"}, {"content": "Where was this when I was in college?!?", "rating": "5", "version": "6.9.3", "date": "2017-02-03T20:16:00-07:00", "title": "I miss the best things"}, {"content": "Sometimes exhausting but generally good", "rating": "4", "version": "6.9.3", "date": "2017-02-03T16:42:00-07:00", "title": "Good for dating and making new friends"}, {"content": "The issue I have with tinder is that people keep collecting matches. Tinder needs to have a time limit on this. If you have not spoken to someone before a certain amount of time you're automatically unmatched. Also, there should be a receipt to show us when/if someone has read out replies. \nI hate that tinder is supposed to be a place to meet people and there is so many people just collecting matches and not speaking. A time limit need to be encouraged.", "rating": "1", "version": "6.9.3", "date": "2017-02-03T16:26:00-07:00", "title": "No one talks..."}, {"content": "Almost spent a year 'developing an app for 16-17 year olds', be-time this is done I'm gonna be 18 lol, this company is pathetic", "rating": "1", "version": "6.9.3", "date": "2017-02-03T16:13:00-07:00", "title": "How long are you going to take."}, {"content": "Too many issues", "rating": "1", "version": "6.9.3", "date": "2017-02-03T14:01:00-07:00", "title": "Server is down"}, {"content": "How do I change the difficulty setting?", "rating": "1", "version": "6.9.3", "date": "2017-02-03T13:56:00-07:00", "title": "This game is too hard"}, {"content": "Not bad although no matches yet😩", "rating": "4", "version": "6.9.3", "date": "2017-02-03T11:45:00-07:00", "title": "Mr Cass"}, {"content": "This will be a quick review. Generally speaking I find tinder to be very good. But atm the app constantly crashes when I try and change my data (copying something into the about me bit) and now when I start it up it just sits on the loading screen and won't load any people or messages up which is infuriating", "rating": "2", "version": "6.9.3", "date": "2017-02-03T06:19:00-07:00", "title": "Sometimes good sometimes bad"}, {"content": "Goodd", "rating": "5", "version": "6.9.3", "date": "2017-02-02T23:38:00-07:00", "title": "Good"}, {"content": "I LOVE TINDER. EASY TO USE AND LOADS OF FITTYS😂 I'll probably regret this in the morning but oh well. Find all your friends on this app, sneaky c*nts😂😩😂", "rating": "5", "version": "6.9.3", "date": "2017-02-02T17:52:00-07:00", "title": "Brill"}, {"content": "Wow this app is grate!!! Changed my lief!!!", "rating": "5", "version": "6.9.3", "date": "2017-02-02T13:00:00-07:00", "title": "Wow!"}, {"content": "Messages go every week when the app sends you a tip I was thinking of paying for the addons, think I will go else where", "rating": "1", "version": "6.9.3", "date": "2017-02-02T09:42:00-07:00", "title": "Messages just go"}, {"content": "Alright so far, still waiting for the one...", "rating": "4", "version": "6.9.3", "date": "2017-02-02T08:18:00-07:00", "title": "."}, {"content": "It's good", "rating": "5", "version": "6.9.3", "date": "2017-02-01T21:04:00-07:00", "title": "Tin"}, {"content": "Really good", "rating": "5", "version": "6.9.3", "date": "2017-02-01T15:35:00-07:00", "title": "Mr"}, {"content": "So much better than POF(this is only my 2nd dating app) but is easy to use, easy to un match! Seem like mostly normal blokes on here (don't know about women 😂) \nStill haven't met the love of my life though...", "rating": "5", "version": "6.9.3", "date": "2017-02-01T15:14:00-07:00", "title": "Way better than POF"}, {"content": "It just stopped working at like the worst possible time, I was chatting up this bird. So please update soon and fix so I can get back to pullin.", "rating": "1", "version": "6.9.3", "date": "2017-02-01T12:48:00-07:00", "title": "Dude 4g or 3G isn't workin"}, {"content": "Bigdong69kush420lyfe got laid!", "rating": "4", "version": "6.9.3", "date": "2017-02-01T12:39:00-07:00", "title": "Bigdong69kush420lyfe got laid"}, {"content": "Tinder is my long term boyfriend by now, and I bloody love it. Crashes sometimes which is annoying, but other than that- best app ever.", "rating": "5", "version": "6.9.3", "date": "2017-02-01T12:19:00-07:00", "title": "🌟🌟🌟🌟🌟"}, {"content": "Yeah", "rating": "5", "version": "6.9.3", "date": "2017-02-01T11:28:00-07:00", "title": "Just here for the comments"}, {"content": "Fantastic and efficient app for finding stunning toy boys. Like a catalogue of humans! At 47, it can prove hard to find my ideal men in the outside world: fit, hard-bodied 24 year olds. But with Tinder all i need to do is swipe right, match or super like and strike up a conversation. Take it to the next level on Snapchat and then arrange to meet. If i've done my research thoroughly, it ends (or begins) with a fun dinner and some mutually pleasurable combining. Happy times!", "rating": "5", "version": "6.9.3", "date": "2017-02-01T09:32:00-07:00", "title": "Toy Boy Paradise"}, {"content": "Tinder used to be great but these last few updates have killed it. Matches constantly disappear, been stuck on 'there's no one new around you' for 3 days. Have unsubscribed to tinder plus. Who would pay for a service this cr*ppy?", "rating": "1", "version": "6.9.3", "date": "2017-02-01T08:02:00-07:00", "title": "Absolutely awful"}, {"content": "Still waiting for the one!", "rating": "5", "version": "6.9.3", "date": "2017-02-01T04:15:00-07:00", "title": "Good"}, {"content": "Y did I not get bae i swip left but I get denied I get 1 and it's a trans why tinder I ❤️u love meeeeeeee !!!!!!!", "rating": "1", "version": "6.9.3", "date": "2017-02-01T02:54:00-07:00", "title": "No Bae"}, {"content": "Cool", "rating": "5", "version": "6.9.3", "date": "2017-02-01T01:59:00-07:00", "title": "Great app"}, {"content": "👍🏼👍🏼", "rating": "5", "version": "6.9.3", "date": "2017-01-31T17:21:00-07:00", "title": "👍🏼"}, {"content": "Very poor service, get notifications saying someone's messaged me only to not see it, try to send a message only to say it can't be sent and plenty of times the app has decided to not work without wifi. Very very poor", "rating": "1", "version": "6.9.3", "date": "2017-01-31T16:05:00-07:00", "title": "Poor service"}, {"content": "Downloaded the app out of interest, ended up chatting to a lovely girl. After a week or so of talking on tinder, we finally met one Sunday night. After chatting well into the early hours (I left at 4am), we have been inseparable ever since. It's about to be 3 months since we made it official, and I feel like I've known her my whole life. Thanks to this app I have found my best friend, the love of my life and my soulmate. ❤️🌹🌹🌹", "rating": "5", "version": "6.9.3", "date": "2017-01-31T15:58:00-07:00", "title": "Found the love of my life"}, {"content": "All good", "rating": "5", "version": "6.9.3", "date": "2017-01-31T13:01:00-07:00", "title": "Good"}, {"content": "Fantastic app so easy to meet new people", "rating": "5", "version": "6.9.3", "date": "2017-01-31T12:50:00-07:00", "title": "App"}, {"content": "Waste of time", "rating": "5", "version": "6.9.3", "date": "2017-01-31T11:59:00-07:00", "title": "Dead"}, {"content": "I like it.", "rating": "5", "version": "6.9.3", "date": "2017-01-30T19:51:00-07:00", "title": "It's quite good."}, {"content": "Really easy to use. Fantastic!", "rating": "5", "version": "6.9.3", "date": "2017-01-30T18:56:00-07:00", "title": "Just get it!"}, {"content": "Boring, Boring & even more boring", "rating": "3", "version": "6.9.3", "date": "2017-01-30T14:55:00-07:00", "title": "Dull"}, {"content": "Its not the apps fault if you dont get what you want out of Tinder. If you kmow how to use it, or frame yourself it works well. Met a few people from this and, well... You know the rest.", "rating": "5", "version": "6.9.3", "date": "2017-01-30T14:36:00-07:00", "title": "Yep."}, {"content": "Just writing so I don't get in app notification, fingers crossed this works", "rating": "3", "version": "6.9.3", "date": "2017-01-30T12:07:00-07:00", "title": "App okay"}, {"content": "If she tastes of chicken keep on licking... if she tastes of trout kick her out", "rating": "5", "version": "6.9.3", "date": "2017-01-30T11:59:00-07:00", "title": "Chicken or Trout"}, {"content": "Really awesome app, would highly recommend if you're a human, download it, use it, enjoy it, talk about it.\n\nThere....that's my review....now please stop asking me to write a review....cheers ✌️", "rating": "5", "version": "6.9.3", "date": "2017-01-30T10:23:00-07:00", "title": "Great app"}, {"content": "Not bad for a start", "rating": "5", "version": "6.9.3", "date": "2017-01-30T08:22:00-07:00", "title": "Good"}, {"content": "So I pay for a subscription for tinder plus then you just go and take away my boosts now only 1 a month!!!", "rating": "1", "version": "6.9.3", "date": "2017-01-30T04:40:00-07:00", "title": "1 boost per month"}, {"content": "I have been experiencing problems with login in.. For about 4 months.. Messages do not send either. Customer service is terrible, I bought tinder plus and it did not work so I contacted costumer support to sort out the problem and they just fobbed me off and then just straight up ignored me. So I was left with a subscription to an app that did not work. Sort it out tinder you used to have a good app that worked now you have a broken app that's loosing its customer base rapidly 🖕", "rating": "5", "version": "6.9.3", "date": "2017-01-29T23:07:00-07:00", "title": "Very buggy and customer services is terrible"}, {"content": "Pretty much does what it meant to. Doesn't work when not on wifi properly though.", "rating": "3", "version": "6.9.3", "date": "2017-01-29T22:47:00-07:00", "title": "Miss"}, {"content": "It just doesn't work. Unable to login, server errors, have updated, uninstalled, reinstalled it's still so buggy. How can you still not sort it out?! Massive cockblock.", "rating": "1", "version": "6.9.3", "date": "2017-01-29T20:30:00-07:00", "title": "Server issue- AGAIN!!!"}, {"content": "I love Tinder, met so many iff my friends on there , not everyones on there to hook up.", "rating": "5", "version": "6.9.3", "date": "2017-01-29T16:08:00-07:00", "title": "Love it"}, {"content": "Decent app apparently", "rating": "2", "version": "6.9.3", "date": "2017-01-29T15:50:00-07:00", "title": "Yhyh"}, {"content": "you get the chance to talk to people you may never have thought about talking to through similar interests 👍", "rating": "4", "version": "6.9.3", "date": "2017-01-29T13:37:00-07:00", "title": "simple"}, {"content": "Stop asking me to review tinder once every week or sometimes even sooner, it will only make me want to say 1 star in reaction", "rating": "1", "version": "6.9.3", "date": "2017-01-29T13:14:00-07:00", "title": "Stop disrupting me"}, {"content": "😂", "rating": "4", "version": "6.9.3", "date": "2017-01-29T12:12:00-07:00", "title": "I wish Tinder would stop asking me to write a review"}, {"content": "Tried to create an account with my friend on her iPad and it wouldn't unlink her Facebook account even when I'm logged into facebook with my account! So I can't even try the app as my phone is a business phone. Would appreciate this unlinking of Facebook", "rating": "1", "version": "6.9.3", "date": "2017-01-29T10:34:00-07:00", "title": "Good to meet locals :)"}, {"content": "Will give the app full points for simplicity. Good for the busy person. The reason for two stars less as the app take ages to load sometimes on a mobile/ data network. \nAnd the paid account is pretty much useless I got the same from the free stuff", "rating": "3", "version": "6.9.3", "date": "2017-01-29T10:15:00-07:00", "title": "Points for simplicity"}, {"content": "Amazing.", "rating": "5", "version": "6.9.3", "date": "2017-01-29T08:39:00-07:00", "title": "Great"}, {"content": "I think everyone knows by now- but useful with a free tinder flame app to avoid extra charges", "rating": "4", "version": "6.9.3", "date": "2017-01-29T05:59:00-07:00", "title": "Does what it says"}, {"content": "Good way to meet new people", "rating": "3", "version": "6.9.3", "date": "2017-01-29T03:17:00-07:00", "title": "Okay"}, {"content": "Life would be crap without Tinder.", "rating": "5", "version": "6.9.3", "date": "2017-01-29T03:14:00-07:00", "title": "Tinder is what you make it"}, {"content": "Fairly good app", "rating": "4", "version": "6.9.3", "date": "2017-01-29T02:04:00-07:00", "title": "Tinder"}, {"content": "Great app", "rating": "5", "version": "6.9.3", "date": "2017-01-29T00:32:00-07:00", "title": "Brilliant"}, {"content": "My app just keeps crashing. \n\nI cannot even log in.\n\nFIX THIS!!!!!!!", "rating": "1", "version": "6.9.3", "date": "2017-01-28T17:12:00-07:00", "title": "Bad review"}, {"content": "You should add back the feature that tells you how long ago someone was last on the app or have a feature where it says if the message has been read. Would be helpful to tell if you're being ignored", "rating": "1", "version": "6.9.3", "date": "2017-01-28T15:40:00-07:00", "title": "Online"}, {"content": "does not let me go past the age select page", "rating": "1", "version": "6.9.3", "date": "2017-01-28T15:05:00-07:00", "title": "buggy"}, {"content": "The app deleted my account for no reason. Got an email saying I violated the terms and conditions, but I've read through the t&cs several times and I know for a fact I haven't so much as bent the rules. Regardless of whether it was an automatic response to another user falsely reporting me, or a glitch, tinder needs to sort itself out and gather evidence before deleting accounts.", "rating": "1", "version": "6.9.3", "date": "2017-01-28T13:30:00-07:00", "title": "Wrongful Account Deletion"}, {"content": "It's cool app to keep me company I guess", "rating": "4", "version": "6.9.3", "date": "2017-01-28T12:28:00-07:00", "title": "App"}, {"content": "Tinder works different to the others as members have to like each other before they contact each other which I think is quite a good idea", "rating": "5", "version": "6.9.3", "date": "2017-01-28T12:25:00-07:00", "title": "Works different"}, {"content": "Made two besties and got one bf from this thx xxx", "rating": "5", "version": "6.9.3", "date": "2017-01-28T11:52:00-07:00", "title": "Gr8"}, {"content": "It's good to meet people for hookups because that seems to be what most people use it for. I have made a couple friends though.", "rating": "3", "version": "6.9.3", "date": "2017-01-28T11:08:00-07:00", "title": "It's ok"}, {"content": "One star for bugging me to rate you all the time.", "rating": "1", "version": "6.9.3", "date": "2017-01-28T10:22:00-07:00", "title": "As requested"}, {"content": "This is a great game, I've completed it now though unfortunately. Could use some new content.", "rating": "5", "version": "6.9.3", "date": "2017-01-28T09:28:00-07:00", "title": "Great Game"}, {"content": "Only writing this because I can't be bothered with the in app when it comes up !! \n\nGot so much fanny from this app !!!! Two thumbs up 👍🏻👍🏻", "rating": "5", "version": "6.9.3", "date": "2017-01-28T09:26:00-07:00", "title": "Tinder review"}, {"content": "On the same boat as @superunknown88. \nI'm a plus user and I've had awful service, unnecessary worthless updates, half used boosts & cheating algorithm that NEEDS to be changed! \nTinder, hire a new tech engineer and do a GOOD job !", "rating": "1", "version": "6.9.3", "date": "2017-01-28T08:14:00-07:00", "title": "Worst"}, {"content": "please", "rating": "5", "version": "6.9.3", "date": "2017-01-28T04:43:00-07:00", "title": "stop asking me to review the app"}, {"content": "This app is pathetic.  It only works properly on wifi. When not on wifi it doesn't log in properly and repeatedly asks you for Facebook login, then says the server cannot be connected too.  This has been happening for MONTHS and MONTHS!!!   Why don't you sort it out? It seems they don't care, cos there isn't one other app I've ever used which does this....  It's pointless trying to use is unless you are on wifi.... Don't bother wasting your time.", "rating": "1", "version": "6.9.3", "date": "2017-01-28T04:28:00-07:00", "title": "Barely ever works on 3G/4G."}, {"content": "Giving it a go and see how it goes", "rating": "4", "version": "6.9.3", "date": "2017-01-28T03:55:00-07:00", "title": "Good app"}, {"content": "The app works fine, but the incessant pestering to write them a review is irritating. So here it is: 2 stars for annoying me with you constant insistence that I massage your egos.", "rating": "2", "version": "6.9.3", "date": "2017-01-28T03:10:00-07:00", "title": "Pestering!"}, {"content": "This app is the best thing I ever downloaded in me life (south west accent). Super likes left right and centre, but don't get ye hopes up, that's just moi. Recommended for all ye loners like me out there. Peace and love", "rating": "5", "version": "6.9.3", "date": "2017-01-28T02:26:00-07:00", "title": "Sick app"}, {"content": "👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻AMAZIN👌🏻👌🏻👌🏻👌🏻👌🏻", "rating": "5", "version": "6.9.3", "date": "2017-01-28T01:42:00-07:00", "title": "Amazin"}, {"content": "Good app, still a few glitches", "rating": "4", "version": "6.9.3", "date": "2017-01-28T01:16:00-07:00", "title": "Impressive idea"}, {"content": "Cracking app", "rating": "5", "version": "6.9.3", "date": "2017-01-27T23:43:00-07:00", "title": "Derdog"}, {"content": "👍 good", "rating": "5", "version": "6.9.3", "date": "2017-01-27T23:22:00-07:00", "title": "A+++"}, {"content": "Worth the money", "rating": "4", "version": "6.9.3", "date": "2017-01-27T19:51:00-07:00", "title": "Nice app"}, {"content": "Good app.", "rating": "5", "version": "6.9.3", "date": "2017-01-27T18:28:00-07:00", "title": "Review"}, {"content": "Paid for tinder plus, worked fine for a couple of days until it logged me out and now I can't log back in with this new update. Not the first time this has happened ether. Constant log in problems they never seem to fix.", "rating": "1", "version": "6.9.3", "date": "2017-01-27T18:22:00-07:00", "title": "Broken"}, {"content": "Great fun to use! Gotten better with the updates. Less spams and Bots.", "rating": "5", "version": "6.9.3", "date": "2017-01-27T16:50:00-07:00", "title": "Great fun app"}, {"content": "Good", "rating": "4", "version": "6.9.3", "date": "2017-01-27T16:25:00-07:00", "title": "Good"}, {"content": "After having a nightmare of a relationship my sister told me to use tinder, I didn't really like the idea of it at first but give it a go anyway.. so after a few pricks and time wasters I came across some boy let's call him Steve.. we hit it off straight away and I could tell he was going to be something special. Staying up till 5am talking about Kenny and all the mad adventures we'll go on when we finally meet. This was 6 months ago, 3 months together and were in the most amazing relationship. Moral of the story, use tinder because it does bits an ye might just meet the love of ye life like me x from the sickest scouser you'll ever meet", "rating": "5", "version": "6.9.3", "date": "2017-01-27T16:16:00-07:00", "title": "Sickest app(tinder does big bits)"}, {"content": "Tinder should have read receipts, please and thank you", "rating": "3", "version": "6.9.2", "date": "2017-01-27T13:50:00-07:00", "title": "omg best idea ever!!!!!!!"}, {"content": "First the bad points: \nStill very glitchy - even at home with a reliable network. Very strangely tinder seems to limit/crash after 10 or likes\n\nAlso why pay for unlimited likes if you can't filter according to your personal preferences \n\nNow for the good points:\n\nMy friends and I are still having an awesome time meeting people for drinks and more 😉\n\nKeep up the good work tinder", "rating": "5", "version": "6.9.2", "date": "2017-01-27T13:48:00-07:00", "title": "Tinder is great"}, {"content": "Catch me outside how about dat", "rating": "5", "version": "6.9.2", "date": "2017-01-27T13:29:00-07:00", "title": "💁"}, {"content": "I downloaded the tinder app. I have been charged three times for signing up to tinder plus once and I have not been able to open the app for about 2 weeks now. It just crashes as soon as I open the app. So... Essentially, just been charged three times for something I can't use once. The word \"criminal\" comes to mind???? Not sure why!? Hahaahaha. DO NOT DOWNLOAD TINDER", "rating": "1", "version": "6.9.2", "date": "2017-01-27T09:11:00-07:00", "title": "DO NOT DOWNLOAD"}, {"content": "Daily prompts to rate the app.", "rating": "1", "version": "6.9.2", "date": "2017-01-27T08:32:00-07:00", "title": "You wanted a rating?"}, {"content": "New update 'fixes bugs and improvements'. No. No it doesn't. I'll try to sign in and it says there is an error and to contact customer services...", "rating": "1", "version": "6.9.2", "date": "2017-01-27T04:23:00-07:00", "title": "Don't work!"}, {"content": "It's ok. Met some nice people!", "rating": "4", "version": "6.9.2", "date": "2017-01-27T04:01:00-07:00", "title": "Yeah"}, {"content": "Yep", "rating": "2", "version": "6.9.2", "date": "2017-01-27T03:36:00-07:00", "title": "H"}, {"content": "Bit pointless that the app actually only ever works with wifi", "rating": "1", "version": "6.9.2", "date": "2017-01-27T03:25:00-07:00", "title": "Constant errors"}, {"content": "Good app;) but slow survey", "rating": "5", "version": "6.9.2", "date": "2017-01-27T01:14:00-07:00", "title": "Not bad"}, {"content": "Hello. One of the best:)", "rating": "4", "version": "6.9.2", "date": "2017-01-26T15:27:00-07:00", "title": "Ko"}, {"content": "Had to delete my profile dozens of times as app freezes and does not show nearby profiles! Absolute shambles.", "rating": "1", "version": "6.9.2", "date": "2017-01-26T13:59:00-07:00", "title": "Awful"}, {"content": "idk the app asked me to review it", "rating": "4", "version": "6.9.2", "date": "2017-01-26T13:39:00-07:00", "title": "good"}, {"content": "Nothing is uploading not happy", "rating": "1", "version": "6.9.2", "date": "2017-01-26T12:19:00-07:00", "title": "Sort it out"}, {"content": "Have you and/or friends noticed a sharp decline in match rate lately? Wonder why? When they are selling \"boosts\" at £4 a shot, it's not in their interests to let free users get as many matches as cash cows is it now? When you used to get a good match rate and now you don't, you might be tempted to spend a little 💰 to restore your pride, right? Good luck with that- they don't have enough users to support multiple\"boosts\" so you will run out half way through a boost, which you have paid for in advance. Be warned... update. They banned my account for reporting their scam. Good riddance to them, but I will get my money back from Apple.", "rating": "1", "version": "6.9.2", "date": "2017-01-26T11:21:00-07:00", "title": "The fix is in"}, {"content": "It never seems to load up, getting annoyed with the \"Error\" messages. It needs sorting out FAST.", "rating": "1", "version": "6.9.2", "date": "2017-01-26T10:35:00-07:00", "title": "Worst app ever"}, {"content": "Bring back moments!!", "rating": "4", "version": "6.9.2", "date": "2017-01-26T10:11:00-07:00", "title": "Good app"}, {"content": "Good app very buggy app does not work too well BUT the idea and concept is good. Although this is an issue it works for me and i love it 👌🏽✍🏽", "rating": "5", "version": "6.9.2", "date": "2017-01-26T09:10:00-07:00", "title": "I dont think i would ever go into a relationship ever again, the single life is too good"}, {"content": "Great if you're in a wifi zone but if you've got anything less it just gives you a server error message and doesn't allow you in. Customer service response doesn't fix it then they just ignore you. Terrible app, even worse customer service. Go for bumble instead.", "rating": "1", "version": "6.9.2", "date": "2017-01-26T08:11:00-07:00", "title": "Bumble is 10 times better"}, {"content": "Good stuff", "rating": "4", "version": "6.9.2", "date": "2017-01-26T07:14:00-07:00", "title": "👉🏾👌🏽"}, {"content": "Does what it says on the tin. Shame about only having a certain amount of likes per 12hrs tho", "rating": "5", "version": "6.9.2", "date": "2017-01-26T06:33:00-07:00", "title": "Not bad"}, {"content": "Great way to meet new people :) \n\nOnly downside. It doesn't stick in the radius set.", "rating": "5", "version": "6.9.2", "date": "2017-01-26T06:22:00-07:00", "title": "Great"}, {"content": "After updated I looked and I have lost all my songs not happy at all", "rating": "1", "version": "6.9.2", "date": "2017-01-26T05:02:00-07:00", "title": "Lost all my songs"}, {"content": "🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻🙌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻👌🏻🙊🙊🙊🙊✊🏻💦😳", "rating": "5", "version": "6.9.2", "date": "2017-01-26T02:45:00-07:00", "title": "🔥"}, {"content": "It's a great App, for all ages. I've meet some nice people on here and enjoying the experience", "rating": "5", "version": "6.9.2", "date": "2017-01-26T02:10:00-07:00", "title": "Stars Above"}, {"content": "Would recommend.", "rating": "4", "version": "6.9.2", "date": "2017-01-25T23:48:00-07:00", "title": "Great app."}, {"content": "Keep asking me to review this app!", "rating": "2", "version": "6.9.2", "date": "2017-01-25T23:12:00-07:00", "title": "Annoying"}, {"content": "Well after been on tinder a few week, the odd occasion I get a match, with a girl, who says am interested in no strings fun, I play along as I no this is a scam, so after a bit of talking she sends me a verification code asked me to use the link provided, witch says tinder verification, and it asked for Unser name, password, and email. Then next it says wait for it ? Wants your bank card details wtf, right, they say you make an account up and that's how you get there mobile number and get to meet them that way I mean hello scam or what, tinder you need to get your self a team who can actually weed out the roots and get rid of there scamming C, you, another, time.", "rating": "3", "version": "6.9.2", "date": "2017-01-25T21:58:00-07:00", "title": "Tinder verification?"}, {"content": "Love it has always been good, but needs a more friendly training on usage and profile managment", "rating": "5", "version": "6.9.2", "date": "2017-01-25T21:57:00-07:00", "title": "Good and reliable but needs swiping command warnings!"}, {"content": "Changes the face of dating", "rating": "5", "version": "6.9.2", "date": "2017-01-25T18:31:00-07:00", "title": "Great"}, {"content": "Review", "rating": "5", "version": "6.9.2", "date": "2017-01-25T16:24:00-07:00", "title": "Title"}, {"content": "Trying to log in and it keeps crashing please fix it I'm trying to remove my old account", "rating": "1", "version": "6.9.2", "date": "2017-01-25T15:45:00-07:00", "title": "Won't work"}, {"content": "Numerous updates claiming to fix bugs yet I stilllll can't open the app. On the rare occasion it does log in.. I can't see anyone or any of my matches. I get notifications for messages and can't access them. Come on Tinder. Sort it out.", "rating": "1", "version": "6.9.2", "date": "2017-01-25T14:55:00-07:00", "title": "No point if it doesn't work?!"}, {"content": "Stop spamming for reviews!", "rating": "1", "version": "6.9.2", "date": "2017-01-25T13:48:00-07:00", "title": "Crap"}, {"content": "Constantly disconnecting from Facebook with \"network error\" and doesn't reconnect! And i have just got a new phone! Still doing the same thing.Cant even get on to delete my account!\n SORT THIS OUT!", "rating": "1", "version": "6.9.2", "date": "2017-01-25T11:02:00-07:00", "title": "DISCONNECTS-FROM-FACEBOOK"}, {"content": "Helped me meet people abroad so it's good", "rating": "5", "version": "6.9.2", "date": "2017-01-25T10:19:00-07:00", "title": "Works"}, {"content": "It never works on my mobile dat a (4g) and only sometimes works on my home wifi, sort it out and it could be a good app", "rating": "1", "version": "6.9.2", "date": "2017-01-25T08:55:00-07:00", "title": "Unreliable"}, {"content": "The app won't let me log in. So I tried connecting with Facebook and it just says \"logging in\" for ages. So I shut down the app, delete it and re download it hoping that works but it didn't 🙄", "rating": "1", "version": "6.9.1", "date": "2017-01-24T23:18:00-07:00", "title": "Faulty."}, {"content": "The app seems now just a money making tool. If i LIKE every single girl still I get no matches at all.\nMy profile is not shown at all and they want you to pay to get more visibility.\nTerrible experience", "rating": "1", "version": "6.9.1", "date": "2017-01-24T22:57:00-07:00", "title": "No matches at all"}, {"content": "Accidentally 'super-liking' people is WAY too easy to accidentally do. Please think about adding an 'are you sure?'/confirmation after you swipe!! I know your community would appreciate it massively.\n\nOverall I've had the app a whole and it's worked well so far.", "rating": "2", "version": "6.9.1", "date": "2017-01-24T18:41:00-07:00", "title": "Super liking needs tweaking"}, {"content": "This app doesn't even open. I've tried deleting and reinstalling it. Several times. I can see I have 20 messages to reply to but I can't get the app to open. Basically this version of tinder no longer works.", "rating": "1", "version": "6.9.1", "date": "2017-01-24T13:39:00-07:00", "title": "Worst app for crashing continuously"}, {"content": "It's been more than 1 year since I had the app and the connectivity issues are still unresolved.", "rating": "2", "version": "6.9.1", "date": "2017-01-24T13:13:00-07:00", "title": "Good idea badly managed"}, {"content": "If you haven't got Facebook you won't be able to use the app! What a load of crap!!!!!", "rating": "1", "version": "6.9.1", "date": "2017-01-24T12:59:00-07:00", "title": "Rubbish!"}, {"content": "Developers haven't fixed a single bug in 3 years. Literally rage inducing. Absolutely pathetic.", "rating": "1", "version": "6.9.1", "date": "2017-01-24T12:16:00-07:00", "title": "Pathetic bugs tbh"}, {"content": "Tinder is overall a great app... when it works. I find appalling that a certified app like Tinder is still experiencing the same issues they have been experiencing since creation. There is not a day when I can just sign in smoothly. The app consistently faces server issues every single time I come off it and try to log in. It's always a matter of closing the app/ re open/ delete the app/ re install. I'm an app developper and whoever is working on this app needs firing. What a disappointment. I will be deleting this app very soon if this problem does not get sorted.", "rating": "1", "version": "6.9.1", "date": "2017-01-24T08:57:00-07:00", "title": "Disappointed"}, {"content": "Fun little boredom buster. Sometimes doesn't load but I assume that's at least partly to do with the fact that my phone is ancient!", "rating": "5", "version": "6.9.1", "date": "2017-01-24T08:57:00-07:00", "title": "Good fun!"}, {"content": "Great app but hardly ever works. Keeps saying \"server error\" can't connect to tinder etc. Uninstalled it, re installed it, restarted my phone. Nothing working 😐", "rating": "1", "version": "6.9.1", "date": "2017-01-24T08:44:00-07:00", "title": "Sort out server error please!"}, {"content": "Useless app no matches in a month must be ugly af then", "rating": "1", "version": "6.9.1", "date": "2017-01-24T02:15:00-07:00", "title": "Useless"}, {"content": "Never works...", "rating": "1", "version": "6.9.1", "date": "2017-01-23T20:47:00-07:00", "title": "App doesn't work"}, {"content": "Possibly the worst dating app so far! I cannot login to the app any longer because it bugs out when I click on the link, the developers need sacking seriously! Don't waste your time downloading this, not something to be recommending.", "rating": "1", "version": "6.9.1", "date": "2017-01-23T15:33:00-07:00", "title": "Useless App"}, {"content": "It was alright until the tinder plus came in. Allow restricting likes", "rating": "2", "version": "6.9.1", "date": "2017-01-23T15:33:00-07:00", "title": "Why?"}, {"content": "Tinder get your Facebook authentication issue together please, FFS, it's been years", "rating": "1", "version": "6.9.1", "date": "2017-01-23T14:56:00-07:00", "title": "Good app but fix your bugs"}, {"content": "Constant server crashes. Haven't been able to get on in 10 days.", "rating": "1", "version": "6.9.1", "date": "2017-01-23T14:19:00-07:00", "title": "Baaaaad"}, {"content": "Great fun", "rating": "5", "version": "6.9.1", "date": "2017-01-23T13:47:00-07:00", "title": "Gotta love it"}, {"content": "I much prefer this app to Grindr! I don't like receiving certain kind of messages from guys (dick and faceless pics) which I constantly get on Grindr. The only downside I find is that some of the time the app doesn't connect to the server at certain times during the day, so if I'm having to connect to a wifi connection of I want to use it.", "rating": "4", "version": "6.9.1", "date": "2017-01-23T12:18:00-07:00", "title": "Love it!"}, {"content": "Problems: \n1. Constantly showing 3 notifications - nothing there. \n2. Problem with subscription - Anna from Tinder support proving incapable of fixing issue / understanding basic English. Template replies used by her every time. Shocking service. \n3. I've now contacted 10+ friends that have appeared on my Tinder deck, only to find they (apparently) deleted their profile months ago? No idea how many fake / closed profiles exist, but beginning to think it's quite high - how much time wasted looking at old accounts? \n4. Bumble is less buggy and seems to have less fake profiles!!", "rating": "1", "version": "6.9.1", "date": "2017-01-23T11:40:00-07:00", "title": "Very buggy update"}, {"content": "App says must be 17+ to download, then once downloaded says you must be 18?", "rating": "2", "version": "6.9.1", "date": "2017-01-23T09:46:00-07:00", "title": "17+ ?????"}, {"content": "Time is money and my time cost like a Bugatti.I have deleted my account 5 times since buying Tinder plus as it's the only way it starts working again.\n\nI've also tried deleting the App a few times.Do the people responsible for the app look at these reviews?\n\nSo on a reddit thread that this has been happening to another guy for 5 weeks and nothing was done.", "rating": "1", "version": "6.9.1", "date": "2017-01-23T05:18:00-07:00", "title": "Since I bought Tinder Plus"}, {"content": "No bad", "rating": "5", "version": "6.9.1", "date": "2017-01-22T23:45:00-07:00", "title": "No bad"}, {"content": "The app is really good when it can maintain a stable connection", "rating": "2", "version": "6.9.1", "date": "2017-01-22T23:40:00-07:00", "title": "Great app but Unstable connection"}, {"content": "Tinder used to be so good man, what happened? I deleted the app then re-installed it to then see if it would work but Whenever I go to press 'log in with Facebook' the app completely shuts down, like c'mon I jus wanna find my future husband on tinder, is that too much to ask??", "rating": "1", "version": "6.9.1", "date": "2017-01-22T18:01:00-07:00", "title": "Pigs shite"}, {"content": "Rip off", "rating": "2", "version": "6.9.1", "date": "2017-01-22T17:57:00-07:00", "title": "Don't waste your time"}]}