{"data": [{"content": "Yeah \nCharging for next level £10 ?", "rating": "1", "version": "1.1.2", "date": "2017-03-06T11:59:00-07:00", "title": "👎"}, {"content": "I don't think the majority of 1 star reviewers are complaining that it's not free, so I don't know what reviews you're reading.\nWhat they ARE saying is that £8 for an app game is wayyy too expensive. It has nothing to do with whether you're working or not. \nMaybe you enjoy throwing your money about frivolously but others are a bit smarter. \nIf this wasn't a Nintendo licensed game and Mario was replaced with some other random character, you wouldn't give this game a chance in hell for the price of £8.", "rating": "2", "version": "1.1.2", "date": "2017-03-06T06:49:00-07:00", "title": "@ A Fellow Sky Dancer"}, {"content": "You'd think Nintendo made enough money already from Pokemon alone! But 10 pound to open up the levels. It's misleading, it gets you involved and then you find out you have to pay for the other levels. And it crashes loosing you toads! I'm tempted to pay the ten pound as it's a good game. But what I don't want is the next update to cost another ten pound. It's con because you know Nintendo has always tapped into the gambling addictive side of gaming and this just shows they do not value there fans and customers. You can argue they need to make money, but why can't they do what other apps do and have in game purchases for upgrades and tickets.", "rating": "3", "version": "1.1.2", "date": "2017-03-06T06:49:00-07:00", "title": "To expensive"}, {"content": "This game is very weak.  They should try harder in future to make a game that is not weak.  Weak games are not very good.", "rating": "1", "version": "1.1.2", "date": "2017-03-06T03:13:00-07:00", "title": "Lame"}, {"content": "Why oh why does the world now think that downloading a game every time you play it is the answer to storage!! It's NOT!! This kills your data allowance and stops you being able to play the game when traveling like, on a plane or when you stay away from any internet connection! You should have the choice to store this game on your phone to play offline!! Make this happen! I paid for a game I cannot now play!", "rating": "3", "version": "1.1.2", "date": "2017-03-06T00:52:00-07:00", "title": "Make the game playable offline!!"}, {"content": "Enjoyed playing this game thoroughly", "rating": "5", "version": "1.1.2", "date": "2017-03-06T00:23:00-07:00", "title": "Great game!"}, {"content": "I was waiting for this game for a Long time and when it finally came out I wanted to pay £8 the next week or so they changed its £10 in my opine you should buy it but if you have a spare £10 recommend you should buy it but why does it say its free then they force to pay at the start of the game if you don't have money don't buy you could better buy one of does Pokémon games for DS or a mario game for DS a Xbox game.", "rating": "1", "version": "1.1.2", "date": "2017-03-05T23:55:00-07:00", "title": "Money waster"}, {"content": "Everyone crying about £10 try this.... stop being poor... problem solved! ;)", "rating": "5", "version": "1.1.2", "date": "2017-03-05T15:11:00-07:00", "title": "Awesomeness! Love it!"}, {"content": "£10 for a few levels on a game is not acceptable. Deleted as soon as I realised that the game would provide entertainment for approximately 72 hours.  Once you've completed 3 days worth of game play it's pointless.", "rating": "1", "version": "1.1.2", "date": "2017-03-05T13:55:00-07:00", "title": "Ultimately disappointing."}, {"content": "If the game was free it would get 5 stars. Polished game, good mechanics, fantastic single player.\n\nUltimately £7.99 is a very high price tag for a mobile game. So as a result we should expect a very good game, far better than most others. More importantly a game that we can enjoy playing for a long time with a lot of content. \n\nI played for about a week, which I enjoyed (especially the single player), however the multiplayer doesn't have enough about it to keep you engaged.", "rating": "2", "version": "1.1.2", "date": "2017-03-05T12:59:00-07:00", "title": "Disappointing for £7.99"}, {"content": "Easily put:\n\nToo few levels\nLittle to do once complete \nLevels too short\nPrice expensive\nMore like a demo and rehash of old games\nRally grows tiresome\nSimply just redoing levels until you go mad!", "rating": "2", "version": "1.1.2", "date": "2017-03-05T08:57:00-07:00", "title": "Too limiting"}, {"content": "After 15 mins of playing (first 3 levels) you get hit with a £9.99 fee in order to unlock the full game. Disappointing - Deleting App!", "rating": "1", "version": "1.1.2", "date": "2017-03-05T04:10:00-07:00", "title": "Another Nintendo flop!"}, {"content": "A good, enjoyable game that can be played again and again. Great for when you only have a few minutes to spare. Unfortunately, the latest version has introduced some crashes that unfortunately cause the game to think you've exited the app intentionally and counts it against you. Poor show.", "rating": "4", "version": "1.1.2", "date": "2017-03-05T01:22:00-07:00", "title": "Enjoyable but latest version crashes"}, {"content": "Make freeee", "rating": "1", "version": "1.1.2", "date": "2017-03-04T11:01:00-07:00", "title": "Make it free !!!!! £8.99 for the full game you only get 4 levels"}, {"content": "Really fun game with well thought out controls and level designs, sometimes crashes on bonus games and does require constant internet connection which is a shame. The price is fair, but they could have avoided the negative reviews by simply stating it on the download screen. Overall well worth getting", "rating": "4", "version": "1.1.2", "date": "2017-03-04T03:00:00-07:00", "title": "Very good only a few glitches"}, {"content": "I've been trying to play this since release but the game just crashes on launch on my iPhone 6 Plus.", "rating": "1", "version": "1.1.2", "date": "2017-03-04T00:02:00-07:00", "title": "Doesn't work"}, {"content": "7.99 for the entire game. I say NO", "rating": "1", "version": "1.1.2", "date": "2017-03-03T15:53:00-07:00", "title": "Really"}, {"content": "The game is nice apart of paying £10 for it.", "rating": "1", "version": "1.1.2", "date": "2017-03-03T10:01:00-07:00", "title": "Pay for a game?"}, {"content": "£10 is not expensive!! For a mario game as fun as it is!", "rating": "5", "version": "1.1.2", "date": "2017-03-03T09:47:00-07:00", "title": "£10 is ok"}, {"content": "Maybe I'm missing something here, considering how everything I hear about this game is positive, but I don't see the appeal. \n\nThis game is brilliant at inventing barriers between the player and the game. First forcing you to sit through it downloading \"data\" for ages, then unskippable cutscenes and tutorials showing what all the buttons in the menu do, before you even get to the game. \n\nWhen you do finally get into the game... meh. It's pretty much a standard infinite running game with Mario in it. \n\nThe graphics are pretty bad, like an iPhone game from about 5 years ago. \n\nThe menus are hideous, and look like a website I wouldn't give my credit card to. \n\nI haven't paid to unlock the full game, and don't see why I ever would.", "rating": "2", "version": "1.1.2", "date": "2017-03-03T04:21:00-07:00", "title": "Mediocre"}, {"content": "I enjoyed it but ..\nI HATE HOW YOU HAVE TO PAY FOR EVERYTHING AFTER WORLD 1! IT'S NOT FAIR!! COME ON NINTENDO!!", "rating": "1", "version": "1.1.2", "date": "2017-03-02T09:32:00-07:00", "title": "Good game but.."}, {"content": "They need to update it, it is not like same. The mario goes only front no control. Although I like this game but due to this I don't like to play this.", "rating": "1", "version": "1.1.2", "date": "2017-03-02T06:29:00-07:00", "title": "Game review"}, {"content": "Quite expensive", "rating": "2", "version": "1.1.2", "date": "2017-03-02T05:50:00-07:00", "title": "Shame, shame."}, {"content": "Hola el juego no va bien lo he probado en dos iphone distintos y nada no arrancan como deveria arrancar", "rating": "1", "version": "1.1.2", "date": "2017-03-01T08:04:00-07:00", "title": "Super mario run"}, {"content": "was working yesterday and now keeps saying some b.s about u changed ur policy and loads up nintendo acconts and it says could not be opened.....fix plz you make me spend 10pound on this crap", "rating": "1", "version": "1.1.2", "date": "2017-03-01T05:14:00-07:00", "title": "not working"}, {"content": "No thanks, I will never buy", "rating": "1", "version": "1.1.2", "date": "2017-03-01T03:12:00-07:00", "title": "Gone from £7.99 to £9.99"}, {"content": "I really enjoyed this game until recently where when I try to play it on my iPhone 5s it glitches and doesn't work! This is not what I expect when I pay £7.99 for an app! Please fix this bug.", "rating": "2", "version": "1.1.2", "date": "2017-03-01T02:27:00-07:00", "title": "Not working on iPhone 5s"}, {"content": "£9.99 shame on you", "rating": "1", "version": "1.1.2", "date": "2017-03-01T00:37:00-07:00", "title": "Toooo expensive"}, {"content": "Firstly why do most people complain that this game is not free, like I know what you are thinking woo super mario run is free, *plays the three free levels* message comes up please pay £8 to continue playing the tour section - the TOUR SECTION why not play toad rally that's free for everyone but no you have to go ahead and put Nintendo and the game down with a 1 star because you failed school and can't afford a full version of an £8 game as you can't find a job. Enough being said,(had to do that to get all the 1 star reviews I've read out of me) think about it, when was the last time you saw most games on a specific device be free - most games on consoles like the PS4 XBOX One Wii U and most games on PC are paid. So for the last time why is this game and Nintendo getting so much hate for it? Is it because you expect this game to be free just because it's mobile or what?", "rating": "5", "version": "1.1.2", "date": "2017-02-28T11:35:00-07:00", "title": "This game is great and question to all 1 star reviews"}, {"content": "£10 for a couple levels!!! Funny really😒", "rating": "1", "version": "1.1.2", "date": "2017-02-28T10:56:00-07:00", "title": "Bad"}, {"content": "I'm baby hay day I love this game but can you make an app for iPad and call it super MARIO 3D land make it like the Nintendo one but after each course can you make your own character and couse", "rating": "5", "version": "1.1.2", "date": "2017-02-28T08:43:00-07:00", "title": "Yyuyyyc eee"}, {"content": "It took me a little while to get used to the game and the touch controls but quickly I grew to like it. It is different to the old original mechanics but hey - just like Rayman Jungle Run - very nicely translates to touch devices!\n\nThe game is great, THANK GOD FOR NOT PUSHING SOCIAL CONNECTIONS!.\n\nThe only thing I really find annoying (it's not the price come on guys think how much joy that £10 buys you!) and holding me back from buying is the lack of offline mode. Most of the time you just want to play on the tube and I don't see why offline first wasn't part of the plan when they built this great game.\n\n3 stars for now, offline mode added will bring the rest.", "rating": "3", "version": "1.1.2", "date": "2017-02-28T02:59:00-07:00", "title": "Great port to touch screen but screams for offline mode"}, {"content": "Played the free part of this game an eventually downloaded it for £7.99. It's ok as a game but not worth the now £9.99 price tag never mind what I paid. Character runs on its own and never as good as the original. The worlds are short and easy to get through and only part I really play is the rally. PLUS. The fact you need the internet to actually play this game is bonkers.", "rating": "1", "version": "1.1.2", "date": "2017-02-28T02:10:00-07:00", "title": "Not worth the price tag"}, {"content": "Please, this is the most expensive app I've seen. Lower the damn price! Other apps are like 2.99 Or at most 5.99 But 9.99 is way too much!", "rating": "1", "version": "1.1.2", "date": "2017-02-28T00:08:00-07:00", "title": "Nintendo Seriously!"}, {"content": "I have had this game twice on 2 different devices and it just loads the screen and goes off, no matter what i do it wont work!!!! Id give -5 stars but they dont have that option :(", "rating": "1", "version": "1.1.2", "date": "2017-02-27T09:54:00-07:00", "title": "Horrible awful game"}, {"content": "The game is good but I think\nIt would've been better to make the app cost money instead of downloading it for free but then require to buy the rest of it. Hopefully Nintendo will take this into consideration.", "rating": "4", "version": "1.1.2", "date": "2017-02-27T04:59:00-07:00", "title": "Better if it wasn't free"}, {"content": "Guys Stop Talking About Purchasing £8 On A Game Nobody Understands How Expensive It Costs To Keep This App Running And Everyone Should Be Thankful Its Still Free To Download", "rating": "5", "version": "1.1.2", "date": "2017-02-27T02:21:00-07:00", "title": "Please Read This"}, {"content": "Played one level then informed it'll cost me £9.99 to play another 4 levels. No thank you. Deleted as quickly as it was downloaded.", "rating": "1", "version": "1.1.2", "date": "2017-02-27T01:52:00-07:00", "title": "Not free at all"}, {"content": "£7.99 was an utter rip off for the amount of easily completed levels.", "rating": "1", "version": "1.1.2", "date": "2017-02-27T00:44:00-07:00", "title": "Rip off"}, {"content": "Costs way to much 69p game at best.", "rating": "1", "version": "1.1.2", "date": "2017-02-26T13:49:00-07:00", "title": "Way overpriced"}, {"content": "The fact that you have to pay £10 to get the game and it's in the free section is worse enough. The price has gone up!", "rating": "1", "version": "1.1.2", "date": "2017-02-26T12:37:00-07:00", "title": "Disgrace to the name Mario"}, {"content": "This is a solid little platformer. Easy to learn and filled with Nintendo charm, it's a great distraction for work commutes. Ignore the incessant whining from people who don't want to pay for their games. It's worth the money, even if it is a little short.", "rating": "5", "version": "1.1.2", "date": "2017-02-26T12:08:00-07:00", "title": "Unnecessary hate for good game"}, {"content": "Bought this after seeing a bit of a YouTube play it and played I thought it was brilliant until I came to the level 1-4 you HAVE TO PAY £8 THAT IS SO CHEAP NINTENDO AND THAT IS RIDICULOUS DO NOT BUY IT YOU CAN'T PLAY THE GAME UNLESS YOU SPEND £8\n\nIf I could I would give it no stars just horrible", "rating": "1", "version": "1.1.2", "date": "2017-02-26T09:18:00-07:00", "title": "Don't waste your time"}, {"content": "This shouldn't be on the free section, get rid of the paywall!", "rating": "1", "version": "1.1.2", "date": "2017-02-26T08:39:00-07:00", "title": "Misleading"}, {"content": "This is the worst MARIO game ever!!!!!!!!only can play 3 levels stupid £10 for the rest of the app uninstalling until all is free", "rating": "1", "version": "1.1.2", "date": "2017-02-26T07:49:00-07:00", "title": "What a joke"}, {"content": "Nice twist on the classic Super Mario side scrolling platform game. \n\nYes it's £7.99 but it's addictive if you're like me and want to get through each level perfectly.\n\nAlthough not many levels, once you've collected all 5 purple coins from a level there's a further two challenges for that same level, just harder coin placements.\n\nToad Rally and the kingdom builder look good too but not had chance to explore those elements yet!\n\nNice magical game from Nintendo.", "rating": "5", "version": "1.1.2", "date": "2017-02-26T06:47:00-07:00", "title": "Great!"}, {"content": "I cannot believe that you as developers have taken it upon yourself to make such a great game with a great modern twist to an iconic game and then completely ruined everything by taking the mick out of the very people you design the game for. You develop a game for the people to play and then decide to charge them to continue playing which is fine, no one can or should work for free right?!? Charging £7.99 was a complete kick in the nether region for all customers as I'm sure you can guess from all the 1 star negative feed back you can clearly see in majourity of the comments left on the App Store. I ignored this as I understand everyone has to survive. However now you've raised this cost to £9.99 despite the backlash you so obviously received for the extortionate charge in the first place. What is wrong with you people?!? When did your greed get so overwhelming that you no longer see the reason you got into this career on the first place??? Great game but what's the point.. GREED!", "rating": "2", "version": "1.1.2", "date": "2017-02-26T05:57:00-07:00", "title": "Great game but ultimately disappointing!!"}, {"content": "Nintendo created one of the best games ever, MARIO 64, and lots more, this game is simple, boring, easy, you end up paying thinking it'd get better, all you do to play is tap and tap your screen, regret paying for it.", "rating": "1", "version": "1.1.2", "date": "2017-02-26T05:25:00-07:00", "title": "Don't waste your money, total let down"}, {"content": "I wasn't impressed when I first saw Super Mario Run.\n\nIt looked like the existing line of New Super Mario Bros. games with a play style similar to Ubisoft's Rayman Jungle Run.\n\nHaving now played the game, while my first impressions were not wrong, I admit they were certainly unfair.\n\nOnce you've got the hang of it the gameplay is easy to just pick up and go. The World Tour mode features 24 levels but each level has three different set of collectibles to encourage replayability and increase difficulty.\n\nThe full unlock is £9.99. I was unsure when I heard that before release but having paid it and played it this game is absolutely worth the £9.99 IAP.\n\nYou can try the first three levels free of charge.\n\nMiitomo was a well-made app but this truly is Nintendo's first mobile game and proudly sits alongside Niantic's Pokémon GO on my iOS GOTY list. Download and run today!", "rating": "5", "version": "1.1.2", "date": "2017-02-26T05:17:00-07:00", "title": "Mario's mobile debut"}, {"content": "Wow, never in a million years did I ever imagine to give a review for a game 1 star, can I give 0 stars, I played this game for a little while when it came out(only the first 3 levels what you can play of course)and was put off by the £8 charge, I kept debating weather to purchase it or not, but kept putting it off, I have finally plucked up the courage to think \"oh what the heck, let's buy it\" only to learn its now £10(WTF £10) I could probably buy 4 or 5 other decent  games at a reasonable cost on the App Store for that, sorry but won't be purchasing this at that price, the price needs to come down to a more reasonable £3-4 and then I might otherwise sorry get lost", "rating": "1", "version": "1.1.2", "date": "2017-02-26T03:20:00-07:00", "title": "£10 for a game is Disgusting"}, {"content": "This game was one of those games were EVERYONE was very excited to play. New Nintendo game on iOS? Dream come true! But £7.99 for more levels? Nah, I'll just play Toad Rally. After Christmas? £10. What on earth is wrong? Toad Rally is boring, and I am DEFINITELY not paying stupid money for a game that should be free all round. \n\nNintendo is one of the best game makers out there, there's definitely no denying that. But really? I think I might just stick to the WII, thank you very much.", "rating": "1", "version": "1.1.2", "date": "2017-02-26T02:10:00-07:00", "title": "Ruined."}, {"content": "Having paid for this I would expect it to work. \nIt only runs on wifi and refuses to run on 3G /4G\nPile of crap.", "rating": "1", "version": "1.1.2", "date": "2017-02-26T00:43:00-07:00", "title": "Not working"}, {"content": "Amazing game but totally kills my iPad and iPhone battery. I need to explain this to my son now. Nintendo fix please. Kind regards", "rating": "2", "version": "1.1.2", "date": "2017-02-26T00:25:00-07:00", "title": "Battery killer?"}, {"content": "£9.99 is too much to pay for a mobile game, it should not be in the free section. It's not surprising that most of the reviews are negative.", "rating": "1", "version": "1.1.2", "date": "2017-02-26T00:06:00-07:00", "title": "I don't know how they can justify selling it for £9.99"}, {"content": "Don't normally write reviews but felt this needed one. WAS a great game. I have completed all levels to the highest coins (silver) I have all the special buildings you can buy, and I have the maximum number of toads you can have (9999) and maximum number of Toad rally tickets. I am left thinking now what... There is no targets for me to reach so getting very bored. It needs to be updated with new world's. For the price they are charging people they can definitely afford some top software developers.", "rating": "2", "version": "1.1.2", "date": "2017-02-25T22:29:00-07:00", "title": "Now what??"}, {"content": "People need to appreciate how expensive it is to develop and maintain games and apps on the App Store. If you're going to play a game all the time then £9.99 is nothing in comparison to the amount of cash that has been pumped into the development of it. Stop being greedy and taking digital content for granted.", "rating": "5", "version": "1.1.2", "date": "2017-02-25T19:38:00-07:00", "title": "Good game, hopefully freemium will stop being the norm"}, {"content": "Waited for this for years, I saw it was on the free list, download complete, open app, THIS IS LITERALLY AN IN-APP-PURCHASE SIMULATOR", "rating": "1", "version": "1.1.2", "date": "2017-02-25T13:40:00-07:00", "title": "Too much hype"}, {"content": "I was so hyped for this game and thought it was going to be really good since Pokemon go did so well. But I was wrong. You can't do anything in this game if you don't pay. They might as well have made it a paid game. You even have to pay for the boss levels", "rating": "1", "version": "1.1.2", "date": "2017-02-25T10:16:00-07:00", "title": "Absolutely AWFUL"}, {"content": "You have to pay for the level/maps", "rating": "2", "version": "1.1.2", "date": "2017-02-25T09:52:00-07:00", "title": "Boring"}, {"content": "U play the first 3 levels and pay £10 to play the rest. I'm uninstalling this game until it's 100% to play.", "rating": "1", "version": "1.1.2", "date": "2017-02-25T08:20:00-07:00", "title": "Why!?"}, {"content": "Worst MARIO I've ever played , very poor example for touch screen. Mario original was 1000% better and that's like 30 years ago . Maybe I'll wait another 30 years and they may have a half decent touch screen title , would give it no stars if I could 😢😢😢😢😢😢", "rating": "1", "version": "1.1.2", "date": "2017-02-25T06:29:00-07:00", "title": "Really!!!!!!!!!!!"}, {"content": "Way over priced! Yes the quality of this game is good but to pay that amount for a couple more levels??!! Come on Nintendo, you can do better... smh 😒😓", "rating": "1", "version": "1.1.2", "date": "2017-02-25T05:49:00-07:00", "title": "TOO EXPENSIVE!!!"}, {"content": "The 3 and 20 second levels are good and the rallies are very enjoyable (that is until you run out of tickets and find yourself having to delete and reinstall the app over and over again for more rally tickets).\n\nI think £9.99 is far too expensive for an online only mobile app. I was stewing over the £7.99 price tag for weeks. Then when I finally decided to go for it, it had gone up to £9.99. Obscene and never in a million years came to mind. I'll wait for a special offer, an ad version or until Nintendo comes to its senses and lowers the price a bit.", "rating": "1", "version": "1.1.2", "date": "2017-02-25T02:45:00-07:00", "title": "Too expensive"}, {"content": "When the game said it was coming out on the App Store, I was SUPER excited 😊. Then I played through the first 3 levels.\n\nThen it got bad... I HAD TO PAY £10!!!!!! THAT US ABSOLUTELY RIDICULOUS!!!! IT IS EVEN IN THE GODDAMN FREE SECTION!!!!!!!!!!!!!! I am very angry 😡. Just like Miimoto. Very very disappointed... 😔", "rating": "1", "version": "1.1.2", "date": "2017-02-24T12:41:00-07:00", "title": "WHAT IS THIS MADNESS?!?!?!?!"}, {"content": "Now this game has some ups and downs but overall it's a good idea with the way you transfer a beloved gaming icon onto a phone so he can be used on the go it's a good app but it needs a offline mode but the main problem is that you charge us to play the rest of the game WHY!? Nintendo your not known for this don't do what EA do and be a total ripoff but I'm going to still play toad rally challenges because they are strangely addictive just come out with a few updates to fix this please?", "rating": "3", "version": "1.1.2", "date": "2017-02-24T08:22:00-07:00", "title": "A good start"}, {"content": "Good game but needs an offline mode. My game even tells me there isn't a strong enough connection to play in some 3G areas. For the price of the game it should be playable offline.", "rating": "2", "version": "1.1.2", "date": "2017-02-24T01:17:00-07:00", "title": "Offline please?"}, {"content": "When on 9999 toads continued victory reduces individual toad colors to maintain the 9999 total. There must be a better solution?", "rating": "3", "version": "1.1.2", "date": "2017-02-24T00:06:00-07:00", "title": "Update required"}, {"content": "Played for 5 mins got bored, app deleted.", "rating": "1", "version": "1.1.2", "date": "2017-02-23T19:07:00-07:00", "title": "Bad game"}, {"content": "Yes this app is £9.99 but for me it has been so worth it, it's given me months of fun every single day.\n\nI especially love racing against other players, even once you have completed the worlds/level - the races are still so addictive.\n\nIn my opinion the trial levels don't show the best of this game, I'm so glad I bought it!", "rating": "5", "version": "1.1.2", "date": "2017-02-23T16:15:00-07:00", "title": "Addictive!"}, {"content": "At first I thought it was cool.. until I found out you have to pay £10!!! It should NOT be on the free section... CRAPPY!!!!!!!!!!", "rating": "1", "version": "1.1.2", "date": "2017-02-23T12:03:00-07:00", "title": "Crap \"free\" game!"}, {"content": "Basically a demo if you don't pay", "rating": "1", "version": "1.1.2", "date": "2017-02-23T11:04:00-07:00", "title": "Not a free game!!"}, {"content": "Honestly I've played more 40 hours on Super MARIO Run and the game is awesome I paid the £7.99 unlocked and completed all levels and got every single character you can run as but… the game needs an offline mode because not everyone has access to Wi-Fi or Data everywhere although I have to say it is an addictive and awesome game that has endless hour of fun and a competitive edge to it to keep you in the loop.", "rating": "4", "version": "1.1.2", "date": "2017-02-23T09:41:00-07:00", "title": "Can't stop, Won't stop!"}, {"content": "Was worth the amount I paid for it before apple increased App Store prices. Because of that it is no longer worth it.", "rating": "5", "version": "1.1.2", "date": "2017-02-23T09:12:00-07:00", "title": "Fun game"}, {"content": "quickly completable - add more levels", "rating": "1", "version": "1.1.2", "date": "2017-02-23T05:26:00-07:00", "title": "boring"}, {"content": "A great MARIO game with tons of depth. Don't just think cus you get to the end of a level you've done it. The real trick is collecting the pink, purple and black coins plus rainbow bridges to new islands. Loved it!", "rating": "5", "version": "1.1.2", "date": "2017-02-22T15:36:00-07:00", "title": "Excellent"}, {"content": "Why not a properMARIO GAME", "rating": "1", "version": "1.1.2", "date": "2017-02-22T15:33:00-07:00", "title": "Terable"}, {"content": "People complaining about £8, it's now increased to £9.99.\n\nNo thanks.", "rating": "1", "version": "1.1.2", "date": "2017-02-22T15:17:00-07:00", "title": "£8? More like £10"}, {"content": "I will keep giving this game 1 Star reviews until it has offline playability.\nWhy dose this game have to be online to play?!!!!!\nHaving to have an Internet connection just to play takes the fun out of the game.\nSonic Dash has offline playability, that is proof that Sega do what Nintendont lol!!!!!!", "rating": "1", "version": "1.1.2", "date": "2017-02-22T14:19:00-07:00", "title": "Why online to play?!!!!!!"}, {"content": "Gameplay is great plays well. It is a great game just has some big let downs unfortunately. I think if it had offline capabilities and reduced the £8 wall to £4 this would reach the top of the charts again.", "rating": "4", "version": "1.1.2", "date": "2017-02-22T13:10:00-07:00", "title": "Love it but..."}, {"content": "Getting bored now.... more levels when!????", "rating": "4", "version": "1.1.2", "date": "2017-02-22T12:59:00-07:00", "title": "Levels"}, {"content": "I agree with a lot of other negative reviews, the game is ok but to charge £7.99 to access the full game is a bit much. Then to update the app and charge £9.99 for the full game is just daylight robbery. £2 or £3 maybe, but not a tenner! Boo, shame on you Nintendo 😔", "rating": "1", "version": "1.1.2", "date": "2017-02-22T11:12:00-07:00", "title": "Con"}, {"content": "Amazing game. True to the MARIO franchise. \n\n7316-8604-8339\n\nAccepting friend requests.", "rating": "5", "version": "1.1.2", "date": "2017-02-22T11:05:00-07:00", "title": "Amazing platform romp."}, {"content": "This game is best but £9.99 is too much and this should be free not happy grrrr", "rating": "1", "version": "1.1.2", "date": "2017-02-22T08:11:00-07:00", "title": "Vile"}, {"content": "It should not be in the free section", "rating": "1", "version": "1.1.2", "date": "2017-02-22T05:51:00-07:00", "title": "Nice \"free\" game"}, {"content": "Before Christmas it was £7.99 and says Family Sharing on the app store page.  My daughter bought it, and now my son wants to play it.. but it says he's got to purchase it...  \nwhat happened to family sharing??\n\nAnd the price has now gone up to £9.99.....  Wonder if they'll blame Brexit...", "rating": "1", "version": "1.1.2", "date": "2017-02-22T02:34:00-07:00", "title": "Falsely says \"family sharing: yes\" and £2 price increase"}, {"content": "Unfortunately with no offline available it renders this game useless for me. This is something i would only ever play while travelling on the tube or on a plane and would have no access to internet.\n\nFor the cost there really is no excuse to force you online. Fix this Nintendo!", "rating": "1", "version": "1.1.2", "date": "2017-02-21T22:36:00-07:00", "title": "No offline mode"}, {"content": "The game is a very cool and fun game but there has not been an update for a very long time and I hope the game with update soon.", "rating": "4", "version": "1.1.2", "date": "2017-02-21T14:54:00-07:00", "title": "MARIO Run update"}, {"content": "Don't work on my iPhone a install the newest version of app and iOS and nothing 1* :/", "rating": "1", "version": "1.1.2", "date": "2017-02-21T14:25:00-07:00", "title": "Crash!"}, {"content": "Ignore the naysayers, this is a terrific game. Enjoy.", "rating": "5", "version": "1.1.2", "date": "2017-02-21T11:39:00-07:00", "title": "My favourite iPhone game ever"}, {"content": "Why do you have to pay to continue", "rating": "2", "version": "1.1.2", "date": "2017-02-21T11:32:00-07:00", "title": "Why PAY?"}, {"content": "Apple @ Nintendo at their best you can't put it down that's as big a compliment  as I can give it. Woohoo!!! \n\nUpdate. I still keep coming back to this for just one more go. Lol.", "rating": "5", "version": "1.1.2", "date": "2017-02-21T09:41:00-07:00", "title": "1st review and 1st class game"}, {"content": "The biggest fault with this game is the price. I was waiting for it to go down before buying it and to see that it has actually gone up in price is a joke! I will not buy this game!", "rating": "1", "version": "1.1.2", "date": "2017-02-21T08:58:00-07:00", "title": "Way too expensive"}, {"content": "You can play the first three tour levels for free but for you to be able to play the rest you have to pay £9.99? Not really a free game is it. You can never get any tickets for the rally so I wouldn't even bother downloading.", "rating": "1", "version": "1.1.2", "date": "2017-02-21T02:39:00-07:00", "title": "Ridiculous"}, {"content": "Despite being a game that I've paid for and downloads fully it needs a constant internet connection for no apparent reason! \n\nUseless for commuters", "rating": "1", "version": "1.1.2", "date": "2017-02-21T01:31:00-07:00", "title": "Internet connection"}, {"content": "Great game until u complete 3 levels then u have to purchase the other levels at £9.99!! Shame really as now deleting it!!!", "rating": "1", "version": "1.1.2", "date": "2017-02-21T01:19:00-07:00", "title": "Scam"}, {"content": "The game is ok, but annoying due to average replay value(collect more coin in different locations, yay!?) free to play...the first level then it's £8to unlock the game!?\n\nOh and you need to always be online for some reason? it seems to constantly download data every time you launch the game, filling my phone up. Total let down really.\n\nMaybe worth a single play through if it was £4, maybe.", "rating": "2", "version": "1.1.2", "date": "2017-02-20T23:47:00-07:00", "title": "Average , annoying business choices"}, {"content": "Extremely disappointed in this game. Waste of £10 - don't even bother downloading. Would rate 0 stars if I could. 👎🏻👎🏻👎🏻", "rating": "1", "version": "1.1.1", "date": "2017-02-20T16:46:00-07:00", "title": "Ridiculously overpriced"}, {"content": "I just brought Batman Arkham Knight sealed on my PS4 for £10.\nMARIO run want £9.99 for extra worlds!\nI am now lost for words \nThat should sum up MARIO run\n\"Lost\"", "rating": "1", "version": "1.1.1", "date": "2017-02-20T12:22:00-07:00", "title": "Way Too EXPENSIVE!"}, {"content": "Nice little game.\nYou've got to be persistent to get the prizes....\nMy only gripe, it's not saving the correct amount of green toads I win in rally mode...\nJust won 11 so my total should gone from 1607 to 1618 but it only shows 1612....\nNo wonder I can't get to the target of 2500 to buy the last item in the shop.... you're game isn't adding my scores right...\nFix needed and quick please!!!", "rating": "3", "version": "1.1.1", "date": "2017-02-20T06:14:00-07:00", "title": "Good game.....but"}, {"content": "This app was a total and complete waste of my money. I would NEVER have payed £7.99 if I knew you could complete the whole game in just over an hour? Ridiculous. Would NOT recommend to anyone.", "rating": "1", "version": "1.1.1", "date": "2017-02-20T03:39:00-07:00", "title": "Waste of money!"}, {"content": "Before I focus on the negatives, I would like to take the time to appreciate the enjoyment I got out of this game for the first week of it being out.\nIt just has a few, fundamental flaws.\n1 - The price of the game was extortionate for the amount of game time you actually get.\n2 - The constant internet connection faults are irritating, paired with a required internet connection even for single player limiting game time\n3 - I feel the biggest flaw of this game is the multiplayer, rally's are moderately enjoyable, but the friendly run feature is disappointing, as many (including me) expected friendly runs to be in real time, rather than racing a CPU with the name of one of your friends on. Implementing this feature is - in my opinion - a must.\n\nOverall I enjoy the game, and understandably it's early days. But there are many improvements I would like to see.", "rating": "1", "version": "1.1.1", "date": "2017-02-19T14:07:00-07:00", "title": "Average"}, {"content": "Thought better of Nintendo.", "rating": "1", "version": "1.1.1", "date": "2017-02-19T04:37:00-07:00", "title": "Terrible"}, {"content": "This games starts off good. I do like the rally mode. I didn't purchase the whopping £10.00 price tag as that's just ridiculous. As if £7.00 isn't enough. If you need money so bad, reduce the price tag so more people would buy it. The tour mode is useless as I've finished all 3 free levels and collected all coins in a DAY. I could smash the rest of the levels if I bought the game. So I'm forced to play the rally mode. This game needs to be built on or forget it.", "rating": "2", "version": "1.1.1", "date": "2017-02-19T02:05:00-07:00", "title": "Super Mario Run"}, {"content": "Getting a 1 star review for as long as they have a ridiculous enforcement of maintaining an internet connection just to play this", "rating": "1", "version": "1.1.1", "date": "2017-02-18T17:01:00-07:00", "title": "Still no offline play"}, {"content": "Well this game is so good until you realise you must pay £9.99! First it was £7.99 now this! It's not good! No one would like to buy this game! 👎👎👎👎👎👎", "rating": "1", "version": "1.1.1", "date": "2017-02-18T03:32:00-07:00", "title": "To bad"}, {"content": "Can't believe how badly this was done.", "rating": "1", "version": "1.1.1", "date": "2017-02-18T02:25:00-07:00", "title": "Shocking"}, {"content": "New levels needed to keep me interested, do you think playing the same levels over for a pointless statue will cut It Nintendo?", "rating": "1", "version": "1.1.1", "date": "2017-02-18T01:47:00-07:00", "title": "Completed"}, {"content": "I don't know why people on here complaining about the £7.99 etc. So what it's £7.99, this game takes me back to my childhood. It's a fantastic game for my phone. I have completed the road rally and the actual game twice and each time I play it's fantastic. Worth every penny.", "rating": "5", "version": "1.1.1", "date": "2017-02-17T09:52:00-07:00", "title": "Fantastic game"}, {"content": "Don't get", "rating": "1", "version": "1.1.1", "date": "2017-02-16T17:12:00-07:00", "title": "Bad"}, {"content": "Gameplay and idea is great, but to charge £7.99 and now £9.99 for the full game is sheer daylight robbery! If you have a modern Nintendo console, a cheaper alternative is to go onto the Virtual Console and get Super Mario Bros 3 for £3.49. It's a bigger and more enjoyable game, and it's less than half the price of this! If this game was the same price, I'd begrudgingly pay it. Simply cannot justify paying a tenner for a game you can potentially run through in about an hour to never play again.", "rating": "1", "version": "1.1.1", "date": "2017-02-16T14:49:00-07:00", "title": "How can this qualify as a Mario game?!"}, {"content": "When you play the Toad Rally in this game, they take away a lot of your toads when you either lose the game or quit the game. It's stupid. Raging.", "rating": "1", "version": "1.1.1", "date": "2017-02-16T14:24:00-07:00", "title": "Make this game fair"}, {"content": "Pros:\n\n+Replay value\n+Presentation & music\n+Toad Rally\n+Only 1 real purchase\n+Simple yet satisfying controls\n+Rewarding feel\n\nCons:\n\n-Compulsory Internet needed\n-Lack of original course elements\n-High price for sole purchase when compared to other mobile games\n\nScore: 8/10. Great game. You have to get it. It's an essential for iPads.", "rating": "5", "version": "1.1.1", "date": "2017-02-16T14:01:00-07:00", "title": "Super Mario Run Is AWESOME!!!"}, {"content": "Mario run was fun but you have to pay so much money.You get the first three rounds free and the rest needs to be payed. I wouldn't recommend it to anyone. Sorry people it's rubbish. 👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼👎🏼😿😿", "rating": "1", "version": "1.1.1", "date": "2017-02-16T00:46:00-07:00", "title": "TERRIBLE 👎🏼👎🏼👎🏼👎🏼"}, {"content": "The game is good, it's Mario, but too many bugs, when doing the rally's it's highly frustrating when the game slows and courses you to make mistakes, fix the bugs and the games 5 star, as it is I'm left feeling cheated all the time", "rating": "2", "version": "1.1.1", "date": "2017-02-16T00:30:00-07:00", "title": "Too many bug issues"}, {"content": "It's another MARIO hit! It's innovative, new gen game. This would have easily been 5 star if it had a offline platform and maybe a few more levels?", "rating": "4", "version": "1.1.1", "date": "2017-02-15T23:10:00-07:00", "title": "Super Fun"}, {"content": "Recent update said it was making it easier to increase toads in rally but it is deducting them at the start of each rally! I had 2400 green when I started a rally but at the end when I won it said I had 2387 and added 16 for winning??? WTH Ninty!", "rating": "4", "version": "1.1.1", "date": "2017-02-15T22:36:00-07:00", "title": "Missing toads!"}, {"content": "This game is a 4* plus game love it!! But it's taken my money? Purchased it a few months ago, got a new phone and it wants me to re-buy it just lost £7.99 & I want all the levels back.", "rating": "4", "version": "1.1.1", "date": "2017-02-15T17:31:00-07:00", "title": "Money back? Or levels restored.."}, {"content": "Great game, needs a green toad only rally race.", "rating": "4", "version": "1.1.1", "date": "2017-02-15T03:41:00-07:00", "title": "Green Toads"}, {"content": "...the game costs £9.99, which is somewhat expensive for an iOS game.", "rating": "3", "version": "1.1.1", "date": "2017-02-15T00:02:00-07:00", "title": "Pretty good but..."}, {"content": "Have only been playing it (addictively) for just over a week. I asked my son why I couldn't get anymore rainbow bridges even though I had loads of coins and toads, and even just got princess's cake. Only to be told after looking I had actually completed the game. What the 😡 I feel cheated 😭😭 I was so so enjoying this game, it is (sorry WAS) so fun to play. But how can a Nintendo game be this short. So short that even I, who isn't that amazing at video games, can complete it in just over a week. I was so looking forward to more rainbow bridges and kingdoms to build. But no. The real kicker was I didn't even know I'd completed it. Yes I could keep realistically racing people, but for what. There is only so much you can build in those limited kingdoms before you run out of space. And online it says they (Nintendo) won't be adding anymore to it. Gutted :(", "rating": "3", "version": "1.1.1", "date": "2017-02-14T18:05:00-07:00", "title": "DID love it. Now very disappointed :("}, {"content": "The game is addictive and good but i think its a rip off for the very limited levels in the game", "rating": "2", "version": "1.1.1", "date": "2017-02-14T16:03:00-07:00", "title": "Too expensive"}, {"content": "It's annoying.... it makes me rage quit...stupid bloody game. It starts off ok but I soon lost interest. \n\nI paid £9 and its a lot of money for a mobile game. \nIt also always needs Internet and the servers lag and time out a lot.\n\nI am requesting a refund...", "rating": "2", "version": "1.1.1", "date": "2017-02-14T10:02:00-07:00", "title": "Grrr"}, {"content": "Toad Rally has poor match making - rubbish", "rating": "1", "version": "1.1.1", "date": "2017-02-13T15:32:00-07:00", "title": "Toad Rally has poor match making - rubbish"}, {"content": "Over hyped and costs £7.99 to actually play full version.\nJust make a normal mario game", "rating": "2", "version": "1.1.1", "date": "2017-02-13T15:01:00-07:00", "title": "Disappointing"}, {"content": "I cannot think of a worse thing to do than make a total hash of your biggest title while trying to diversify onto another platform.\n\nNintendo managed just that, its awful, they want £9.99 for the joy of playing any other levels\nIt's auto run and simply a tap to jump, everything that Mario wasn't frankly.\nWhat a shame", "rating": "1", "version": "1.1.1", "date": "2017-02-13T14:03:00-07:00", "title": "Terrible, awful, rubbish"}, {"content": "I've acquired ALL Pink, Purple, and Black Coins. I've achieved 9999 Toads in Toad Rally. I've purchased everything from the shop at least once. I have redeemed everything possible from 'My Nintendo'. Now what?", "rating": "2", "version": "1.1.1", "date": "2017-02-13T09:05:00-07:00", "title": "Now what?"}, {"content": "Don't get fooled by the creators of this game saying that it is free. You can play the first few levels and then they charge you to play the other levels. This is not a good game and I don't recommend this game!", "rating": "1", "version": "1.1.1", "date": "2017-02-13T06:08:00-07:00", "title": "You have to pay !"}, {"content": "This isn't a normal mario game it's a different game itself not following the original Mario franchise, I was looking forward to playing this but it was a let down..", "rating": "1", "version": "1.1.1", "date": "2017-02-13T05:16:00-07:00", "title": "Not Impressed"}, {"content": "I downloaded this game and was going to pay the £7.99 when I completed the first 3 levels only to find out it's now £9.99. Why the price hike? 😡", "rating": "1", "version": "1.1.1", "date": "2017-02-12T13:54:00-07:00", "title": "Rip off"}, {"content": "Utter Rubbish don't get if nintendo fan(or at all!) as u will be dissapointed.", "rating": "1", "version": "1.1.1", "date": "2017-02-12T09:13:00-07:00", "title": "Nintendos worst idea ever!!!!"}, {"content": "I love Mario and other Nintendo games. This is a good smartphone adaptation. But not being able to play this game without a decent  internet connection is just totally preposterous. No such Mario game has ever needed a connection to function before. It makes no sense. I paid full price for it. I can't even play it on the tube or other areas with poor phone signal. Very disappointing.", "rating": "1", "version": "1.1.1", "date": "2017-02-12T08:39:00-07:00", "title": "Cannot be played offline - absolute nonsense"}, {"content": "Mario is fat and stupid. WTF Nintendo?! Why do u pay £8. So Fu**ing expensive.", "rating": "1", "version": "1.1.1", "date": "2017-02-12T08:10:00-07:00", "title": "I hate this game it is crap and crap and crap and shitttttttttttt"}, {"content": "I don't like the new update (hopefully this isn't just a bug on my app) where you can't see the other player in rally mode. Being able to see the other players faded out character and the route that they took made the rallies more competitive and enjoyable frankly. :(", "rating": "2", "version": "1.1.1", "date": "2017-02-12T05:31:00-07:00", "title": "Like it apart from this new update..."}, {"content": "Can't even play the game since it crashes after showing the Nintendo logo", "rating": "1", "version": "1.1.1", "date": "2017-02-12T02:37:00-07:00", "title": "Doesn't open"}, {"content": "The game itself isn't amazing but still a throwback to Mario. So in that sense ... yay Mario :D but unfortunately money money money :(", "rating": "1", "version": "1.1.1", "date": "2017-02-11T14:23:00-07:00", "title": "Profit from nostalgia"}, {"content": "You expected £7.99 after listing game was free? Extremely misleading, its everyone favourite childhood game. Naturally it was extremely exciting when I got notified there was going to be MARIO app for my phone. Not many people are going to pay £7.99 for an iPhone app! But I feel you should've originally listed the game at the actual price! Or even if it was at £2 or £3 you'd have a lot more buyers, due to it being a reasonable price as opposed having a small group of customers, due to the extortionate costing for an IPHONE APP.", "rating": "1", "version": "1.1.1", "date": "2017-02-11T12:11:00-07:00", "title": "Payment"}, {"content": "This game actually cost £7.99 ripoff", "rating": "2", "version": "1.1.1", "date": "2017-02-11T10:46:00-07:00", "title": "TOO EXPENSIVE"}, {"content": "You would expect better from Nintendo but unfortunately this game lacks a certain something.", "rating": "2", "version": "1.1.1", "date": "2017-02-11T05:33:00-07:00", "title": "Dull gameplay"}, {"content": "It's not free such a shame", "rating": "1", "version": "1.1.1", "date": "2017-02-11T03:56:00-07:00", "title": "Not free"}, {"content": "I have always been a fan of Mario games and i think that Nintendo did a good job with this app. I like how they turned the side-scroller into a addictive one-thumb game and also mixed in online competition as well as world building. It's was definitely worth buying the full game, however, i have fully completed it and am now craving for more!", "rating": "4", "version": "1.1.1", "date": "2017-02-10T18:08:00-07:00", "title": "Great game!"}, {"content": "All that waiting for this sh!t,\nDeleted \nLet me know when the original MARIO games come out or even better,let me know when MARIO kart is out,all the old classic sega games are available,why not Nintendo?", "rating": "1", "version": "1.1.1", "date": "2017-02-10T15:06:00-07:00", "title": "Absolute rubbish"}, {"content": "All around money grab", "rating": "1", "version": "1.1.1", "date": "2017-02-10T05:56:00-07:00", "title": "I got baited"}, {"content": "This was clearly an addictive & polished game but after three weeks I had enough (almost collected every hidden coin). It's just way too expensive for me to rate this any higher for what you get.\n\nI since downloaded 'Rolling Sky' for £1.49 and I've been playing that for much longer. Frankly I think that's much better value for money.", "rating": "3", "version": "1.1.1", "date": "2017-02-10T01:49:00-07:00", "title": "Too Expensive"}, {"content": "Not able to play it", "rating": "1", "version": "1.1.1", "date": "2017-02-09T12:29:00-07:00", "title": "Crashes on iPhone 6"}, {"content": "Where to start... well its certainly a mobile type game, why?? its not like the iPhone or iPad is not capable, they have more processing power than previous generation consoles.\n\nLets start £7.99 ...wait WHAT ....now £9.99!!! …its a mobile game Nintendo and a bad one at that!!\n\nFirst impressions were just okay, what could I expect from a mobile game, named Super Mario Run ...well, all you do is press the screen to jump, to collect coins and kill enemies.\n\nHowever the major issues are that you cannot play the game offline, so forget playing Tour mode when theres no data or wifi available! \n\nYour £7.99 ....wait, now £9.99 is going towards a season type pass?? ...waste of money, as when the servers go offline theres no more Super Mario Run. \n\nI ended up purchasing the game by getting a £15 iTunes voucher from a well know site for £9 which was great, as I do regret the purchase. Ended up paying £2.00 for the game, which is still overpriced! Last mistake I make in 2017, no Switch for me! =P \n\nI have played all the world and I must admit the first two worlds were good, after that ...the game felt rushed, like they ran out of ideas. The levels just kept getting shorter, less challenging and dull.\n\nWhen I finished all the worlds I was expecting a nice Mario ending ...well I did worked hard to finish the game like collecting all the coins etc etc ....and what I got was nothing ...it was like heres Peach, Game Over!!! Great!!\n\nThe Rally mode is the Vs. mode where you play against over players or do you?? anyways if you like Rally mode you will never be short of tickets to play the game. I have all the special blocks and while I have 99 (which is the max) tickets ...I just get more from the blocks every few hours.\n\nYou can also build up your kingdom, it not really my thing …so I will not go into it. But if you do make the mistake and buy the game you will not be short on coins or Rally tickets so you can pretty much buy everything and play what ever you want.\n\nAfter you complete the game and have x amount of things there will be special levels available which are hard as....is this the challenge I was looking for NO, it stupid like MK8 200cc stupid!\n\nAnyways I really hope Nintendo don't make any more games like this...its a budget game with a now huge corporate price tag. People who don't mind paying this price …all I can say is well since you have deep pockets fell free and send me some of you hard earned cash! =) ..oh, whats that I hear, yeah I though so!!!", "rating": "1", "version": "1.1.1", "date": "2017-02-09T10:17:00-07:00", "title": "Well I tied to play this with one hand on my iPad, but couldn't??"}, {"content": "Enjoyable game, but the lack of off line limits play on tubes and planes. Even then, the even with a mobile connection I've often had the game trip out claiming 'no internet'. Can't see what's added by being online.", "rating": "3", "version": "1.1.1", "date": "2017-02-09T07:21:00-07:00", "title": "Great fun but limited by no offline"}, {"content": "I love super Mario but it would be much better if you could be in control of where to go. Many times the game moves too fast and you miss something along the way, but you can't go back to pick it up.\nUnless I'm missing something, it would also help if the game could be played in landscape mode.", "rating": "4", "version": "1.1.1", "date": "2017-02-09T03:58:00-07:00", "title": "Great game but...."}, {"content": "After 10 mins the game won't let you progress further unless you pay £7.99, which really annoyed me because That wasn't clear when I downloaded it. I would say it's worth the money though. Also needs to be constantly connected to the internet to play so find wifi or it will kill your data.", "rating": "4", "version": "1.1.1", "date": "2017-02-09T01:32:00-07:00", "title": "Not free, Actually Costs £7.99 but good game"}, {"content": "UPDATE NOT WORKING- Since updating, it's become impossible to play, either on wifi or 4g. Multiple load errors in both game modes, lags and lags too. Fix it sharpish Nintendo, my kids are not please...therefor, I'm not pleased.", "rating": "1", "version": "1.1.1", "date": "2017-02-08T18:26:00-07:00", "title": "UPDATE 😡"}, {"content": "Doesn't allow full control of character. Can hold or go back. After level 3 you have to pay or press on for days to progress.", "rating": "1", "version": "1.1.1", "date": "2017-02-08T16:23:00-07:00", "title": "Rubbish"}, {"content": "The huge drawback about this game is not being able to play it without wifi even with 4g it won't let me play. Also doesn't take long to complete so could do with twice as many levels and harder difficulty as it's a bit too easy.", "rating": "3", "version": "1.1.1", "date": "2017-02-08T12:45:00-07:00", "title": "Good but could be better"}, {"content": "I live this game so much, however, could you add power ups such as FIRE and ICE flower, with their own button that appears on screen, and PROPELLER, with a swipe up function", "rating": "5", "version": "1.1.1", "date": "2017-02-08T11:15:00-07:00", "title": "You've delighted me"}, {"content": "Great MARIO game, but broken badly by two factors:\n1) Need an Internet Connection to play. No logic to this at all. Even if you've bought the extra levels.\n2) No option for a control pad. Always run is okay, but nowhere near the as good an experience.", "rating": "2", "version": "1.1.1", "date": "2017-02-08T01:42:00-07:00", "title": "Could have been 5 stars so easily"}, {"content": "I thought that this game was super fun, and I especially love the Toad Rally! The only problem I have is that when you get to a certain level on the Quest/Actual single player game, you have to pay to access all the other levels. I personally don't like paying for games, so perhaps you could either pay or get some hard-to-get achievements to unlock them? Anyway, I would definitely recommend this super fun game. X", "rating": "4", "version": "1.1.1", "date": "2017-02-07T23:37:00-07:00", "title": "Really Fun! 👍🏻"}, {"content": "For the price of £9.99, there should be a bit more content, I finished all of the levels in an hour", "rating": "3", "version": "1.1.0", "date": "2017-02-07T06:08:00-07:00", "title": "Not much to do"}, {"content": "When it came out I was excited it was free but you can only do the starter levels so I brought the full vertion for £7.99 I I got trough the levels in only 15 muinets like srsly waist of money should be 49p pffttt", "rating": "1", "version": "1.1.0", "date": "2017-02-07T06:06:00-07:00", "title": "Srsly"}, {"content": "Based on this and Pokemon Go one has to wonder why Nintendo just don't bite the bullet and go full third party.\n\nThis is an excellent game with plenty of heart, well worth the £9.99 - simply because there are no microtransactions that ruin \"free\" games.", "rating": "5", "version": "1.1.0", "date": "2017-02-06T15:17:00-07:00", "title": "Excellent"}, {"content": "Should not be £9.99 if it were £2.99 then if would be worth it it's an apple app for goodness sake not a console game!!", "rating": "1", "version": "1.1.0", "date": "2017-02-06T13:44:00-07:00", "title": "Expensive!!!!!!"}, {"content": "This is a proper MARIO game. Love it.", "rating": "5", "version": "1.1.0", "date": "2017-02-06T12:51:00-07:00", "title": "Everything I hoped for"}, {"content": "You should add more levels and bosses.Like bowser jr and the other coopalings.if you add more levels maybe don't make someone be kidnapped.for now it is worth £5 but if you add more stuff it will be a good price.I want to see other people's kingdom.But on the positive side there is a lot of replayability.Aside from all that,If this is mario s first appearance on iphone im excited for the next Mario games on phone.", "rating": "5", "version": "1.1.0", "date": "2017-02-06T10:44:00-07:00", "title": "Add more"}, {"content": "Far too easy to complete, the game needs so many more levels - even the recent update was really quick to finish. Poor value for money.", "rating": "2", "version": "1.1.0", "date": "2017-02-06T05:44:00-07:00", "title": "Far too easy !"}, {"content": "An amazing game! Love it! \nSo addictive! And come on... it's MARIO! What more could you want? \n\n10/10\n\nReally don't understand why people are so tight! Giving it a low rating does not do any damage to a name like Mario! 7.99 is nothing! Stop being cheap skates! I would rather pay up front then have to do micro transactions, and end up spending more. Use your brain cells people... if you have any!", "rating": "5", "version": "1.1.0", "date": "2017-02-05T13:57:00-07:00", "title": "Lets a go!"}, {"content": "Try finding an area with better connection.", "rating": "1", "version": "1.1.0", "date": "2017-02-05T12:31:00-07:00", "title": "Review unavailable"}, {"content": "Not workin hope the do something", "rating": "1", "version": "1.1.0", "date": "2017-02-05T07:37:00-07:00", "title": "Not working"}, {"content": "Great game", "rating": "5", "version": "1.1.0", "date": "2017-02-05T04:23:00-07:00", "title": "Addictive"}, {"content": "I absolutely love this Game really good Design looks just like a consul version! But what I don't like it's the constant Data downloads every time I open the app! Other than that it's an alright game", "rating": "3", "version": "1.1.0", "date": "2017-02-05T04:11:00-07:00", "title": "Data downloads"}, {"content": "I wouldn't even bother with this. Nintendo, if you want to charge us £7.99, just make it public, and use this as a demo!", "rating": "1", "version": "1.1.0", "date": "2017-02-04T17:41:00-07:00", "title": "Pathetic. Would rate 0 stars if I could."}, {"content": "Five stars...!", "rating": "5", "version": "1.1.0", "date": "2017-02-04T11:33:00-07:00", "title": "Great"}, {"content": "The app crashes before opening dont download . What a waste of time", "rating": "1", "version": "1.1.0", "date": "2017-02-04T08:49:00-07:00", "title": "Worst app"}, {"content": "Best game ever please get it for your own good", "rating": "5", "version": "1.1.0", "date": "2017-02-04T08:31:00-07:00", "title": "Best"}, {"content": "But I hate these stripped down version of great games. Annoying as hell.", "rating": "1", "version": "1.1.0", "date": "2017-02-04T06:34:00-07:00", "title": "No In-app purchases!!! 😀"}, {"content": "Literally uninstallable , useless application", "rating": "1", "version": "1.1.0", "date": "2017-02-04T06:10:00-07:00", "title": "Can't download/Uninstall it"}, {"content": "I was so happy to realise that this game wasn't one more of those micro transaction games that infest the App Store.\n\nI will likely pay the £8, even though a little steep, you can't expect a game of this standard to be less, without micro transactions.\n\nThis game lives up to being a Nintendo game, it is well made, well balanced and fun. It is a top quality game, as you'd expect from Nintendo.\n\nWell done Nintendo for sticking your guns and refusing to use micro transactions.", "rating": "5", "version": "1.1.0", "date": "2017-02-03T17:10:00-07:00", "title": "Finally a Good non micro transaction Game"}, {"content": "Although a bit pricy, this is a great game. I'm glad I payed for it and didn't listen to those who complained about it. Its not just about the main levels, but more about building your kingdom. Playing the main levels will unlock more variety for the rally game mode which makes it much better as you play on. Overall, great game! Can't wait for future updates for this game.", "rating": "5", "version": "1.1.0", "date": "2017-02-03T14:10:00-07:00", "title": "Yea... worth it."}, {"content": "Great game and well worth the price. More MARIO games please Nintendo! Mario Cart would be very much appreciated...", "rating": "5", "version": "1.1.0", "date": "2017-02-03T11:47:00-07:00", "title": "Fantastic, fun, nostalgia"}, {"content": "Nintendo have done a great job bringing mario to my phone. It's just want you want coins, all the bad guys and a host of characters that embodies the Mario games. Very addictive and challenging. The only issue is the new update has killed my phone. The new data just won't load gets to 60% then says error.. please can you get this sorted  as I need my mario fix", "rating": "5", "version": "1.1.0", "date": "2017-02-03T05:07:00-07:00", "title": "Nintendo wins again"}, {"content": "Game is getting better and better and has a good price structure.", "rating": "5", "version": "1.1.0", "date": "2017-02-03T01:34:00-07:00", "title": "Awesome"}, {"content": "Great game. But completely fails to work offline in the tube, on planes or abroad, even when you've paid the full premium 7.99 pack. They need to fix or refund.", "rating": "5", "version": "1.1.0", "date": "2017-02-02T15:54:00-07:00", "title": "Broken off network"}, {"content": "Hello, im a writer from PE GAMING, a company that writes reviews and creates videos on popular PE games. When this game was announced it sounded great, and it is great...\nUntil they charge you £7.99 after 3, only 3 levels, just to buy some more.\nI understand if its a free game it needs a way to earn money, but advertising would be better\nPE GAMING\nHarrison", "rating": "2", "version": "1.1.0", "date": "2017-02-02T14:10:00-07:00", "title": "Kinda Ripped off"}, {"content": "The only spare time I have is whilst travelling. Turns out I can't play then as there is no internet. My kids can't play on long car journeys. Very annoying", "rating": "2", "version": "1.1.0", "date": "2017-02-02T13:40:00-07:00", "title": "Can't play whilst travelling. Poor show"}, {"content": "Wonderful translation of Mario to the mobile market - one of the best mobile games I've played in years.", "rating": "5", "version": "1.1.0", "date": "2017-02-02T13:34:00-07:00", "title": "Brilliant"}, {"content": "A mobile game actually worth playing for a reasonably priced one time purchase.", "rating": "5", "version": "1.1.0", "date": "2017-02-02T02:09:00-07:00", "title": "Great Mobile Game, Excellent Value"}, {"content": "Keeps saying my payment method was declined, this means I can't play the game, I was happy to play the game. But not now.", "rating": "2", "version": "1.1.0", "date": "2017-02-02T01:20:00-07:00", "title": "No!"}, {"content": "Damn thing still crashes! Not happy at all thought they would have fixed it by now but NO! If I could give it 0 stars I would!\n\nIt worked once now it crashes, I've updated, uninstalled & reinstalled and it still shows Nintendo as that disappears it goes back to my home screen. Was looking forward to playing it but it's not working! Not happy 😞", "rating": "1", "version": "1.1.0", "date": "2017-02-01T18:38:00-07:00", "title": "STILL Crashes"}, {"content": "Don't know why people keep under rating this game. \n\n5 stars and thanks for bringing Mario to the iPhone world :)", "rating": "5", "version": "1.1.0", "date": "2017-02-01T18:22:00-07:00", "title": "A super Mario experience"}, {"content": "When I bought this I was gobsmacked. Only 4 levels a world, cant play it offline and now I've updated it and it doesn't even work! I want my money back.", "rating": "1", "version": "1.1.0", "date": "2017-02-01T10:18:00-07:00", "title": "Overpriced and doesn't work now!"}, {"content": "Needs the ability to play offline! And why stop users from being able to play the game until they update the app??? \nHowever I enjoyed the game and hope more levels are added with no additional cost", "rating": "2", "version": "1.1.0", "date": "2017-02-01T10:01:00-07:00", "title": "No ability to play offline"}, {"content": "I'm happy to pay for a game, but £9.99 seems excessive for such a short game plus the fact that it seems free when you first download.\n\nAlso stopping my purchase is that game doesn't feel particularly intuitive either - Compared to the actual games it seems a bit easy to play as you have to put in a rather large amount of effort to actually die. The running forwards only is frustrating too. It might as well be temple run or subway surfers (which are freemium) so not worth the money.", "rating": "1", "version": "1.1.0", "date": "2017-02-01T09:33:00-07:00", "title": "Not worth the money... And why make it free at first?"}, {"content": "At first I was disappointed thinking it was £8 for a small game, but after my quest to collect the coloured coins and unlock the secret levels I find myself addicted, like the MARIO games I used to play.\n\nThe only bad point is no offline mode :( stuck with 3G and it won't open the app.", "rating": "5", "version": "1.1.0", "date": "2017-02-01T06:50:00-07:00", "title": "Deceivingly Good!!!!"}, {"content": "This is how the whole game should be difficulty wise. It's far too easy to breeze through all the levels. \n\nThe real gaming starts when you collect the coloured coins.. you get rewarded mini-games once complete.\n\nRally Mode is far more challenging and has potential to be quite fun with friends! They've recently updated it so that Toads are too easy to obtain though. Therefore you'll complete the game quicker?! Surely it should be the other way round. \n\nI think you have to disregard the terrible UX and Wifi only factors. Yes it's ££ but it's also very Nintendo and meant for kids. \n\nPlease make more Tour Levels, easier to invite friends to play and share progress too!\n\nIt can be quite repetitive and boring considering there's not much to the story. Think how many free levels you get with King games!\n\n**SPOILER ALERT**\n\nThere's only 20 Kingdom levels?! Cool story bro. \n\nYou can only receive 99 Rally Tickets, 9999 Toads and there's not much to do with the Coins. Seeing as you can't visit your friends Kingdoms yet what's the point in decorating eh?!\n\nThe characters should have been harder to unlock. Luigi FTW!\n\nI thought Rainbow bridges or completing Missions might have unlocked more levels but sadly not. \n\nAnd eventually you do unlock the Princess' cake at the end. But it doesn't appear to do anything, just sits in the middle of your Kingdom & jumps when you tap it - funny that.  \n\nSigh.", "rating": "3", "version": "1.1.0", "date": "2017-02-01T05:37:00-07:00", "title": "Black coins on 4-1! 😿"}, {"content": "so if you are on an underground train; or any other place where u cant get a signal the game wont start up; complete lack of common sense from nintendo", "rating": "1", "version": "1.1.0", "date": "2017-02-01T05:25:00-07:00", "title": "still not working offline"}, {"content": "Why release a game that's free to download and then when you complete the first world it says you have to buy the rest of the game I feel like this is outrageous as a long time Mario fan I think the game should be a lot cheaper then the price it is now because you can buy angry birds for £1 and have triple the amount of levels then Mario does.", "rating": "1", "version": "1.1.0", "date": "2017-02-01T04:27:00-07:00", "title": "The game"}, {"content": "£7.99 and won't update!!!! Can't delete and reload as will loses everything what a waste", "rating": "1", "version": "1.1.0", "date": "2017-02-01T04:06:00-07:00", "title": "Won't update"}, {"content": "Really enjoy playing this, could be more dynamic in parts but the biggest reason for 1 star is no offline play mode. I paid £7.99 for a game I can't play when I want - unforgivable", "rating": "1", "version": "1.1.0", "date": "2017-02-01T03:48:00-07:00", "title": "No offline mode = criminal"}, {"content": "Anyone who is familiar with Nintendo will know what to expect in terms of quality. It plays brilliantly, and looks great. \nIn order to play, you will need to be online, i understand nintendo made it this way to combat piracy, which is fair enough.\nAs other reviewers have said, a home console version of Mario is going to cost about 30-35 quid and upwards, and although the content doesn't compete with a \"proper\" Mario game, the quality is definitely there, and you will find yourself returning for toad rally, or to collect all the pink/purple/black coins, unlocking the other playable characters etc. \nIf you can spare £7.99 I doubt much people will be disappointed, especially those of you that can tell a quality game over a poor one.\nP.s to perform updates just open the App Store and click on updates on the bottom left", "rating": "4", "version": "1.1.0", "date": "2017-02-01T02:36:00-07:00", "title": "Good game"}, {"content": "Good game but think it's very disappointing that the price has gone from £6.99 to £9.99 I think it's very expensive for a mobile game Nintendo product or not especially \n for a game that can be completed in a day or so", "rating": "2", "version": "1.1.0", "date": "2017-01-31T16:25:00-07:00", "title": "Unhappy"}, {"content": "You have to admire what Nintendo has done here, in redesigning beloved Mario for a single touch game.\n\nWith all the currencies and buildings the game feels weirdly like it should be the usual free-to-play-with-in-app purchases model, but I prefer to have an upfront cost, so I probably shouldn't complain.\n\nDefinitely impressed, particularly enjoying collecting the coloured coins on each stage.", "rating": "4", "version": "1.1.0", "date": "2017-01-31T13:43:00-07:00", "title": "Solid redesign"}, {"content": "Went from £7,99 to £9,00 omg joke", "rating": "1", "version": "1.1.0", "date": "2017-01-31T12:34:00-07:00", "title": "Bit of a con"}, {"content": "What a let down. Get real Nintendo - just because your consoles keep failing.", "rating": "1", "version": "1.1.0", "date": "2017-01-31T11:23:00-07:00", "title": "£10?! Now it's £10?!"}, {"content": "I got the update hoping that the game would work with 4G, but still no! How are we supposed to play a mario game that you are supposed to be able to play anywhere when it doesnt work with 4G? It is a great game, but only 3 stars because of this MASSIVE error", "rating": "3", "version": "1.1.0", "date": "2017-01-31T10:18:00-07:00", "title": "STILL doesnt work with EE4G"}, {"content": "The app is telling me to update it, however it's not letting me update it, meaning I can't play the game.", "rating": "1", "version": "1.1.0", "date": "2017-01-31T09:36:00-07:00", "title": "Annoyed"}, {"content": "Doesn't work? Asking to update but there's no update", "rating": "1", "version": "1.1.0", "date": "2017-01-31T09:17:00-07:00", "title": "What happened?"}, {"content": "Good Game just not enough levels. \nFor £7.99 it's a lot for such a small amount of levels. To easy to complete. If there was more levels added and updated regularly would be a 5* Game. Doubt this review will be put on line!!", "rating": "2", "version": "1.1.0", "date": "2017-01-31T09:06:00-07:00", "title": "MARIO RUN"}, {"content": "Nintendo had the opportunity to make a great game here, something that brought back old school Mario but instead we got a limited, way too easy game which just seems half done, I mean why have only 4 courses per world? And why decide to make the actual courses so, so easy? Come on Nintendo, you can do so much better.", "rating": "3", "version": "1.1.0", "date": "2017-01-31T08:43:00-07:00", "title": "Could have been so much better"}, {"content": "The price for the rest of the levels was 7.99 before, I thought I would think about it, went back just now and it's 9.99 why did it go up!!!", "rating": "1", "version": "1.1.0", "date": "2017-01-31T08:28:00-07:00", "title": "The Price changed"}, {"content": "Won't let me update", "rating": "5", "version": "1.1.0", "date": "2017-01-31T06:57:00-07:00", "title": "Super MARIO"}, {"content": "Great game but should be able to throw fireballs", "rating": "5", "version": "1.1.0", "date": "2017-01-31T06:16:00-07:00", "title": "Kim"}, {"content": "I've just completed the whole game and now I get a message on the screen saying update in App Store and it wont go, and there isn't an update. Can u fix this please without me loosing my progress", "rating": "1", "version": "1.1.0", "date": "2017-01-31T06:11:00-07:00", "title": "Why is it telling me to update when there isn't one??"}, {"content": "Wicked more levels please", "rating": "5", "version": "1.1.0", "date": "2017-01-31T06:05:00-07:00", "title": "Great"}, {"content": "This game deffo needs a world tour 2 because I've completely completed the game and there is not enough content and considering I spent £7.99 on this game", "rating": "5", "version": "1.1.0", "date": "2017-01-31T02:50:00-07:00", "title": "World tour 2"}, {"content": "After the first three levels you have to spend £8 which is ridiculous. Already uninstalled rubbish. Some of us like me are children and don't get paid so for me it's a bad game", "rating": "1", "version": "1.0.2", "date": "2017-01-30T23:49:00-07:00", "title": "BAD!"}, {"content": "Single player is no challenge at all. Take about 1 hour game play if that. Multiplayer is replaying same 4 maps over and over again. Also .. you don't actually interact with other player. So it's not really a multiplayer. \n\nThere in no actual rewarding experience in playing this game , so unless you have a fetish for collecting pointless digital coins - don't bother.", "rating": "2", "version": "1.0.2", "date": "2017-01-30T17:20:00-07:00", "title": "Too Easley and too short- no reward"}, {"content": "Mario run is one of the best apps I have played. A fun, addictive game with lots to keep you coming back for more. The gameplay on tour mode is had the classic mario feel & can be quite challenging as the level design is great! The rally mode is just as good & the way you earn points to then build your kingdom is clever as everything is earned in game. Yes you have to pay £7.99 initially but then you have a very playable mario game that works perfectly on iPhone. Well worth the one off payment for one the best app games out there!", "rating": "5", "version": "1.0.2", "date": "2017-01-30T16:34:00-07:00", "title": "Fun, addictive game!"}, {"content": "For the price you pay for this game you'd think there'd be more levels. Also keeps glitching on certain rally's 😤", "rating": "1", "version": "1.0.2", "date": "2017-01-30T15:30:00-07:00", "title": "New levels!"}, {"content": "First few levels are free then you have too pay £9:99 f**kin rip off but what else would you expect from Nintendo selling something on iTunes.", "rating": "1", "version": "1.0.2", "date": "2017-01-30T11:41:00-07:00", "title": "Rip off"}, {"content": "Seriously if your too poor to fork out £7 then don't download the game. It's the price of a mac d's for Christ sake. GOAT game app!", "rating": "5", "version": "1.0.2", "date": "2017-01-30T09:17:00-07:00", "title": "GOAT"}, {"content": "Made me smile throughout! Many a memory brought back from the SNES days! Paid through the paywall but the developers deserve it! Just the always-on internet has to drop.", "rating": "5", "version": "1.0.2", "date": "2017-01-30T09:09:00-07:00", "title": "A good dose of nostalgia!"}, {"content": "Me and my little girl really enjoy playing this game, it's simple and fun. I waited a while to decide whether to pay £7.99 for the full version, only to find the price has gone up to £9.99! Who would pay £9.99 for a smartphone game?!! No, I won't be purchasing the full game and will no doubt get bored of playing the first three screens soon and will delete the app! Why are the makers of these apps so greedy?", "rating": "1", "version": "1.0.2", "date": "2017-01-30T05:46:00-07:00", "title": "Why has the price gone up?!"}, {"content": "The level design is fantastic. I'm so determined to get all the pink, purple and black coins on every level in the 6 worlds - soooo hard to get all those black coins.  Great fun", "rating": "5", "version": "1.0.2", "date": "2017-01-30T01:30:00-07:00", "title": "The more I play it the better it gets"}, {"content": "Put game in pay for category people don't need to be let down by this trash.", "rating": "1", "version": "1.0.2", "date": "2017-01-29T23:59:00-07:00", "title": "£10 Yeah don't think so"}, {"content": "But seriously, £9.99 for anything from the 4th level onwards is unrealistic. You're only paying for the Mario brand name.", "rating": "2", "version": "1.0.2", "date": "2017-01-29T15:54:00-07:00", "title": "Great to have Nintendo back"}, {"content": "Things I like about this game: I get to play Mario on my iPad, every level changes slightly when you get various stages (pink coins, purple coins and black coins), the Toad Rally games playing against other people.\n\nThings I don’t like about this game: I do really hate the auto run, and it takes a little getting used to for controlling it. I’ve got used to it but would genuinely prefer a version that does not auto run, because it doesn’t auto run as much as auto strolls. It stalls frequently, there’s a lag in Rally for response - for example, if, when running, you get a star just as you’re about to jump and clear a pipe with a piranha, the lag can make you drop into the piranha and get killed, both ending the star run and killing you to send you back. You can learn to live with this, but I just got a lag that meant I was exited out of the Rally after a win - and when I opened the app again, I found it stole some of the toad people because I exited out of Rally (I didn’t, I was frozen out). \n\nGenerally, this game is fine - but I’ve been playing on the unpaid version trying to decide whether to purchase it or not. So 1) Can’t complain too much about the free version. But 2) I can note the things that are keeping me from purchasing it for the paid version. I enjoy this enough to play it once every couple days, but not enough to be tempted into paying for it.", "rating": "3", "version": "1.0.2", "date": "2017-01-29T04:30:00-07:00", "title": "Not great, but fine"}, {"content": "I was going to upgrade so that I could play on a forthcoming long journey - then my son told me that you cannot play offline on any version - so reduce the price to £2.00 and I am with you - otherwise their are plenty of other equally good games out their that fit this requirement!!", "rating": "1", "version": "1.0.2", "date": "2017-01-28T14:58:00-07:00", "title": "No no no"}, {"content": "Very good game", "rating": "5", "version": "1.0.2", "date": "2017-01-28T14:56:00-07:00", "title": "MARIO run"}, {"content": "Incredibly overhyped and such a shame. This has such potential to revive the mario franchise that we all loved. \n\nHow they can justify the price for this game is beyond me when the campaign (paid for full) can be beaten in half an hour and the further challenges feel very unrewarding for the time you put in. \n\nPlay it safe people, play a supercell game or marvels future fight!", "rating": "1", "version": "1.0.2", "date": "2017-01-28T13:12:00-07:00", "title": "Super Crap, Run!"}, {"content": "waste of money", "rating": "1", "version": "1.0.2", "date": "2017-01-28T08:31:00-07:00", "title": "Can't play underground / offline"}, {"content": "Mario has been a classic for generations, and playing this was fun, however not having an offline mode is stupid, I mean the download itself is huge! So why can't I play it offline? Also the game just crashes with an error code when I'm using 4G, and I can clearly see a strong signal and other online games work fine.\n\nFor a company like Nintendo with a reputation for taking pride in their gameplay, they didn't think this one through, it felt slightly rushed and could have had more content for the price. \n\nOverall I still can't deny I had fun and the one handed gameplay was smartly thought out, I just wish they would have perfected the bugs by now and added more content as 6 levels finished way too fast. So is it worth the price tag? Not really, £4.99 would be more appropriate, but regardless of all the flaws I did enjoy playing it on my wifi & it was still very enjoyable :) #NintendoFanBoy #HonestReview", "rating": "3", "version": "1.0.2", "date": "2017-01-28T06:53:00-07:00", "title": "Almost amazing, but too many flaws."}, {"content": "The only thing i hate is when it freezes to tell you you now have a blue star and then it continues.... this games all about flow and rhythm... why pause to tell you of a power up its super off putting", "rating": "4", "version": "1.0.2", "date": "2017-01-28T02:18:00-07:00", "title": "Addictive"}, {"content": "was £7.99 now £9.99 are you having a laugh!", "rating": "1", "version": "1.0.2", "date": "2017-01-28T02:02:00-07:00", "title": "Price increase? Are you joking"}, {"content": "Ok game but far too expensive. By lowering the price the price there would be more download and more people would buy it... basic business.", "rating": "1", "version": "1.0.2", "date": "2017-01-27T23:54:00-07:00", "title": "Nintendo are greedy and overpriced"}, {"content": "Can't access anything after level 3 unless you pay. No thanks", "rating": "1", "version": "1.0.2", "date": "2017-01-27T09:24:00-07:00", "title": "Deleted straight away"}, {"content": "The game is good and enjoyable, but the price for the full version it's ridiculous. And not worth it at all.", "rating": "1", "version": "1.0.2", "date": "2017-01-27T07:02:00-07:00", "title": "Rip off"}, {"content": "I purchased this game on a Nintendo-related whim, right off the back of completing Donkey Kong Country and Animal Crossing Wild World for the 3rd time this winter. My town is at the highest level and I payed off all my mortgage to Tom Nook! Anyway, I digress.\n\nThis game was super fun and super run but my only concern is the lack of Birdo. Birdo is a landmark figure of the Mario franchise and is the first ever known transsexual (being born male and now female). Yet she is not in this game and Toadette is?! No one cares about toadette unfortunately. \n\nIf they ever make a sequel I propose Super Birdo Run.", "rating": "2", "version": "1.0.2", "date": "2017-01-27T06:27:00-07:00", "title": "Fun Time but Where's Birdo!"}, {"content": "I am a life long Nintendo fan and love this game.  But, why do I always need an internet connection?  I can't play on a plane, on the London Underground and these are the two main points in my working week I get to play games.\n\nRally mode needs internet fine.  But you can set up Tour mode to cache my progress locally and just upload when I next get a connection.  \n\nPlease learn from this.  You appear to not listen to your customers very well in recent years.", "rating": "3", "version": "1.0.2", "date": "2017-01-26T23:10:00-07:00", "title": "Offline mode needed"}, {"content": "I don't think so.", "rating": "1", "version": "1.0.2", "date": "2017-01-26T15:53:00-07:00", "title": "£7.99!"}, {"content": "I like the game, but needing to have internet connection to play it has put me off paying for the full version (along with the price increase).", "rating": "3", "version": "1.0.2", "date": "2017-01-26T15:28:00-07:00", "title": "Internet Connection Required To Play It"}, {"content": "Awful", "rating": "1", "version": "1.0.2", "date": "2017-01-26T08:15:00-07:00", "title": "Terrible"}, {"content": "It's fun and takes some skill.\n\nVery polished and repayable.\n\nMost games on the app store are garbage. This sets a bar for Polish. \n\nOne star taken out for the online only play. Please introduce an offline mode and stop with the greed.", "rating": "4", "version": "1.0.2", "date": "2017-01-26T07:06:00-07:00", "title": "Haters will be haters"}, {"content": "Apparently, after paying Nintendo for the game, I need to find a better connection. Even when I'm on 3G, 4G and WiFi.\nWas working fine before and now it's not.\nBrilliant on the rare occasions that it works. But don't bother until Nintendo have their act together.", "rating": "2", "version": "1.0.2", "date": "2017-01-26T02:36:00-07:00", "title": "Good when it works"}, {"content": "I have been waiting for this game since the recent iPhone release and wow it doesn't disappoint. I have and always will love Mario! And to have him in my pocket is pure brilliance. With a game with such performance and detail I'm not surprised you need a little internet. Like wise with most apps. So for all the people moaning about the internet connection being required upgrade your tariff there's great deals out there for internet! You just need to look! Thank you Nintendo! You have NEVER disappointed me. 🍄😊", "rating": "5", "version": "1.0.2", "date": "2017-01-26T01:50:00-07:00", "title": "Just awesome!"}, {"content": "Great game and enjoyable...but £9.99......c'mon !!!!!", "rating": "3", "version": "1.0.2", "date": "2017-01-25T13:31:00-07:00", "title": "Hmmmmmm !!"}, {"content": "The game in itself is good - I'm a huge Nintendo fan of old. What is beyond frustrating is the inability to link accounts and the fact that every time I turn the wretched thing on I have to do a *^*>!!!! Download. Seriously what are they downloading??? If I got new levels I could understand but it takes 5 mins and by the time it's finished I've lost the will power. \n\nA pointless waste of everyone's time and money", "rating": "2", "version": "1.0.2", "date": "2017-01-25T13:04:00-07:00", "title": "Frustrating"}, {"content": "It is good for the first little bit until it makes you pay to carry on playing, it's ridiculous!", "rating": "2", "version": "1.0.2", "date": "2017-01-25T13:01:00-07:00", "title": "Bad"}, {"content": "Really enjoyed playing it and once payday came around i finally thought \"you know what, I'll splurge on the £7.99\" even though it's way beyond what I'd spend on a mobile app...and then I found out it's now £9.99?! Kinda disappointed at that and now it's definitely out of my budget. Let down!", "rating": "2", "version": "1.0.2", "date": "2017-01-25T11:53:00-07:00", "title": "Good game but..."}, {"content": "Ive actually heard nintendo say mario is more hot sexier and can get more girls than sonic but anyways, im a fan of mario and sonic but ever since i heard this, i hated mario for religious beliefs ill say the type of promises, Allah Promise", "rating": "1", "version": "1.0.2", "date": "2017-01-25T07:02:00-07:00", "title": "Get stabbed nintendo"}, {"content": "Great visuals great gameplay it's pricey but it's Mario and no tacky wannabe platform game so many try to emulate this but this is worth every penny.", "rating": "5", "version": "1.0.2", "date": "2017-01-24T16:02:00-07:00", "title": "MARIO 4 life ."}, {"content": "The truth! Graphic's, level design and the feel are all fantastic However, they just got the business model completely wrong. They should of gone with a 2.99 cost with an in app option of buying tickets for the road run. Would be better value and earn more over a longer period of time. I wish Nintendo what stop being so Nintendo. #lookatthecostofswitch #anotherfailure", "rating": "1", "version": "1.0.2", "date": "2017-01-24T13:12:00-07:00", "title": "Could of been fantastic"}, {"content": "It's nice that Nintendo are finally making mobile games and it's not a terrible start, but after a couple of games unless ur willing to part with an overpriced charge then you'll soon put it to the discard pile.\nRepeated grinding gameplay.", "rating": "2", "version": "1.0.2", "date": "2017-01-24T05:38:00-07:00", "title": "Lame"}, {"content": "Create a new IP with some new mechanics, don't exploit Mario to a new generation who don't know who the plumber is.", "rating": "2", "version": "1.0.2", "date": "2017-01-24T04:18:00-07:00", "title": "Unhappy with exploit of brand"}, {"content": "Excellent game, great to finally see a new iPhone game with substance. The Mario Rally feature especially is extremely addictive and rewards excelling at the game through finessing your reactions and trying out new strategies and characters. Very much worth the one-off price, if you think the cost is unreasonable you clearly have no appreciation for good game design.", "rating": "5", "version": "1.0.2", "date": "2017-01-23T19:29:00-07:00", "title": "Brilliant and addictive"}, {"content": "I think Mario Run has the potential to be a good game but deffo requires more worlds. I paid for the full app but finished the whole worlds and collected all the different coloured coins in just over a week. Nintendo please update the app with added new worlds.", "rating": "3", "version": "1.0.2", "date": "2017-01-23T13:29:00-07:00", "title": "NEEDS MORE CONTENT"}, {"content": "APP NOW COST £9.99!!! No thanks! played the three free levels then deleted the app", "rating": "2", "version": "1.0.2", "date": "2017-01-23T09:20:00-07:00", "title": "Good game but expensive"}, {"content": "I have no problems with the price, but requiring an internet connection makes it a no-buy. Would have been great to play on the train but go through one tunnel and it's game over.", "rating": "3", "version": "1.0.2", "date": "2017-01-23T08:06:00-07:00", "title": "Internet required"}, {"content": "Nintendo is worth £32 billion. And want to charge £7.99 for a mobile game. Disappointing.", "rating": "2", "version": "1.0.2", "date": "2017-01-23T06:53:00-07:00", "title": "Overpriced"}, {"content": "I didn't buy it at £7.99, I'm definitely not going to buy it at £9.99!! I got The Witcher 3 with all DLCs for less.", "rating": "1", "version": "1.0.2", "date": "2017-01-23T04:58:00-07:00", "title": "Over priced"}, {"content": "The game is great fun when you get into it, and although variations on a theme, does have a few different layers and modes and feels far more like a traditional Mario game than I thought it would. \nHowever, as others have said, you can't play offline, and it'll do sometimes five minute 'data downloads' on startup before you can get to the game which basically means I give up before getting to play it more often than not. Shame. Hopefully it'll be re-engineered at some point to reflect the way people actually play phone games, and that we're not always connected, but until then I think it's pretty expensive given how little use I've managed to get from it.", "rating": "3", "version": "1.0.2", "date": "2017-01-23T04:34:00-07:00", "title": "Great game, when you get to play it"}, {"content": "For what you're paying for, there should be an offline mode. Not every have internet access everywhere they go.", "rating": "2", "version": "1.0.2", "date": "2017-01-23T02:57:00-07:00", "title": "Needs offline mode"}, {"content": "Fantastic effort by Nintendo to create a game that all Mario fans will enjoy and those new to the Mario franchise, this is a great opportunity to embrace it.\n\nThe game plays amazingly well and will have you hooked for hours. Great value!", "rating": "5", "version": "1.0.2", "date": "2017-01-22T15:27:00-07:00", "title": "Very worthy Nintendo game"}, {"content": "You can barely do anything without paying and £7.99 is far too much for a mobile game. More levels and toad colours should be added for free.", "rating": "1", "version": "1.0.2", "date": "2017-01-22T13:01:00-07:00", "title": "Great game but..."}, {"content": "Just downloaded and couldn't get on it. The app wouldn't open", "rating": "2", "version": "1.0.2", "date": "2017-01-22T13:00:00-07:00", "title": "Mario"}, {"content": "Not only was £7.99 a p*** take but the price now is £9.99 for the exact same content. NINTENDO SORT IT OUT!! Deleted straight away", "rating": "1", "version": "1.0.2", "date": "2017-01-22T08:49:00-07:00", "title": "Price now £9.99!!!!! WHAT A JOKE!"}, {"content": "It won't work on our iPad Air would love to try it will go play on the 3DS instead", "rating": "1", "version": "1.0.2", "date": "2017-01-22T08:18:00-07:00", "title": "Doesn't work"}, {"content": "You can play the first few levels for free, but then to play any other level, you need to pay. You have to pay at the end of a row of levels so you can continue and that can get costly.\nIf you are a big Mario fan, though, this is a must-get because of beautiful gameplay and levels.", "rating": "4", "version": "1.0.2", "date": "2017-01-22T04:29:00-07:00", "title": "Expensive"}, {"content": "Fun but only if you pay. £9.99?! You're having a laugh!", "rating": "1", "version": "1.0.2", "date": "2017-01-22T02:48:00-07:00", "title": "Deceptive hidden cost"}, {"content": "The game doesn't even launch. Get a Nintendo splash screen and then it crashes out. What a joke.", "rating": "1", "version": "1.0.2", "date": "2017-01-22T02:39:00-07:00", "title": "Rubbish"}, {"content": "It's not even game. This crap is definitely not worth 7.99", "rating": "1", "version": "1.0.2", "date": "2017-01-21T17:57:00-07:00", "title": "Poor"}, {"content": "Don't waste your time and money!! Worked fine until I paid for full game, now won't load!", "rating": "1", "version": "1.0.2", "date": "2017-01-21T17:13:00-07:00", "title": "Scam"}, {"content": "I don't understand why this game does not have an offline mode and also even with a 4G connection it keeps saying retry with a better connection. HOW MUCH BETTER OF A CONNECTION ARE YOU EXPECTING. \n\nThis game does not work ever without wifi regardless of how good my connection is. \n\nIm getting refund under consumer laws due to the lack of being able to play this game effectively.", "rating": "1", "version": "1.0.2", "date": "2017-01-21T14:08:00-07:00", "title": "Fix needed"}, {"content": "You bet 1 level free then then have pay to go any further.", "rating": "1", "version": "1.0.2", "date": "2017-01-21T12:42:00-07:00", "title": "Craaaaaap"}, {"content": "Cracking game and well worth the money to buy the full game. Looking forward to seeing more Nintendo games on ios.", "rating": "5", "version": "1.0.2", "date": "2017-01-21T11:37:00-07:00", "title": "Cracking game"}, {"content": "Mario run is Mario bros u but portable,that's not a bad thing that's a good thing because I love Mario because I love Mario bros u.", "rating": "5", "version": "1.0.2", "date": "2017-01-21T10:52:00-07:00", "title": "Mario bros u👌👌"}, {"content": "I think the game is fantastic and enjoy the game play. But never realised you can not play this game without data connectivity. I felt so disappointed when i wanted to play on my 7 hour flight but could not do anything. Please fix this issue and let us all enjoy offline game play.", "rating": "3", "version": "1.0.2", "date": "2017-01-21T07:05:00-07:00", "title": "Where is  Offline Game play ?"}, {"content": "Too repetitive and predictable for the price. Not enough depth", "rating": "1", "version": "1.0.2", "date": "2017-01-21T06:00:00-07:00", "title": "Not good enough"}, {"content": "Interesting game but no way would I pay £7.99 for a game that I can't even play without Internet", "rating": "1", "version": "1.0.2", "date": "2017-01-21T03:26:00-07:00", "title": "Meh"}, {"content": "I looked at the reviews saying it was £7.99 which was way to expensive anyway but now they have had the cheek to put it up to £9.99 jog on am I paying that for a phone game when I've only played 4 levels anyway nearly completed it by the sounds of how few levels they are seriously sort it out Nintendo.", "rating": "1", "version": "1.0.2", "date": "2017-01-20T16:21:00-07:00", "title": "Joke of a price!"}, {"content": "Great game, great value. Brilliant from Nintendo. Would recommend to all.", "rating": "5", "version": "1.0.2", "date": "2017-01-20T15:58:00-07:00", "title": "Great"}, {"content": "Download a small insignificant part of a game and then you are expected to pay a fortune for the rest. Good games cost a few pence THIS COSTS 7.99. RIP OFF", "rating": "1", "version": "1.0.2", "date": "2017-01-20T15:53:00-07:00", "title": "FREE. I don't think so"}, {"content": "Negative reviews because you have to stick your hand in your pocket... really? I wouldn't expect Sony to offer free games or Microsoft, so what's the difference? It's a good game and it's worth the money. Pfffft!", "rating": "5", "version": "1.0.2", "date": "2017-01-20T14:32:00-07:00", "title": "Value for money?"}, {"content": "Need £9.99 now!", "rating": "1", "version": "1.0.2", "date": "2017-01-20T14:03:00-07:00", "title": "Unbelievable!!"}, {"content": "Boring, reminds of temple run but with a mario skin.", "rating": "1", "version": "1.0.2", "date": "2017-01-20T13:13:00-07:00", "title": "Boring"}, {"content": "It was £7.99 which is expensive for a platform game when GTA: SA and KOTOR is only £4.99.\nNow the price is £9.99! Nintendo, you are crazy!", "rating": "1", "version": "1.0.2", "date": "2017-01-20T10:00:00-07:00", "title": "Overpriced and the price has gone up!"}, {"content": "Why would you have the price set at £7.99 to unlock the full game, then put the price up to £9.99? This is to much money for a game that you can't even play without an Internet connection. Considering its had over 50 million downloads, I think that the developers are being extremely greedy with asking that much money for a game that's worth £4 at best. I would actually purchase this full game if the developers wasn't so greedy, and charged a fair price. Good luck with future sales, as I'm guessing you probably won't get many!", "rating": "1", "version": "1.0.2", "date": "2017-01-20T09:37:00-07:00", "title": "The price is a joke"}, {"content": "This is becoming a problem and makes the game unplayable. I want my money back. Even with data it, a lot of the time, fails to connect.", "rating": "1", "version": "1.0.2", "date": "2017-01-20T06:09:00-07:00", "title": "Always on internet"}, {"content": "So many people complaining about having to pay for the game... so they've upped the price from £7.99 to £9.99!\nAnd those who argue it's cheap for a fully fledged MARIO game - it's not a MARIO game!\nIt's an endless runner with MARIO style features.\nIf this was a proper Mario game I'd happily pay for it - I paid £8.99 for a Star Wars game on here!\nBut this is just yet another rehashed endless runner game.\n£9.99 is just hilarious.", "rating": "1", "version": "1.0.2", "date": "2017-01-20T05:42:00-07:00", "title": "The price has gone up!"}, {"content": "Was waiting for payday to get this and it's gone up to £9.99! I was aware Apple were putting up the prices a little but 79p to 99p is not the same as £7.99 - £9.99. I believe only Nintendo can sort this. Please fix!", "rating": "1", "version": "1.0.2", "date": "2017-01-20T05:08:00-07:00", "title": "Price increase"}, {"content": "Don't get me wrong this game is great, everything works fine, controls are easy. However, once you get to world 1 level 4 up have to pay (which is fair enough). £7.99 for a full MARIO game is reasonable, so I go to buy an App Store card to buy the game only to find out that the price had been increased to £9.99!", "rating": "4", "version": "1.0.2", "date": "2017-01-20T04:24:00-07:00", "title": "Good but..."}, {"content": "have to buy 99% of the game? Uninstalled", "rating": "1", "version": "1.0.2", "date": "2017-01-20T04:10:00-07:00", "title": "DLC"}, {"content": "Absolutely ridiculous one might say Nintendo has lost his marbles today. I open this bloody app and I notice is doing an update can you bloody believe it the prices gone up from £7.99 to £9.99 come on Nintendo get a grip who in their right mind is going to pay £9.99 for this game. :(", "rating": "1", "version": "1.0.2", "date": "2017-01-20T04:07:00-07:00", "title": "Price has gone up"}, {"content": "Sure, it's Mario and a fun game - but why can't we play offline? Sadly makes this 'mobile' game not very mobile 😕 please sort this in an update Nintendo! I've paid my 7.99!", "rating": "3", "version": "1.0.2", "date": "2017-01-20T02:25:00-07:00", "title": "Fun - but can't play Offline?"}, {"content": "Good game but very annoying that you have to pay after like 4 levels, I've been waiting ages for this to come out but a bit annoyed that you have to pay for the rest of the game", "rating": "3", "version": "1.0.2", "date": "2017-01-20T02:14:00-07:00", "title": "Great game!"}, {"content": "Great little game. \nEnjoyed trailing it before purchasing the whole thing. Hours of fun to be had.", "rating": "5", "version": "1.0.2", "date": "2017-01-20T01:39:00-07:00", "title": "Love it great game"}, {"content": "Waiting so long for this game and am so disappointed. Way too easy to complete. Did it in 30 hours", "rating": "1", "version": "1.0.2", "date": "2017-01-19T23:33:00-07:00", "title": "Too easy"}, {"content": "I absolutely love this game, paid for the full version and extremely happy with how great it is. However, almost every day, it always needs to do a download..", "rating": "4", "version": "1.0.2", "date": "2017-01-19T23:32:00-07:00", "title": "An amazing game but..."}, {"content": "Expectations not met. Classic mario far better. Also don't like the in app purchases", "rating": "1", "version": "1.0.2", "date": "2017-01-19T13:00:00-07:00", "title": "Boring"}, {"content": "Doesn't open", "rating": "1", "version": "1.0.2", "date": "2017-01-19T10:28:00-07:00", "title": "Doesn't open"}, {"content": "The £7.99 is so worth it because THIS GAME IS SO GOOD!!!!!!!!!!! I want to say a huge thank you to Nintendo", "rating": "5", "version": "1.0.2", "date": "2017-01-19T08:34:00-07:00", "title": "Thanks Nintendo"}, {"content": "This is a fantastic game, but the endless Data Downloads are infuriating and have used up every last bit of memory on my phone. Also, you can never play the game unless online - even when you're not playing the online games.", "rating": "1", "version": "1.0.2", "date": "2017-01-19T04:56:00-07:00", "title": "Great gameplay but endless updates!"}, {"content": "Paid the money as thought why not. Toad Rally isn't live as I thought it was going to be, your basically racing against ghosts. Not the greatest game but not the worst. Given the chance again I wouldn't pay to download", "rating": "2", "version": "1.0.2", "date": "2017-01-19T03:48:00-07:00", "title": "Not the greatest"}, {"content": "Really getting to the last level on the first world and being like oh now you gotta pay at least give us the last level", "rating": "1", "version": "1.0.2", "date": "2017-01-19T02:44:00-07:00", "title": "Not cool Nintendo"}, {"content": "It would be a could game if u did t have to pay for everything why bother making it a free app when supposedly it isn't just make it a payed app also because they aren't updating it with content so 24 levels done all coins collected all items collected what now a big waste of money", "rating": "3", "version": "1.0.2", "date": "2017-01-19T00:02:00-07:00", "title": "Pay for everything"}, {"content": "The game is fantastic, loads of challenge collecting all the coins every level. Some of them I have been at for days.\nThe always online isn't a real bother because internet consumption is low and it's to prevent piracy which I understand.\nThe price tag of £8 is not an issue at all as there are no in game purchases or need to pay to speed things, it's a one time payment for a full game. Unlike other games on the AppStore.\nThe game has plenty of fun to offer and have been playing for weeks now and still plenty to do and enjoy.", "rating": "5", "version": "1.0.2", "date": "2017-01-18T17:17:00-07:00", "title": "Really great game, worth the money."}, {"content": "Great game, well worth the money 😁", "rating": "5", "version": "1.0.2", "date": "2017-01-18T15:14:00-07:00", "title": "Fantastic"}, {"content": "Firstly I have no issue with the price. This a great game and super fun to play. My only problem is that having collected all the coins for all the levels, expanded and filled my kingdom and bought every special item bar one, there is not much playability left in it. This has taken me 2 weeks. Rally is fun but rally tickets aren't plentiful enough as I'm now relying on the bonus blocks and games. It would be great if there were more ways to get these more often or new challenges in the levels.", "rating": "3", "version": "1.0.2", "date": "2017-01-18T13:24:00-07:00", "title": "Great game but nothing left to do!"}, {"content": "Awful game what a scam im not paying £8just for a couple of levels would not recomend unless you lime completly wasting your money", "rating": "1", "version": "1.0.2", "date": "2017-01-18T12:17:00-07:00", "title": "Awful game"}, {"content": "Update: I couldn't buy the game for my son so following instructions from Nintendo support I unlinked the accounts and reinstalled. Now it wants me to buy it again. So the game cost me £8 and I can't even play it. \n\n-----\nSo the game itself is great. Feels like a proper Mario game, it's fun. \n\nYou can't play it offline though, this is a bad decision, I play games like this when I stuck somewhere with no signal, sat in the barbers or on a train etc. \nYou should be able to play the game without internet access. \n\nSecond is family sharing. Seems I have to spend the £7.99 for each of my kids if they all want it, and they do. I wouldn't even begrudge playing that if I could but I can't seem to get the accounts set up for the kids. \n\nI hope they sort it out because the game looks like it could get new contents and competitive modes. Could be a great game.", "rating": "1", "version": "1.0.2", "date": "2017-01-18T11:33:00-07:00", "title": "Fantastic game let down in a couple of places"}, {"content": "The game forces you to be online to play. What a joke, rubbish", "rating": "1", "version": "1.0.2", "date": "2017-01-18T10:42:00-07:00", "title": "No internet, no game"}, {"content": "The game is really fantastic, well worth the unlock price! There is so much content!! The trial levels don't really do it justice! :) thanks Nintendo! And thanks for not making it free to play!!", "rating": "5", "version": "1.0.2", "date": "2017-01-18T10:28:00-07:00", "title": "Worth the money!"}, {"content": "Firstly, the game itself is wonderful, there's is hardly any faults and it seems very fun. The only problem is that your target audience is most likely people who have yet to receive money or do not want to spend £8.00 on the game which I completely understand other than that it's a great overall game", "rating": "4", "version": "1.0.2", "date": "2017-01-18T08:52:00-07:00", "title": "Target audience"}, {"content": "Be aware that while this is a free app, it's pretty much a free taster giving you access to the first three levels - if you want the entire game you have to pay £7.99 and that opens up the full 24 levels.\n\nTo be be honest, the 24 levels are actually pretty easy... I'd 'completed' the game within about 60 minutes of play. However you can keep going back to collect pink, purple and black coins that unlock rally coupons - something which I don't fully understand the point of at this point in time. Collecting these coins takes longer than the initial completion of the levels!\n\nIn summary, this is a great game, a real must for any Mario fan! I'd love to see more levels though. \nThe one touch control is really inspired and makes it easy to play anywhere. £7.99 seems (very) pricey for an app, but this is really a console quality game - given the number/ease of levels I'd say the value is just about spot-on. If I could go back in time I wouldn't hesitate to download again!", "rating": "4", "version": "1.0.2", "date": "2017-01-18T07:44:00-07:00", "title": "Addictive & Great Fun!!"}, {"content": "Love this game didn't cost much and you get so much for it. Even if you decide to just use the free part of it, it's great!\nIt has all the nice little details and seems like it's been well thought through. I still am not bored of it, there's always new things to do. Love love love!", "rating": "5", "version": "1.0.2", "date": "2017-01-18T05:06:00-07:00", "title": "Amazing!!"}, {"content": "Having read up about this game before it's release, I had a full appreciation of what to expect. It has more than delivered. Great visuals mixed with intuitive simple controls makes it a great game that you can either binge for an hour or play just 2 rounds. \n\nI would highly recommend t any die hard Mario fan.", "rating": "5", "version": "1.0.2", "date": "2017-01-18T03:16:00-07:00", "title": "Fantastic"}, {"content": "Missing most core functionalities other games poses, not to mention the ridiculous price Ninscamdo want you to pay.", "rating": "1", "version": "1.0.2", "date": "2017-01-18T00:24:00-07:00", "title": "Absolutely terrible App."}, {"content": "Some people always have something to moan about, but this is ridiculous...! The game is excellent and I can't stop playing it. I don't play games on my iPhone but, this caught my eye in the Apple Store so I downloaded. I couldn't think of anything else but buying the upgrade for ages and I was glad I did. When I get home of an evening, I look at my Xbox one in disgust and delight myself with Mario. Let this be a message to Nintendo; this is a massive market, you have a back catalogue of amazing games just asking to be remastered for the iPhone. Stop people from being tempted to download emulators and use this platform for growth! I know Nintendo have a few products in the pipeline I look forward to the next! As for the price, I've never paid for an app before until now and I have zero regrets. £7.99 is the equivalent of two drinks and an hour and a half in the pub. You'll have many more hours of fun with this :)", "rating": "5", "version": "1.0.2", "date": "2017-01-17T18:02:00-07:00", "title": "Excellent addictive game - finally!"}, {"content": "Nintendo innovation and MARIO on a phone turns out to be a good mix", "rating": "5", "version": "1.0.2", "date": "2017-01-17T16:42:00-07:00", "title": "10/10"}, {"content": "I've really enjoyed playing the games, I didn't mind paying the £7.99 for it as I think it's worth it, even though I completed all the worlds in a day 😂 However I can now go back through the levels to try and collect all the pink, purple and black coins, which seems to be more difficult than the levels itself - but still fun and highly addictive. It also has the toad rally which I find super fun- competing against others to gain more toads for your kingdom! Overall I think it's a great fun game to pass the time!", "rating": "5", "version": "1.0.2", "date": "2017-01-17T16:36:00-07:00", "title": "Addictive fun game!!"}, {"content": "Paid £7:99 for full game. Completed all levels in one day. Completed game fully (all coins and rally) in three weeks. Albeit final special course for when all black coins are collected which is deliberately impossible to complete.", "rating": "1", "version": "1.0.2", "date": "2017-01-17T14:45:00-07:00", "title": "Not worth it."}, {"content": "I hope this is not the future of apps - requiring internet to use them. I don't play many games but what little I have played of Mario seemed great fun! All very well for the many people who live in the city, but unplayable for anyone who lives in the countryside with slow internet / phone reception.. Shame :(", "rating": "2", "version": "1.0.2", "date": "2017-01-17T14:24:00-07:00", "title": "Internet required, so unplayable.."}, {"content": "Think the app is fantastic really enjoyed playing. Feel for the money there should be added level as completed too quickly. Please add more!!!", "rating": "4", "version": "1.0.2", "date": "2017-01-17T11:29:00-07:00", "title": "Needs more"}, {"content": "Fantastic game.", "rating": "5", "version": "1.0.2", "date": "2017-01-17T10:07:00-07:00", "title": "Totally worth it"}, {"content": "I bought this game cause I love Nintendo games but the fact u need to be online at all times makes this game almost unplayable at times, hopefully Nintendo do better with future releases. Cause this is shocking at times.... sort it out Nintendo!!!", "rating": "2", "version": "1.0.2", "date": "2017-01-17T09:48:00-07:00", "title": "Joke of a game"}, {"content": "This isn't it. It's terrible and doesn't possess any of the fun and polish of nintendo's main console titles. If you want Mario, try Super Mario 3D World on the Wii U. If you want something that has a much more Mario-ish feel on iOS, try Super Cat Tales.\n\nSuper Mario Run is a flop of epic proportions. Not even worth your time to download it.", "rating": "1", "version": "1.0.2", "date": "2017-01-17T08:51:00-07:00", "title": "Looking for a Mario Game?"}, {"content": "Why get the game for free then play 3 levels then have to PAY for EVERYTHING ELSE!!!!!!!", "rating": "1", "version": "1.0.2", "date": "2017-01-17T08:34:00-07:00", "title": "Bad"}, {"content": "Why bother making the app free if you only get 10 minutes of gameplay before realising you have to pay a stupid amount? Pointless. Get a DS.", "rating": "1", "version": "1.0.2", "date": "2017-01-17T06:10:00-07:00", "title": "Overpriced rubbish"}, {"content": "For several days now I have only been able to play on wifi (despite my 4G connection being faster - tested at 60Mbps), Nintendo support simply say \"move to better signal\" and they're aware of the problem and I have to have patience. \nWhat's the point?", "rating": "1", "version": "1.0.2", "date": "2017-01-17T05:23:00-07:00", "title": "Doesn't work on 4G"}, {"content": "Genuinely didn't know it had to be always online and barely get to play. Bought this for the commute and despite having a decent signal (more than enough for HD Netflix and YouTube) it's not enough for Mario Run. If I wanted to play MARIO at home using my wifi I'd use a console. Pointless until they patch the game to remove need to be online. Really want to support games like this (not pay as you play) and Nintendo with their mobile forays but come on, this is insanity. The game that I played briefly was fantastic. I strongly recommend that you do not buy until they fix it.", "rating": "1", "version": "1.0.2", "date": "2017-01-17T04:55:00-07:00", "title": "Always online for a mobile game is insane"}, {"content": "It looks like a Mario game, but doesn't play like it. The running gets boring, I miss an actual Mario game, should've made a proper one, price point would've been ok for that. This, meh, I paid for it - but I've paid same price for much much better games. Oooo Mega Man is coming to iOS...", "rating": "1", "version": "1.0.2", "date": "2017-01-16T14:25:00-07:00", "title": "Meh-rio"}, {"content": "Great game and great graphics. Nintendo, you blocked my previous attempts at writing a review as I included the language my kids seen when they played Rally. Their competitor was called 'poor_b***h'. I know it's a game for all ages but if you can block me from saying what they read, then would you block it in the game, cheers. I didn't purchase this game for my 5 year old and 7 year old to practise their reading out loud with glee, I purchased it for them to play until their arms go numb and I can gaze adoringly at how silent they are and admire them turning into wee zombies. 😵😉", "rating": "3", "version": "1.0.2", "date": "2017-01-16T14:06:00-07:00", "title": "Kids played against 'poor_b***h'"}, {"content": "My phone is telling me I have 4 out of 5 bars with a 4G connection. The game tells me to find somewhere with a better internet connection! All other games that need an internet connection seem fine. If it wasn't for that the game would get 2 more stars as it's fun and keeps you coming back.", "rating": "2", "version": "1.0.2", "date": "2017-01-16T11:13:00-07:00", "title": "Fun game but internet connection is an issue"}, {"content": "Hi I work for gaytendo", "rating": "3", "version": "1.0.2", "date": "2017-01-16T10:35:00-07:00", "title": "Alright game"}, {"content": "As a stand alone MARIO game this is a fun little package and having to pay for it even after a few levels is not a big deal. The game itself is easy to play and entertaining. But the only thing I can't really forgive is that fact even after paying for it you need an internet connection. In all honesty I only really see myself playing the game while on the go and due to this flaw I find I can't as most of the time I'm on the underground. This is increasing frustrating when there's just bad connection and the game will just not load, even above ground or on weak wifi. I understand that say it's for privacy reasons but really this is an mistake and takes away the most important thing for the audience it was aimed at.", "rating": "3", "version": "1.0.2", "date": "2017-01-16T10:09:00-07:00", "title": "Not the price that disappoints"}, {"content": "Well on the wii I adored mario and couldn't wait for the app however after 3 levels you have to pay 7.99 that is more then mine craft you might aswell pay for the whole game and there is only a few levels after sorry but could improve this !", "rating": "2", "version": "1.0.2", "date": "2017-01-16T08:25:00-07:00", "title": "It's alright I guess ..😅"}, {"content": "Much has been written about the game’s divisive £8 price point – there’s a good summary here – but to me this game has been incredible value for money. Unlike the initially broken Pokemon Go, Super Mario Run has the extreme polish that you’d expect of a fully fledged Nintendo game – and Toad Rally is utterly compelling. It turns out that competing against your friends for coins and Toads is exactly the ingredient that Mario needed all along. I wrote off 2D platformers earlier this year, but Super Mario Run is the game that made me fall in love with them again.", "rating": "5", "version": "1.0.2", "date": "2017-01-16T01:49:00-07:00", "title": "It made me fall in love with platformers again"}, {"content": "Totally crap! You pay 7.99£ and you finish game in 1 hour... ridiculous!! And after that same sh** it all the time....", "rating": "1", "version": "1.0.2", "date": "2017-01-16T01:37:00-07:00", "title": "Mindy"}, {"content": "For no reason, the game refuses to load. 6S Plus and a strong 4g signal and nothing. My settings allow mobile data for this game and yet it still refuses to play. Only works with Wifi, which means i use it at home, which means I'll probably use my Wii U instead, which means this app is redundant. Nintendo, this is a joke.", "rating": "1", "version": "1.0.2", "date": "2017-01-15T15:51:00-07:00", "title": "Cant play it half the time"}, {"content": "Pay to play. 😑", "rating": "1", "version": "1.0.2", "date": "2017-01-15T13:43:00-07:00", "title": "Disapointment"}, {"content": "国家选项中没有中华人民共和国是几个意思？", "rating": "1", "version": "1.0.2", "date": "2017-01-15T13:31:00-07:00", "title": "如果可以我要给负分零星"}, {"content": "Waited 8 hours for game play only not to win a ticket, deleted", "rating": "1", "version": "1.0.2", "date": "2017-01-15T13:09:00-07:00", "title": "Deleted"}, {"content": "Great fun and VERY addictive. No idea why there are so many negative reviews. It's worth the full price, as there's plenty to do.", "rating": "5", "version": "1.0.2", "date": "2017-01-15T12:37:00-07:00", "title": "Super Mario Run"}, {"content": "I gladly paid £7.99 for this on day one. Thoroughly enjoy the game and love the replay ability with the different coloured coins. \n\nHOWEVER, the stupid always online DRM is hurting paying customers. Not pirates. I'm on the train to work and the level won't finish because I'm going through a tunnel. Progress lost have to restart the level again when I have connection. \n\nNo thank you. \n\nLast Nintendo game I will buy if this is how they treat their customers.", "rating": "1", "version": "1.0.2", "date": "2017-01-15T11:30:00-07:00", "title": "Great game. Awful DRM"}, {"content": "For £7.99 would like some more levels and the option for landscape", "rating": "5", "version": "1.0.2", "date": "2017-01-15T11:23:00-07:00", "title": "More levels"}, {"content": "Love Mario and Nintendo as I grew up with them but......the price is ridiculous for the content you get. Yes the game runs smoothly and fun levels keep you entertained but not worth the price tag! Us low earners need to save for the Switch console.", "rating": "1", "version": "1.0.2", "date": "2017-01-15T11:03:00-07:00", "title": "Needs to be cheaper!"}, {"content": "Deleted app! Avoid this game! Best game is GraalOnline Classic!!", "rating": "1", "version": "1.0.2", "date": "2017-01-15T10:54:00-07:00", "title": "I HATE CREATOR AND GAME!!!"}, {"content": "I like this game but you have to pay 7.99 after the 3rd level to carry on! No where did it say anything about having to pay! Yes it might be extremely cheap for a mario game compared to others but still... Why should we have to pay.... just because its Mario? So what! I would have kept this game if it was completely free but now I'll be deleting as I'm not paying to play a game", "rating": "4", "version": "1.0.2", "date": "2017-01-15T09:46:00-07:00", "title": "Good game"}, {"content": "No amazing features and the rally is repetitive and boring. Sadly the main story is far too short and isn't particularly difficult. A real shame especially for the price", "rating": "2", "version": "1.0.2", "date": "2017-01-15T09:37:00-07:00", "title": "Rubbish after a day"}, {"content": "Sonic Runners failed, I hope Super Mario Run can do better", "rating": "5", "version": "1.0.2", "date": "2017-01-15T09:18:00-07:00", "title": "Good Game"}, {"content": "App is not free", "rating": "1", "version": "1.0.2", "date": "2017-01-15T06:40:00-07:00", "title": "App is not free."}, {"content": "Didn't even work I got denied.Don't get this app it's rubbish", "rating": "1", "version": "1.0.2", "date": "2017-01-15T06:04:00-07:00", "title": "RUBISH"}, {"content": "Horrible movement mechanics, takes away from the original Mario Bros games. No offline mode, hefty price tag for a game with the quality of a £5, third party game. Rally mode is very grindy and proves to be a very boring game with no replay value. Could've been a great, revolutionary game to speed up progress in the mobile gaming market but, yet again, this attempt flopped and just made another poor attempt at a new concept.", "rating": "1", "version": "1.0.2", "date": "2017-01-15T05:14:00-07:00", "title": "Could be better"}, {"content": "It's a good classic but I was disappointed in the outcome, so u can't control MARIO that well like why does he run automatically \nTo be honest I like the game but I wish I had more control of mario\nNow next thing this company needs to do is MARIO Kart that would be 👌🏾👌🏾 \nBut overall it's a good game it's just he runs automatically and you can't go back to get coins and to go back u either have to die or restart the level.", "rating": "3", "version": "1.0.2", "date": "2017-01-15T05:00:00-07:00", "title": "It's good but..."}, {"content": "Its worth the wait", "rating": "4", "version": "1.0.2", "date": "2017-01-15T05:00:00-07:00", "title": "Mario"}, {"content": "Definitely not what I expected. Not only that but you need to pay to get the whole game. They might as well made this the demo and a separate app for the full version like most creators. Was ok at the beginning tho", "rating": "2", "version": "1.0.2", "date": "2017-01-15T04:35:00-07:00", "title": "Shmeh"}, {"content": "It is sad that Nintendo decided not to give as a proper MARIO game. We received a runner instead. Nicely made but still just a runner. I feel that Nintendo have used my sentiment for original MARIO series...", "rating": "1", "version": "1.0.2", "date": "2017-01-15T04:16:00-07:00", "title": "Big disappointment"}, {"content": "Fun and easy to learn. I've beaten all of the missions but it's coin challenges add major incentive to replay ignore review price is worth it as well as constant wifi barely uses data", "rating": "5", "version": "1.0.2", "date": "2017-01-15T04:07:00-07:00", "title": "Beat it in 24 hours"}, {"content": "can't even start the game because it just crashes after 5 seconds", "rating": "1", "version": "1.0.2", "date": "2017-01-15T04:01:00-07:00", "title": "don't work"}, {"content": "gr8 game", "rating": "5", "version": "1.0.2", "date": "2017-01-15T02:53:00-07:00", "title": "✨"}, {"content": "So when I first found out this was a thing I was looking forward to it. Mario temple run, that sounds like a fun time consumer. So the fateful day arrived and it was here. I downloaded it played the first three levels and thought \"hey, this is pretty fun\".\nThen I tried to play the fourth.\nWhy in hell would you make people pay for levels. Do you know how much money you make? Because I think you are very confused about how good this game is.", "rating": "2", "version": "1.0.2", "date": "2017-01-15T00:23:00-07:00", "title": "Money Grabbers"}, {"content": "Absolutely terrible. Can't mute the game till forever. Super annoying sounds.", "rating": "1", "version": "1.0.2", "date": "2017-01-14T20:39:00-07:00", "title": "Would not recommend"}, {"content": "There is no denying, yesterday was one of the best days of my life! Thanks George Coleman :)\nPs: what does a bottle say? Glup hey! 😂 #netflix&cuddles", "rating": "5", "version": "1.0.2", "date": "2017-01-14T16:29:00-07:00", "title": "If I was a rich girl..."}, {"content": "I really love this game but I can't afford to pay seven pund ninety nine on it. Pls take the price off I realy like this app.", "rating": "3", "version": "1.0.2", "date": "2017-01-14T16:23:00-07:00", "title": "PLS MAKE IT FREE"}, {"content": "The most polished and fluid game I have played on a mobile device.  Beautiful stylised visuals, simple addictive gameplay and delightful sound.  Relatively quick for an experience player to finish the tour, but plenty of replay in collecting special coins and unlocking features.  Skill level increases the more you explore this game, with level design proving to be perfectly set. Anyone complaining at the price tag needs to recognise and appreciate the quality of production and give credit to this art form. It is well worth the price. I do agree it should be playable offline, but hasn't caused me an issue yet.", "rating": "5", "version": "1.0.2", "date": "2017-01-14T15:09:00-07:00", "title": "Nintendo success!!"}, {"content": "I'd rather pay a bit of money for a game that I know I'm going to come back to than clog up my phone with free apps that get boring after 5 minutes", "rating": "5", "version": "1.0.2", "date": "2017-01-14T13:32:00-07:00", "title": "Great game"}, {"content": "I loved the game at first it was fun easy to play and generally all round a good game until I cleared a few levels and found out there is an extra cost to progress through the game. Really put me off and annoyed me. I personally think Nintendo should lower the cost", "rating": "2", "version": "1.0.2", "date": "2017-01-14T12:17:00-07:00", "title": "£7.99 is too much"}, {"content": "Really good game , well made but a really cheap way of getting off money off people by making an impossible trial of completing 4 levels in 20 seconds as an effort to make money out of me to progress . Shame on you Nintendo. 😒", "rating": "2", "version": "1.0.2", "date": "2017-01-14T11:49:00-07:00", "title": "What could have been a good game was ruined by a cheap way to spend money"}, {"content": "The more I learn the more I find out, you can only play the game once, if you reset the game you lose your purchase of all access.\n\nPlay once and the levels are complete, you can't start again without paying again.", "rating": "1", "version": "1.0.2", "date": "2017-01-14T11:34:00-07:00", "title": "Multi device Con"}, {"content": "Cannot believe his disappointing this game is. Well, when you eventually get through all of the intro's and other rubbish to actually play the game. Waste of time", "rating": "1", "version": "1.0.2", "date": "2017-01-14T10:59:00-07:00", "title": "Rubbish"}, {"content": "This is a terrible game and I hope you have a long attension span because this game takes forever to complete and then when you pay $10 you get totally ripped off", "rating": "1", "version": "1.0.2", "date": "2017-01-14T10:11:00-07:00", "title": "This is a bad choice of game"}, {"content": "Shouldn't be on vertical view and one hand play. We should play this game like the old one. To move foward when you want, to have time to collect the coins and every stuff like that. \nI don't wanna play when I'm walking on the street to bang my head into a pillar.", "rating": "2", "version": "1.0.2", "date": "2017-01-14T09:45:00-07:00", "title": "Bad"}, {"content": "I DONT like the fact the little geezer keeps running and I don't like the fact the game has to ALWAYS be on data to work! What a load of complete and utter f***ing absolute money grabbing piece of f***ing s**t! You are the worst Nintendo and your new console looks f***ing terrible shame on you all!!! I'm sat in the pub without and data wanting to have a little blast but can't cus I got no data? F**k you you f***ing Italian loving w**kers you s**k so f***ing bad it's unreal!!!", "rating": "1", "version": "1.0.2", "date": "2017-01-14T08:32:00-07:00", "title": "Waste of my hard earned time!!"}, {"content": "Don't get it, get run over by a truck instead it's more fun and less painful", "rating": "1", "version": "1.0.2", "date": "2017-01-14T08:24:00-07:00", "title": "Bring back Squario all is forgiven"}, {"content": "The best game ever!! The only thing to make it better would to have a controller, even if it is just a wireless remote with a button, maybe pressure sensitive would be so cool, also I don't get wifi on planes so it would be could to play it offline, but I totally get where you guys are coming from, with the whole basically whole game with only one in app purchase really stands up for what MARIO is about!\n\n😆😆😆😆😆😆", "rating": "5", "version": "1.0.2", "date": "2017-01-14T06:52:00-07:00", "title": "Amazing"}, {"content": "I love this app and paid for the full version but I'm just hoping that they will add more levels and worlds and a different variety of difficulties!", "rating": "4", "version": "1.0.2", "date": "2017-01-14T06:34:00-07:00", "title": "Love it but..."}, {"content": "Good game but if you buy it for that price you should be able to play it offline as well. \nWould rate 5 stars if this was optional", "rating": "3", "version": "1.0.2", "date": "2017-01-14T05:41:00-07:00", "title": "Good game"}, {"content": "Buy a game, expect to be able to play it when ever you want.  Have full 3G/4G connection but game thinks otherwise.", "rating": "1", "version": "1.0.2", "date": "2017-01-14T04:12:00-07:00", "title": "No connection ......"}, {"content": "This game is terrible. The gameplay itself is fine easy simple. But the fact that they charge £8 for about 15 levels is dreadful", "rating": "1", "version": "1.0.2", "date": "2017-01-14T03:43:00-07:00", "title": "Awful"}, {"content": "This game is designed for people of all skill levels, but if you don't figure out how to be really good at it, the price might seem a bit steep. \n\nMy issues are with some of the gameplay elements Nintendo don't normally mess up (interrupting me mid-jump with 'Coin Rush!' is really irritating, and the ghost runners are incredibly distracting). \n\nThe online thing is a commuter issue, but not a problem anywhere else. \n\nIt's expensive by iOS standards, but very, very cheap by Nintendo standards and well worth it to not have ads or microtransactions etc. \n\nOne of the best-quality games I've played on iOS. Even if it does drive me mad at times!", "rating": "4", "version": "1.0.2", "date": "2017-01-14T02:05:00-07:00", "title": "High quality, not perfect"}, {"content": "Lots of connecting issues, full bar on 4G and still saying can't connect!", "rating": "1", "version": "1.0.2", "date": "2017-01-13T21:35:00-07:00", "title": "Crap!"}, {"content": "It upsets me that they couldn't do the original version. This is boring", "rating": "1", "version": "1.0.2", "date": "2017-01-13T17:28:00-07:00", "title": "Not the Mario I was waiting for"}, {"content": "Ridiculous number of screens in the free version. Just not upto expectations. Don't bother downloading, takes longer to download than play the free levels included...", "rating": "1", "version": "1.0.2", "date": "2017-01-13T15:20:00-07:00", "title": "No good..."}, {"content": "Any Nintendo head out there will tell you that the Japanese gaming giants have yet to join the 21st century in terms of exclusive titles, not following the pattern of any demand (graphically or otherwise) and insisting on their own unique brand of gaming and control systems. This makes sense as they are the only true gaming company left. However, it may have cost them on occasion and they might have missed a trick appealing to the ageing gamer who has now grown up with a Nintendo that has not evolved with the gaming zeitgeist, but rather on its own tangent. This is great for kids and non gaming adults alike but the middle generation have been somewhat neglected. In all fairness, a mobile version of a classic Mario game is long overdue, and as far as Nintendo keeping all their cards close to their chest, this is one of the holiest! This is not only a great game but could be the start of an era of integration for Nintendo where it's hottest property might be saleable for a price (and £7.99 for a Nintendo product isn't unreasonable) on a format that isn't its own. The militant era could be over!!", "rating": "5", "version": "1.0.2", "date": "2017-01-13T15:05:00-07:00", "title": "We need more of this forward thinking from Nintendo"}, {"content": "It costs £8.00 for a couple more levels plus Nintendo has the cheek to put all the high reviews at the top misleading a lot of people.", "rating": "1", "version": "1.0.2", "date": "2017-01-13T14:56:00-07:00", "title": "Rip off"}, {"content": "Easy to use, good game, but too many things to be paid for!", "rating": "3", "version": "1.0.2", "date": "2017-01-13T13:09:00-07:00", "title": "Boom"}, {"content": "Nothing wrong here great game and introduction to mobile world.\nNot perfect. It wrote this review as it warrants more than 3 stars..", "rating": "5", "version": "1.0.2", "date": "2017-01-13T12:23:00-07:00", "title": "Nintendo & Apple. Cheers"}, {"content": "Game is alright. Price is a joke. Linking accounts is a joke.\n\nTry again Nintendo.", "rating": "1", "version": "1.0.2", "date": "2017-01-13T11:53:00-07:00", "title": "Bah"}, {"content": "If you want to pay £7 to tap your screen and watch mario run then go ahead and waste your money. 1 free boring level was all I needed see.", "rating": "1", "version": "1.0.2", "date": "2017-01-13T11:50:00-07:00", "title": "Money grabbers"}, {"content": "I can buy GTA sa on iPhone for 4.99. Why am I paying 7.99 for mario? Lol.", "rating": "1", "version": "1.0.2", "date": "2017-01-13T11:45:00-07:00", "title": "7.99 is too much.."}, {"content": "This is a brilliant and polished game and is well worth the money. You get 24 'Tour' levels which differ slightly for each play through for the coloured coins, so it's actually 72 levels. PLUS the rally mode is endless fun. I've spent way more time on this game than other games priced at <£1.", "rating": "5", "version": "1.0.2", "date": "2017-01-13T11:32:00-07:00", "title": "Worth the money"}, {"content": "Keeps asking me to find a better connection despite tons of wifi and 4g. Annoying.", "rating": "1", "version": "1.0.2", "date": "2017-01-13T10:32:00-07:00", "title": "Annoying"}, {"content": "I waited for weeks to get this game and it was a total let down as all u do is click to jump the computer does the rest. Very disappointed.😒😒", "rating": "1", "version": "1.0.2", "date": "2017-01-13T09:54:00-07:00", "title": "I waited for nothing!!"}, {"content": "The game play itself is good but don't expect to play it on the go. There is no offline mode and it is unplayable without wifi. I have fast 4g and a 10gb data package which I use freely but the game will rarely load without an internet connection. I got this go play on the go. Disappointing.", "rating": "3", "version": "1.0.2", "date": "2017-01-13T09:37:00-07:00", "title": "Immobile mobile game"}, {"content": "Everyone else has pointed out the good stuff.\n\nBut the need for an excellent internet connection when loading, starting a level, and ending a level make this essentially unplayable for commuters, and people outside of cities, and kids without mobile data not on wifi.\nBUT they don't tell you this BEFORE you purchase....\n\nI expect better, frankly. No other app is quite that low.\n\nALSO when it says \"Try again after relocating to Silicon Valley\" it is lying: clicking try again even if you are in a bath full of routers will have no effect. Most unenjoyable if you finally complete a level and your connection broke while you were playing.", "rating": "1", "version": "1.0.2", "date": "2017-01-13T09:24:00-07:00", "title": "One massive fatal flaw"}, {"content": "Initially the game looks great and the mechanics are smooth. Although I enjoyed playing this game, it has no replay value at all. It's extremely easy and managed to complete all the levels and worlds in around an hour. The rally mode kept me busy for a couple of days but this too becomes very repetitive as there aren't many levels or variations of the worlds. All in all the game is well made and authentic, but it's very short and doesn't offer much. I would recommend this game if it was cheaper, but I feel it's not worth the £7.99 price tag.", "rating": "3", "version": "1.0.2", "date": "2017-01-13T08:37:00-07:00", "title": "Fun while it lasts"}, {"content": "This game is fun. Easily worth the cost (if this was a ds game people would be lapping it up at 3x the cost). The always online requirement is tedious, lose signal on train/subway which is when I want to run the most!", "rating": "4", "version": "1.0.2", "date": "2017-01-13T04:17:00-07:00", "title": "Super fun"}, {"content": "If you're going to charge for the game say before I download it. Stupid !!!!", "rating": "1", "version": "1.0.2", "date": "2017-01-13T03:50:00-07:00", "title": "Disappointing"}, {"content": "It's a great game but you can only play one world then the rest you have to pay! Why can't this game be free😂", "rating": "1", "version": "1.0.2", "date": "2017-01-12T17:01:00-07:00", "title": "It's good but.."}, {"content": "I want to give it 5 stars because it's Mario but it's too expensive for what it is and you can't play it offline, what a let down", "rating": "3", "version": "1.0.2", "date": "2017-01-12T16:46:00-07:00", "title": ":)))"}, {"content": "Amazing game but you only get like three levels then have to pay at least £8 to get the rest :( also you cannot play it offline?", "rating": "2", "version": "1.0.2", "date": "2017-01-12T16:26:00-07:00", "title": "Too pricey"}, {"content": "If you don't want to pay 7.99 don't download but it's worth it if you do. I play it almost anywhere. I would love new levels I completed them in an hour.", "rating": "5", "version": "1.0.2", "date": "2017-01-12T15:56:00-07:00", "title": "Amazing"}, {"content": "Got this on 15/12 when it came out. So many reviews already- cannot see why it has a lot of low ratings", "rating": "5", "version": "1.0.2", "date": "2017-01-12T15:09:00-07:00", "title": "Great so far"}, {"content": "I feel like three levels is not enough for someone who hasn't bought the game and 7.99 is too much for a short game :(", "rating": "1", "version": "1.0.2", "date": "2017-01-12T14:45:00-07:00", "title": "OVERPRICED"}, {"content": "It's a good game granted but lacking some key features", "rating": "1", "version": "1.0.2", "date": "2017-01-12T14:26:00-07:00", "title": "Pay for a online only game??"}, {"content": "Waste of money", "rating": "1", "version": "1.0.2", "date": "2017-01-12T13:46:00-07:00", "title": "Wasir"}, {"content": "I played through the first few levels and it was terrible. It bassically does everything for you. I didnt buy the full game but i bet it is still hurrendous", "rating": "1", "version": "1.0.2", "date": "2017-01-12T09:00:00-07:00", "title": "Rubbish"}, {"content": "Worth the money and the way to sell a game I believe. Much more to it than you may think as in the finer nuances of design brilliance. Only downside for me is the lack of ability to share the game with family and allow them to have their own user names as a player.", "rating": "4", "version": "1.0.2", "date": "2017-01-12T08:28:00-07:00", "title": "Persevere and it's worth it"}, {"content": "Good game but u can't do much after if you don't want to spend money 💰", "rating": "3", "version": "1.0.2", "date": "2017-01-12T07:51:00-07:00", "title": "#mario#"}, {"content": "Great to play MARIO on my phone.runs very smooth good graphics loads of coins to find and a mini boss battle at the end of each stage.if you area a Mario fan this is a must 👍🏼😁", "rating": "5", "version": "1.0.2", "date": "2017-01-12T06:06:00-07:00", "title": "MARIO"}, {"content": "They could have just left it as it was originally and it would have been great. Instead it's dumbed down. I really hate that it runs for you. I dont want to sprint through levels like that.", "rating": "1", "version": "1.0.2", "date": "2017-01-12T03:38:00-07:00", "title": "A great game dumbed down"}, {"content": "Anyone who's a true Nintendo fan will love this. For a first attempt at it, this is excellent. Main game is not too difficult but the coin challenges can be tricky, and extra courses...road rally is addictive and can play for a few minutes if short on time. The kingdom building/shop element is a nice touch. Controls are simple and perfect for iPhone touch screen. Looking forward to the next instalment!", "rating": "5", "version": "1.0.2", "date": "2017-01-12T00:27:00-07:00", "title": "Superb. Mario on iPhone!"}, {"content": "This game is probably the best mobile game I've ever played! If you don't like the fact that you have to pay something like £10 for loads more levels and cool features, that's fine, but that's not a reason to give it one star. \n\nI feel that this qualifies as a full release, if Nintendo were to release this on the Wii or DS then it would be pretty much the same as this, and would cost the same amount, if not more!\n\nFor those who didn't purchase the full game, maybe give it another try and play more of the Toad Rally as well.", "rating": "5", "version": "1.0.2", "date": "2017-01-11T23:33:00-07:00", "title": "Love this Game!"}, {"content": "I was sceptical about how this game would play, but it all works so brilliantly! I've been hooked since I bought it. So much replay in collecting all the coins on tour, and even more when competing in the rally. It's actually reinvigorated my love for the mario games and convinced me to buy a switch when they are released.", "rating": "5", "version": "1.0.2", "date": "2017-01-11T19:59:00-07:00", "title": "What's with all negativity! This was a bargain at £7.99. Best phone game I've ever played!"}, {"content": "This game is a waste of time and money £7.99 and completed in less than an hour and to top it off there will never ever be any updates so no new levels or anything what a joke do not buy", "rating": "1", "version": "1.0.2", "date": "2017-01-11T19:02:00-07:00", "title": "Do not buy"}, {"content": "I was excited for this game and its not what i hoped for. The whole run thing is crap they could have just done the original mario bros mayb then it would be worth the £7.99 price", "rating": "1", "version": "1.0.2", "date": "2017-01-11T17:06:00-07:00", "title": "Rubish"}, {"content": "The game is pretty good, the only downfall is you can't make Mario run backwards. As for some people saying the game is expensive. Get your money spent it's not expensive for a Mario game..... cheapskates.", "rating": "4", "version": "1.0.2", "date": "2017-01-11T15:40:00-07:00", "title": "Good game. Hopefully the bring Mario Kart next."}, {"content": "Locked behind a paywall after a few worlds, and nothing like the original Mario, really let down considering the wait.", "rating": "1", "version": "1.0.2", "date": "2017-01-11T15:07:00-07:00", "title": "VERY disappointed."}, {"content": "Fantastic to see Mario finally on iOS. Well worth the money and beats having to pay for IAPs all the time.", "rating": "5", "version": "1.0.2", "date": "2017-01-11T14:42:00-07:00", "title": "A welcome return"}, {"content": "Personally as a mario fan I think this game is astonishing and if your a mario fan then get it because trust me you will get addicted to it easily. Don't listen to what other people think, if you want it then go ahead get it. There are may options that Nintendo can add in the game like new characters, more courses, new challenges, new areas for you to expand your kingdom, new special limited items like the Christmas items. The list can go on and on. So if your a fan of mario and you wanna get the game, don't hesitate get it.", "rating": "5", "version": "1.0.2", "date": "2017-01-11T14:14:00-07:00", "title": "Outstanding"}, {"content": "Playing this game is exactly the same as that feeling when your friend accidentally queefs at the dinner table. Everyone has noticed and is very embarrassed. Nobody says anything and nobody finishes their spam on toast.\n\nVery pish. Also a bit shite.", "rating": "1", "version": "1.0.2", "date": "2017-01-11T13:30:00-07:00", "title": "Well..."}, {"content": "CRAP ! TOTAL UTTER CRAP ! you get to play 4 levels and that's it . Oh and you \"only\" have to pay £7.99 for the rest ...", "rating": "1", "version": "1.0.2", "date": "2017-01-11T12:25:00-07:00", "title": "LOSER LUIGIE !"}, {"content": "To be honest I LOVE mario and I'm happy this game came out, it's fun and addictive but shame that you can't play offline and you have to pay 8POUNDS FOR JUST 5 more worlds! That's a giant scam.", "rating": "3", "version": "1.0.2", "date": "2017-01-11T11:48:00-07:00", "title": "Fun but..."}, {"content": "Great for the first level, then it becomes not so free", "rating": "1", "version": "1.0.2", "date": "2017-01-11T11:38:00-07:00", "title": "What a con!"}, {"content": "I did not mind paying 7.99 for a decent app but for a game that will only play when you are online is pretty awful. \n\nIf I had a Nintendo DS I could play at any time but this version will only play if you have an internet connection and there is NO good reason for needing a permanent connection for this type of app!\n\nVery disappointed indeed.....\n\nFurthermore, it appears that if you purchase the full app that purchase is not shared by you family members like other apps. This app is a really bad rip-off regardless of how well it might play. \n\nBe warned. It is certainly not worth your cash!\n\nUpdated additional warning for people considering this awful product. If you find yourself in an area where the internet quality is sketchy you will be plagued with 804-1000 error codes which leave the game completely unplayable. It really is a pile of cr@p!", "rating": "1", "version": "1.0.2", "date": "2017-01-11T11:38:00-07:00", "title": "MARIO fan but very disappointed"}, {"content": "I had the app for under a week. Completed the free bits, ran out of rally tickets then got bored. I'm a cheapskate who is not willing to pay for an app so my enjoyment ends there. Basic but fun and no offline version for on the move.", "rating": "3", "version": "1.0.2", "date": "2017-01-11T11:20:00-07:00", "title": "It's ok"}, {"content": "I❤It😃", "rating": "5", "version": "1.0.2", "date": "2017-01-11T10:03:00-07:00", "title": "👍🏻👍🏻❤"}, {"content": "...when your marketing is better than your product, you get Mario Run. Although I don't think there was any market research around mobile gaming. They'd have been much more successful porting an existing Mario game to mobile.", "rating": "1", "version": "1.0.2", "date": "2017-01-11T10:02:00-07:00", "title": "Marketing Vs Product"}, {"content": "This game is brilliant! Takes me back to my childhood days. The reason for the 3 stars though is that it takes so long to load! For £7.99 I would of thought that they could at least speed up the loading time! I sit down excited to play but then have to sit and wait which by that time i find something else to do!", "rating": "3", "version": "1.0.2", "date": "2017-01-11T08:36:00-07:00", "title": "Great Game, Slow Load!"}, {"content": "It's not worth the £8 I'm dead serious ladz", "rating": "1", "version": "1.0.2", "date": "2017-01-11T07:45:00-07:00", "title": "Bad"}, {"content": "I'm gonna not t buy the full version why because you can hack the game I'm not gonna be stupid and  buy the full version because someone on will come up with the hack comansens", "rating": "1", "version": "1.0.2", "date": "2017-01-11T07:08:00-07:00", "title": "It not offline and you have to buy it for 7.99£"}, {"content": "Way too expensive for a phone game, especially for what you get for £8!", "rating": "1", "version": "1.0.2", "date": "2017-01-10T22:14:00-07:00", "title": "Too expensive"}, {"content": "Lots of advertising; not much game.\n\nGraphics are average at best. Background is annoyingly blurry. \n\nGameplay has some unique features but is honestly just a tap-to-jump runner. \n\nThere doesn't seem to be much content either. If you bought something on this game without being disappointed, then kudos to you.\n\nWay too over hyped by nintendo for a 2-3 star game.", "rating": "2", "version": "1.0.2", "date": "2017-01-10T21:39:00-07:00", "title": "Vaporware"}, {"content": "Absolutely love the game!! I didn't want to spend £7.99 on it, I've never bought anything before and didn't really want to now. But when you compare Mario for example on a console it would be £40+ when its first comes out. So £7.99 isn't anything really in comparison plus I get more use out of it being on my phone than a console. The only thing that I could think of to make it better, is that you and your friends can actually compete instead of it competing against their last go/computer... Reading reviews I agree an offline mode would be good where you could just do the tour for example. But it wouldn't stop me and it hasn't stopped me buying the game 🍄", "rating": "4", "version": "1.0.2", "date": "2017-01-10T19:06:00-07:00", "title": "Mariooo"}, {"content": "Been waiting since it was announced and I love it. I hope that more worlds will be added in a future update.", "rating": "5", "version": "1.0.2", "date": "2017-01-10T13:34:00-07:00", "title": "Amazing"}, {"content": "Love this game DON'T listen to the haters. Great for your mobile.", "rating": "5", "version": "1.0.2", "date": "2017-01-10T12:50:00-07:00", "title": "Mario run"}, {"content": "The game doesn't even load", "rating": "1", "version": "1.0.2", "date": "2017-01-10T12:35:00-07:00", "title": "Won't load"}, {"content": "I can not believe how bad this game is Nintendo ruined the life and sole of Mario I play Mario day and night call me a geek if u what but DO NOT GET THIS GAME IT IS A WASTE OF YOUR TIME", "rating": "1", "version": "1.0.2", "date": "2017-01-10T11:39:00-07:00", "title": "It is so bad I have no idea"}, {"content": "Disappointed! \nGreat game, so much fun to play and although I hardly ever pay for games, especially those at such a high price of £7.99, I enjoyed this so much I didn't give much of a 2nd thought. Then realised no possibility of playing offline?!? No playing on underground or on a long flight?!? Seriously what is up with that. How can a game you pay so much for not give you the ability to play whenever you want. So can't play aboard then; or when I lose signal on a commute?? Utterly ridiculous. Such a shame because it's a great game. Would have got 5 stars without a doubt if offline was possible.", "rating": "2", "version": "1.0.2", "date": "2017-01-10T10:34:00-07:00", "title": "No offline??"}, {"content": "I was going to buy this I'm glad I tried first. Why can't I control the character to go backward or forward as I want just like the proper game. It's so annoying that the character walks forward automatically without letting me go back to pick things left behind or simply to explore more", "rating": "2", "version": "1.0.2", "date": "2017-01-10T10:03:00-07:00", "title": "Why?"}, {"content": "Well let me tell you I am absolutely flabbergasted at the shoddiness of the whole idea. £8 for a one handed game with no depth, no flair and definitely no character! I found the game boring and repetitive, this will have no bouncebackability, EVER.", "rating": "1", "version": "1.0.2", "date": "2017-01-10T09:43:00-07:00", "title": "Not so Super Mario"}, {"content": "Finally a polished game on IOS.", "rating": "5", "version": "1.0.2", "date": "2017-01-10T09:31:00-07:00", "title": "Excellent game"}, {"content": "The game is alright, think it's ridiculous that you have to pay £7.99 for something I'm sure they could afford to put out for free. Dislike that it runs on its own accord and not when you tell it too meaning you can't go back. Do like the colours and the fact it jumps straight over the \"enemies\".", "rating": "2", "version": "1.0.2", "date": "2017-01-10T08:22:00-07:00", "title": "Good but not as good as I'd expected."}, {"content": "It's fun but too limited , it's too expensive as well for a mobile game . I'm not impressed .", "rating": "3", "version": "1.0.2", "date": "2017-01-10T07:40:00-07:00", "title": "Too expensive for a basic MARIO game"}, {"content": "Uhhhhhhhhhhhhhhhh💦💦", "rating": "1", "version": "1.0.2", "date": "2017-01-10T07:04:00-07:00", "title": "This game raped me"}, {"content": "Okay let's get started, well it's a great game up to the fourth level 'cause after the fourth level you have to be willing to pay £8:00! You could nearly make a real life version for that amount! So it's a fun game if you willing to play the same levels over and over again ( saying you don't pay £8 for the rest of the levels ) 😶😐😴. I'm sorry if I annoyed anybody but I just don't £8 is a suitable amount plus when I got the game I thought it was was free because it said when I got the game \"Are you sure you would like to purchase this game for free?\" So that's just my opinion and I've told you some of the inside content. So hope this is helpful. Have a good day and have fun playing what you get free!👋🏻👋🏻", "rating": "2", "version": "1.0.2", "date": "2017-01-10T06:50:00-07:00", "title": "Good, for what you get.😤"}, {"content": "Keeps crashing and saying wait for better connection and I've completed the game it's a little tangible maybe add more levels I can't believe I paid £7.99 for this crap", "rating": "3", "version": "1.0.2", "date": "2017-01-10T05:23:00-07:00", "title": "Crashing"}, {"content": "ALL THE HATERS GIVING BAD REVIEWS AND COMPLAINING ABOUT THE PRICE NEED TO KYS. IF YOU DON'T LIKE THE PRICE THEN GTFO, DOUBT NINTENDO CARE ABOUT A FEW LESS SALES 😊, IM GLAD NINTENDO ARE CHARGING AND I HOPE THEY RAISE THE PRICE HEHEHEHE GET REKT NOOBS XD. Y'ALL ARE POOR AF IF YOU CAN'T AFFORD £8 😂😂😂", "rating": "5", "version": "1.0.2", "date": "2017-01-10T00:23:00-07:00", "title": "Y'ALL ARE BUTTHURT HATERS"}, {"content": "The best mobile game from the Apple Store, simply quality!", "rating": "5", "version": "1.0.2", "date": "2017-01-09T18:41:00-07:00", "title": "MARIO RUN"}, {"content": "Super Mario on nintendo DS was amazing and outstanding!!! This game starts off really good but then when you go to play the next levels u have to buy them!!! Rip off!!! Absolutely not paying money for more levels when I have a DS in room!!! I recommend u not to play this!!!", "rating": "1", "version": "1.0.2", "date": "2017-01-09T17:34:00-07:00", "title": "Rip off!!!!"}, {"content": "This is a good game but I've already finished it when I paid £8 I thought it would come with more and I really hope updates add more levels", "rating": "4", "version": "1.0.2", "date": "2017-01-09T15:50:00-07:00", "title": "Addictive Game"}, {"content": "It's not the Super Mario that we used to play. It's just a caricature of that legendary game.", "rating": "1", "version": "1.0.2", "date": "2017-01-09T15:37:00-07:00", "title": "Super Mario Caricature"}, {"content": "Lame. Promised so much get delivered so little.", "rating": "1", "version": "1.0.2", "date": "2017-01-09T15:31:00-07:00", "title": "Run Away"}, {"content": "I get the developers need the money but use some ad revenue instead of making you pay :(", "rating": "1", "version": "1.0.2", "date": "2017-01-09T15:30:00-07:00", "title": "Was great until..."}, {"content": "absolute joke of a game frankly to say for 6 months leading to this games release to say it is free then charge 8 quid after a few levels is misleading. The game does however look wonderful and crisp but as lovely as the game looks it lacks substance and lack of mechanics it's just a tap and jump game 😒 the in ability also to play offline is just ridiculous it's a basic in all games !! Please don't buy much better independent mobile game designers 👍🏻", "rating": "1", "version": "1.0.2", "date": "2017-01-09T15:26:00-07:00", "title": "ABSOLUTE JOKE DO NOT BUY"}, {"content": "Little pricey for the full game but the game is so addictive! Gonna be sad once I've played it all through!", "rating": "4", "version": "1.0.2", "date": "2017-01-09T14:53:00-07:00", "title": "Addictive and totally Mario for iOS"}, {"content": "All that does is inconvenience legitimate buyers of the game - pirates (who in any case are a small minority) will work their way around it. \n\nThat said, the game is classic Nintendo - brilliant design and extremely intuitive. Bravo.", "rating": "4", "version": "1.0.2", "date": "2017-01-09T14:41:00-07:00", "title": "Great title, but please drop the online-only thing"}, {"content": "Would have put 0 stars if upi couldve becuz its a average alright game for the first 2-3 levels then enjoy yourself😀😀😀\nOh wait you gotta spend £7.99 first wouldnt pay £0.99", "rating": "1", "version": "1.0.2", "date": "2017-01-09T13:08:00-07:00", "title": "Damn u have to put a star"}, {"content": "Don't let all the other reviews change your decision about installing. This game is amazing, I bought the full version on the IAP and I love it. The graphics are insane for iOS and the fact is most Nintendo games cost around £20 for the full game and this cost only £7.99 for an amazing game. Not disappointed at all.", "rating": "5", "version": "1.0.2", "date": "2017-01-09T13:06:00-07:00", "title": "Addicted"}, {"content": "Best game I have played on iPhone and loved everything about the game and still do.\n\nIt's a blessing there are not in game purchases and that the price buys you the whole game with hours of endless pleasure.\n\nI think everyone who has complained about this game have ruined a superb developer and amazing game as we may not see MARIO run 2 or a similar game.\n\nOne thing I do wish is that there were more levels in the tour with a deeper story to boot.\n\nAll in all an amazing game!!!!", "rating": "5", "version": "1.0.2", "date": "2017-01-09T12:15:00-07:00", "title": "Cheap at half the price"}, {"content": "Excellent game. Worth the money.  Highly replayable. I'd rather pay up front than have IAP or it being a pay-to-win model.", "rating": "5", "version": "1.0.2", "date": "2017-01-09T11:29:00-07:00", "title": "Worth it"}, {"content": "This is a very good game and I would say the full version is worth £7.99 But I had tried getting the full version. I'm a child so I have to get the approval. So I sent the request to my dad. He approved but the credit card had expired. I had still got the message that he had given permission. So he sorted out the credit card stuff. I went on the purchase screen and tried to send the request. But it said still waiting for approval. So how will I get the full version now????????", "rating": "2", "version": "1.0.2", "date": "2017-01-09T11:05:00-07:00", "title": "Super awesome game BUT..."}, {"content": "The game seems good fun and playable, but free download only gives 1st 3 levels (5-10mins tops).. I don't feel it's worth the purchase price, so won't be buying.. if full game ever becomes free I'd get it, otherwise not that keen..", "rating": "1", "version": "1.0.2", "date": "2017-01-09T11:00:00-07:00", "title": "Good game not buying though"}, {"content": "Best game on iOS by far.", "rating": "5", "version": "1.0.2", "date": "2017-01-09T09:47:00-07:00", "title": "Fantastic!"}, {"content": "After downloading the game I found that you have to buy the whole game for £7.99 it's a complete fast. I bought the game for my son, he was playing it and then some how it deleted it's self and now all the levels we bought have disappeared. I am so annoyed with this game, I love Mario but this is the worst thing Nintendo have ever done. I am really annoyed with Nintendo for this load of BS and their user name system doesn't even store your details.", "rating": "1", "version": "1.0.2", "date": "2017-01-09T09:32:00-07:00", "title": "Nintendo's worst ever game"}, {"content": "Everything about the game is amazing apart from the fact that you have to pay £7.99 for the full version. I don't have that kind of money to spend so please can there be an update which takes that away? Otherwise I would highly recommend this game. ❤️❤️❤️", "rating": "4", "version": "1.0.2", "date": "2017-01-09T09:18:00-07:00", "title": "Money!!!"}, {"content": "The best iPhone game of all time for me. Totally refined excellence as you would expect from Nintendo.", "rating": "5", "version": "1.0.2", "date": "2017-01-09T08:13:00-07:00", "title": "Top quality"}, {"content": "I love this game so much!! I paid £7.99 to get all levels instead of doing 1by1 and I'm so glad I paid it!! I've been waiting 6months for this and finally! I'm so obsessed with it and building my kingdom! I would definitely recommend this game😜😜😜", "rating": "5", "version": "1.0.2", "date": "2017-01-09T07:59:00-07:00", "title": "Best game ever"}, {"content": "I loved playing it then it said pay to continue playing just make it free", "rating": "4", "version": "1.0.2", "date": "2017-01-09T07:14:00-07:00", "title": "Good game but why do you have to pay?"}, {"content": "Nintendo have delivered the perfect Mobile game: you can play in short bursts, the controls are simple and one handed, the gameplay is easy to learn hard to master, and NO IN APP PURCHASES WOOHOO!\n\nHowever, it loses a perfect score for me because it's a single player game that you HAVE to be online for. Once again another game that's trying to defeat piracy, but in doing so it cripples the product for genuine paying customers!\n\nSo basically I can't play it on planes, trains going through tunnels, the London underground, or the many, many places that don't have signal in the UK. Thanks Nintendo.\n\nEdit: knocked another start off... This game is ridiculously short, which would be fine if it only cost a couple of quid!", "rating": "3", "version": "1.0.2", "date": "2017-01-09T07:02:00-07:00", "title": "Perfect Mobile Gameplay"}, {"content": "Shockingly shite! The Auto-run and auto-jump over obstacles defeats the point. Massive let down, waited months for it to release. Pretty much put me off playing MARIO ever again!", "rating": "1", "version": "1.0.2", "date": "2017-01-09T06:05:00-07:00", "title": "Terrible"}, {"content": "They made a new MARIO, it's not like the old MARIO, the game is short and very easy to complete and for £7, so not worth it.", "rating": "1", "version": "1.0.2", "date": "2017-01-09T05:00:00-07:00", "title": "What a disappointment"}, {"content": "Too many bugs.game won't load.crap!!", "rating": "1", "version": "1.0.2", "date": "2017-01-09T02:43:00-07:00", "title": "Bugs Galore"}, {"content": "First 3 levels are free then you need to pay for rest of levels. Useless game.", "rating": "1", "version": "1.0.2", "date": "2017-01-09T01:59:00-07:00", "title": "Steal your money"}, {"content": "Really great game but you only play the first 3 levels before needing to buy the rest 😡", "rating": "2", "version": "1.0.2", "date": "2017-01-09T00:02:00-07:00", "title": "Good and Bad"}, {"content": "You have to pay £8 for this when it is a free app!", "rating": "1", "version": "1.0.2", "date": "2017-01-08T23:09:00-07:00", "title": "Waste of time"}, {"content": "Great game, really enjoying it. But why does it completely fail with an ugly error message as soon as I loose 4g/wifi coverage? Don't you want us to play this on public transport? The levels are too short for a high priced game.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T22:49:00-07:00", "title": "Cant play o public transport"}, {"content": "If I'd have reviewed this game when I first downloaded it and paid the £7.99 soon after, I would have rated 5*\nHowever I am really pleased I waited because now I can give an honest and more balanced view of the game. \nLike many MARIO is a reminder of my childhood and young adult gaming days, I eagerly and impatiently awaited the arrival of the wonderful little plumber. From the time I downloaded him onto my precious iPhone and game device of choice these days, I was hooked! I played for hours, which is not unusual for a Super MARIO Bros game! I quickly completed the first three levels and decided £7.99 was a worthy investment for some nostalgic game play. \nBut! And this is the kicker guys....As others have said the game is repetitive, very rapidly completed (no I haven't collected all the purple and black coins but I have most of them) I have however always got a full house of rally tokens (Max is 99) they are easy enough to obtain if you get all the coins from each level and then from reward boxes and game houses in your kingdom. \nI enjoy many a rally against other opponents but have quickly learned that only the flying ship level is worth completing and most of the time I win (which really does get tedious) \nI enjoyed working through these though and collecting toads to progress my kingdom, which again I raced through. To my utter disappointment come level 20 that is it! No more kingdom upgrades available, and therefore no real need to continue with the rally mode as I now have no need for toads except to unlock princes peaches special house, as I've run out of room in my kingdom now it just seems a pointless exercise. \nAfter doing some research it would seem that even though those big guys in Nintendo took £7.99 from each of us for this promising game, they have failed to deliver. They have no plans to update the game, or add any content. So disappointed doesn't even cover it! \nSo to sum up! Not worth £7.99! Not at all!", "rating": "1", "version": "1.0.2", "date": "2017-01-08T22:37:00-07:00", "title": "Glad I waited!"}, {"content": "This game is addictive however needs to be developed because already finished it and am bored", "rating": "4", "version": "1.0.2", "date": "2017-01-08T21:05:00-07:00", "title": "Good but needs more"}, {"content": "Super Mario is a classic game which I used to love and enjoy, and although this game is OK, it's nothing on the old games.\n\nFirstly, £8 for an app on iOS is too expensive - I'd pay £4.99 tops for the extension package. Toad Rally is fun but you soon run out of Rally Tickets, and with no other means of getting them other than the ? box and if you're lucky on the bonus game, it's nothing but short-lived. \n\nOn top of this, I keep getting an annoying \"Try again after finding an area with better connection\" notification, despite having full signal or being connected to a strong WiFi point.\n\nThis isn't a game I can't wait to play or am constantly on - but if I'm bored, or waiting for my bread to toast, I might play for a few minutes, instead of refreshing Twitter.\n\n3* - Good effort Nintendo, but if you lower the price for the extension package, I think you would find that you'd have a lot more purchases.", "rating": "3", "version": "1.0.2", "date": "2017-01-08T17:38:00-07:00", "title": "It's good if you're bored or have nothing to do"}, {"content": "The game itself is gokd but obviously people are moaning about the price, but if you think about it, compared to console versions which are like £30 to buy, buying the rest of the levels for £7.99 is a big bargain and is more worth getting, but thats my opinion anyway.", "rating": "4", "version": "1.0.2", "date": "2017-01-08T16:48:00-07:00", "title": "Why the price for the rest of the levels is a bargain"}, {"content": "So you get into the game and all, and it's great, then whoopsie! The Toad Rally isn't actually online! Double whoopsie, after the first world in the solo part, you have to buy all the levels! Triple whoopsie, it's basically impossible to progress early on! And quadruple whoopsie, you can only get one mini game hut! Oh dear! So, yeah. Don't get this game. Personally, I'm deleting it.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T16:33:00-07:00", "title": "Good at first..."}, {"content": "Great game. Amazing graphics, brings back good times! But I honestly think £7.99 is way too expensive for this game! £4.99 would have definitely been a more suitable, affordable price.", "rating": "4", "version": "1.0.2", "date": "2017-01-08T15:56:00-07:00", "title": "Great but too pricey"}, {"content": "The worst game ever and I really want to swear in this post but I don't know who is going to read this or what age so jug invade I'm going to refrain from swearing but this game is so bad to the point that it's glitches my phone and nearly broke it I had to completely reset it so thanks MARIO makers you messed up my phone", "rating": "1", "version": "1.0.2", "date": "2017-01-08T15:25:00-07:00", "title": "Waste of time"}, {"content": "Classic MARIO but little long term playability to keep me coming back. A shame.", "rating": "2", "version": "1.0.2", "date": "2017-01-08T14:46:00-07:00", "title": "Short lived"}, {"content": "It is ok but the rest of the levels r too overpriced if they would lower the price to £3.99 it would be better", "rating": "3", "version": "1.0.2", "date": "2017-01-08T13:33:00-07:00", "title": "Ok"}, {"content": "And remove.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T12:37:00-07:00", "title": "5 min"}, {"content": "This is classic super mario. I like the fact that you can test the game before you buy - I played through the first 3 levels and HAD to buy it. \nOnly knocked a star off as £8 is pretty steep, but I do hate in app purchases and the toad rally tickets do come easy once the game has been purchased.", "rating": "4", "version": "1.0.2", "date": "2017-01-08T12:09:00-07:00", "title": "True Mario Experience"}, {"content": "It's plays like jumping games. Don't waste ur time to download it.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T11:05:00-07:00", "title": "It's not my favourite MARIO game"}, {"content": "I downloaded this app on release day. And was immediately disappointed... It didn't take long to complete the first 3 levels to then be hit with the purchase screen demanding £7.99 to unlock all levels... \n\nI saw all the complaints come rolling in and the pitiful 2 1/2 star rating this game had attracted and though I'd wait it out and just play the Rally and daily mini game thinking Nintendo would realise it is rather expensive and lower the price, even if it was just for the Christmas period however this didn't happen. \n\nI eventually plucked up the courage to ought over the £7.99. And I must say. What a phenomonal game. I've been hooked since! The game just gets better and better. I have got over 2000 toads now and unlocked 4 islands. I also can't stop getting rally tickets from the '?' Surprise boxes. Of which I now have 4! I have stopped playing after world 3 to trying and give myself a chance to battle the Rally tickets down as I'm permanently on 99! \n\nMoral of the story and my only advice to anyone readying this and anyone who has played the first 3 levels and enjoyed it, I know it's very expensive. But pay the £7.99. It will give you months of fun, and will be worth it. £7.99 for months of happiness isn't much in the grand scheme of things. Plus it is a one off payment. All future levels will be free as they say 'pay to unlock ALL levels' so would be cheeky to throw in more in app purchases later. \n\nI hope this review really helps people make up their mind and take the jump. \n\nWhat a sensational game!! 😎", "rating": "5", "version": "1.0.2", "date": "2017-01-08T10:41:00-07:00", "title": "Disappointed to begin with, however very impressed after purchase!"}, {"content": "For all the advertisements of this game it is no way near as good you have to pay a lot of money that is not very good", "rating": "1", "version": "1.0.2", "date": "2017-01-08T10:11:00-07:00", "title": "Not as good as advertised"}, {"content": "Slick design and quality development make this a game which evokes the real Mario experience.  I don't do micro transactions - paying up front for a good quality game makes an enormous difference to the respect a developer gets from me.  Very impressed Nintendo!", "rating": "5", "version": "1.0.2", "date": "2017-01-08T09:46:00-07:00", "title": "Superb quality game"}, {"content": "Supposedly free. All lies. U hve to pay £7.99 for the full game which is barley anything", "rating": "1", "version": "1.0.2", "date": "2017-01-08T09:22:00-07:00", "title": "Crap"}, {"content": "Nintendo are worth the money!", "rating": "5", "version": "1.0.2", "date": "2017-01-08T08:33:00-07:00", "title": "Great game."}, {"content": "I was very disappointed with this version of the game and it will never beat the original. I also thought £8 for the whole levels was very over priced. :(", "rating": "2", "version": "1.0.2", "date": "2017-01-08T08:22:00-07:00", "title": "Not the same"}, {"content": "It's annoying when u first get to the first boss level and I can't play on that level cause it cost £7.99 And the game is free which makes no sense how u can make a game £7.99 and to progress in the game u have to pay money.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T07:57:00-07:00", "title": "Annoying"}, {"content": "Crap. Crap. Crap!!! So I downloaded the game thinking it would be good, but I was wrong. The game doesn't even allow you to jump, it does it automatically. On top of that it says tap to jump but every time I did tap it would take so long to jump and was very unclear. In addition level 2 is so hard. Oh and another thing... £7.99 to unlock a new world!? You're having an absolute laugh mate! I deleted it! Not worth the time or download. Believe me.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T07:13:00-07:00", "title": "Absolute crap!"}, {"content": "The price is unbelievable! A one of price maybe fair enough but charging another £8 after 3 levels?! A rip off. Save your money, it's repetitive at best and if you have to pay more than £15(?!?!) to get past the third level it's just a rip off.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T07:01:00-07:00", "title": "Don't bother!"}, {"content": "Too much money", "rating": "1", "version": "1.0.2", "date": "2017-01-08T06:42:00-07:00", "title": "Way too expensive"}, {"content": "Love the game but didn't take long to complete, and for £7.99 we really haven't been given enough for our money. I wouldn't waste your money until there is a lot more levels", "rating": "2", "version": "1.0.2", "date": "2017-01-08T05:18:00-07:00", "title": "Good game but £7.99 is a rip off!"}, {"content": "I bought this free game but when I did the first world I had to buy access to all the others if the game is free it shouldn't be another pay to play game. Other than this I do like the game even though it's not free at all like it is in the App Store.\n\nAlso it's like every other game of its kind Thanks😁", "rating": "2", "version": "1.0.2", "date": "2017-01-08T04:41:00-07:00", "title": "It's not really free is it"}, {"content": "People who own an apple device are whining that it's £8 for the full game. Are you really that idiotic paying stupid money for your device but complaining about a small amount for a load of content by an awesome game developer renowned for giving so much bang for the buck. Download it for free, play 3 levels plus and decide for yourself. I really like it.", "rating": "5", "version": "1.0.2", "date": "2017-01-08T03:11:00-07:00", "title": "Really enjoyable!"}, {"content": "It's good but u have to buy the other levels", "rating": "4", "version": "1.0.2", "date": "2017-01-08T02:43:00-07:00", "title": "Why do u have to buy?"}, {"content": "Compared to other games, this does not offer good value at all. It's the most expensive app I've bought and also the shortest. \n\nNintendo missed a trick here - it could have been so good.", "rating": "1", "version": "1.0.2", "date": "2017-01-08T02:14:00-07:00", "title": "Total rip off"}, {"content": "It says it's free but you can only play 2 or 3 levels I strongly do not recommend this to anyone.😡", "rating": "1", "version": "1.0.2", "date": "2017-01-08T02:01:00-07:00", "title": "Not free"}]}