{"data": [{"content": "It's great", "rating": "5", "version": "1.11.0", "date": "2017-03-06T11:46:00-07:00", "title": "It's great"}, {"content": "Repeatedly crashing the app while i'm trying to have a conversation by asking for a review - yeah, good skills. Maybe try a different time to interrupt than when people are trying to send messages. It will result in a 1 star review.", "rating": "1", "version": "1.11.0", "date": "2017-03-05T15:26:00-07:00", "title": "Crashing app with requests for review"}, {"content": "Great had a few dates. But please could you have some way of not showing people who haven't been on the app in ages? I keep seeing people who I know are defo in relationships and probs haven't been using the app in the last year. I mean they could be still using it... but still.", "rating": "4", "version": "1.11.0", "date": "2017-03-05T08:47:00-07:00", "title": "Great but..."}, {"content": "5/5 got laid.", "rating": "5", "version": "1.11.0", "date": "2017-03-03T15:36:00-07:00", "title": "Works"}, {"content": "Requires Facebook and then makes a joke about who does not have it.... I don't and I am 30. Loads of my mates have got rid of it and TBH I would not want to date anyone that does have it....", "rating": "1", "version": "1.11.0", "date": "2017-03-03T14:44:00-07:00", "title": "Don't bother"}, {"content": "Can't even get passed the loading screen", "rating": "1", "version": "1.11.0", "date": "2017-03-03T09:22:00-07:00", "title": "Poor"}, {"content": "Women rarely initiate conversation first. What's the point in matching at all?", "rating": "1", "version": "1.11.0", "date": "2017-03-02T16:45:00-07:00", "title": "Women rarely initiate"}, {"content": "Keeps sending useless notifications trying to get me to buy stuff.", "rating": "1", "version": "1.11.0", "date": "2017-03-02T12:07:00-07:00", "title": "Notification spams"}, {"content": "I haven been on this app for 2 weeks and still haven't matched with anyone . Every other app I've had I've always atleast got a few matches a day I just don't get what's wrong with me on this app. It would be better if you could make a better profile and see if people were viewing it", "rating": "1", "version": "1.11.0", "date": "2017-03-01T01:04:00-07:00", "title": "Confusing"}, {"content": "Really I'm enjoying the app! So many people complaining about girls not messaging first, but I've just not found that to be the case. Some really good conversationalists out there, and have had two excellent dates so far. Both with the same girl, I should add!", "rating": "5", "version": "1.11.0", "date": "2017-02-28T09:18:00-07:00", "title": "Much better than most apps!"}, {"content": "Women moderating the show 😀👌🏾", "rating": "5", "version": "1.11.0", "date": "2017-02-28T07:43:00-07:00", "title": "Excellent"}, {"content": "Wouldn't even give one star", "rating": "1", "version": "1.11.0", "date": "2017-02-27T05:58:00-07:00", "title": "Shocking company"}, {"content": "Great app 5*", "rating": "5", "version": "1.11.0", "date": "2017-02-26T13:56:00-07:00", "title": "5*"}, {"content": "Way better than tinder. A great selection of people who are looking for a relationship. Nice that you stay in control of first approaches too", "rating": "4", "version": "1.11.0", "date": "2017-02-25T03:13:00-07:00", "title": "Bumble is ace"}, {"content": "Great app. Women taking the lead!", "rating": "5", "version": "1.11.0", "date": "2017-02-24T09:24:00-07:00", "title": "Works well!"}, {"content": "Love it", "rating": "5", "version": "1.11.0", "date": "2017-02-24T07:11:00-07:00", "title": "Great"}, {"content": "Better than Tinder, now that that app had been so highly monetized. Of course, it can be frustrating when you match with a girl and she doesn't message you.", "rating": "5", "version": "1.11.0", "date": "2017-02-21T20:02:00-07:00", "title": "Decent"}, {"content": "I don't want to sign in with Facebook! Useless app", "rating": "1", "version": "1.11.0", "date": "2017-02-21T15:21:00-07:00", "title": "Sign in"}, {"content": "Rubbish", "rating": "1", "version": "1.11.0", "date": "2017-02-21T07:28:00-07:00", "title": "Pointless"}, {"content": "Buzzin", "rating": "5", "version": "1.11.0", "date": "2017-02-20T23:30:00-07:00", "title": "Buzzin"}, {"content": "Never met anyone from a dating app until I decided to download bumble. Matched with a great guy, we proceeded to meet up for drinks, all was going great, we even had dinner drunk! We went back to his and as you can imagine - stuff happened. It's been a couple of weeks and I haven't heard back, and he recently matched my best friend. So, as I've stated in my title, Bumble is great. Great if you like men who are complete and utter dick heads.", "rating": "4", "version": "1.11.0", "date": "2017-02-20T11:19:00-07:00", "title": "Great App for meeting arseholes"}, {"content": "Great app with the best girls on it. However most of them aren't great at opening a conversation so the premise 'she goes first' can be frustrating.", "rating": "5", "version": "1.11.0", "date": "2017-02-19T08:55:00-07:00", "title": "Best looking girls"}, {"content": "Yet another terrible app that requires you to have a different app (as usual the utterly awful facebook) to sign up. What is the point of creating half an app? Why are these so called developers incapable of designing apps with their own sign up and registration?\n\nAs far as i (and many many others) are concerned, facebook is the cancer of the internet and i have no interest in being any part of it. I certainly do not expect to download an app and have to download and sign up to another one just to use the first one!!", "rating": "1", "version": "1.11.0", "date": "2017-02-17T12:18:00-07:00", "title": "Just another facebook app."}, {"content": "No one sends messages first.\n\nIt's a good idea but flawed as women very rarely initiate contact.", "rating": "1", "version": "1.11.0", "date": "2017-02-17T12:05:00-07:00", "title": "No one sends messages"}, {"content": "Has to be the worst dating app out there.", "rating": "1", "version": "1.11.0", "date": "2017-02-17T07:34:00-07:00", "title": "Terrible"}, {"content": "Deleted immediately. Not everyone likes facebook. Dont be this lazy and get your own system to create accounts.", "rating": "1", "version": "1.11.0", "date": "2017-02-15T07:14:00-07:00", "title": "Facebook mandatory"}, {"content": "Normal people a plenty", "rating": "5", "version": "1.10.11", "date": "2017-02-13T22:29:00-07:00", "title": "Better than tinder"}, {"content": "I'm pretty sure there are a number of ways to prove that you are not catfishing. Argh!", "rating": "1", "version": "1.10.11", "date": "2017-02-09T14:44:00-07:00", "title": "Not everyone has Facebook"}, {"content": "One lot of p**h. Loads & loads of fake profiles. Zero stars tbh", "rating": "1", "version": "1.10.11", "date": "2017-02-09T00:39:00-07:00", "title": "Crap"}, {"content": "No matches, either your profile isn't being displayed or the app doesn't work..\n\nMatch system is floored as who can be bothered to swipe when you can just wait for others to swipe on you.\n\nNo point in carrying on, this app is dead. Only time I get matches is when I delete my account and create a new one then it stops working again after a few days. \nBye bye bumble.", "rating": "1", "version": "1.10.11", "date": "2017-02-07T15:27:00-07:00", "title": "Shambles"}, {"content": "Works exceptionally well.\nHas facilitated two very successful dates so I can't praise the app highly enough.", "rating": "5", "version": "1.10.11", "date": "2017-02-07T04:33:00-07:00", "title": "Great!"}, {"content": "It's mostly fake profiles on this, way more than I've ever seen in any other app. 100% waste of time, try something else instead.", "rating": "1", "version": "1.10.11", "date": "2017-02-06T10:46:00-07:00", "title": "Don't waste your time"}, {"content": "Terrible value for money. No idea what the climate is like before you pay and then when it turns out it's way worse than it's competition you feel like you've been conned. Avoid.", "rating": "1", "version": "1.10.11", "date": "2017-02-02T06:56:00-07:00", "title": "Overpriced"}, {"content": "Great app", "rating": "5", "version": "1.10.11", "date": "2017-02-02T06:48:00-07:00", "title": "Great app"}, {"content": "Just a smaller scale version of tinder really, but it does seem to have less idiots and fakes so I like it.", "rating": "4", "version": "1.10.11", "date": "2017-02-02T01:39:00-07:00", "title": "Pretty good"}, {"content": "I've now matched with two people who I know, I told them I saw them and they have not even heard of this app, let alone sign up for it. \nSo, you will swipe and swipe and no guarantee the other person is even on this. \n\nIt's a great premise for an app, but profiles that don't exist?! Pointless.", "rating": "1", "version": "1.10.11", "date": "2017-02-01T15:35:00-07:00", "title": "Fake Profiles - Avoid"}, {"content": "Banged a few birds", "rating": "5", "version": "1.10.11", "date": "2017-02-01T09:35:00-07:00", "title": "Amazing"}, {"content": "The app is crashed, I can open it but cannot see my profile or the matches/messages. Tried reinstalling but the issue wasn't fixed.", "rating": "2", "version": "1.10.11", "date": "2017-01-31T14:49:00-07:00", "title": "App crashed"}, {"content": "It's pointless to download this app. I think it is full of bots because I get match but never respond. It'a totally disaster.", "rating": "1", "version": "1.10.11", "date": "2017-01-28T08:12:00-07:00", "title": "I don't recommend this app"}, {"content": "This is actually an amazing app.. I get matched with some decent looking women..", "rating": "5", "version": "1.10.11", "date": "2017-01-28T05:37:00-07:00", "title": "Awesome App"}, {"content": "I like the bff feature on the app. However whenever I connect to wifi and use the app, it just keeps loading and doing nothing! It's getting irritating now. When I want to use the app I have to turn my wifi off and use my mobile data - it's annoying.", "rating": "3", "version": "1.10.11", "date": "2017-01-28T03:17:00-07:00", "title": "Good app but keep getting loading error"}, {"content": "It's quite good. Fun! I was surprised that I got a photo of me in an outfit I would and have worn to a club blocked when guys constantly put up photos topless. And leggless! :)) but its best to keep it civilised. Women get a lot of \" What's App\" or Snapchat photo requests. I put on another site\" and for all those sweet dear things, who have asked to see more, I have asked my doctor for x rays of my internal organs\" hahaha", "rating": "4", "version": "1.10.11", "date": "2017-01-23T15:28:00-07:00", "title": "Faery"}, {"content": "Women have to send first message so basically no ones gonna find a date ever on this thing", "rating": "1", "version": "1.10.11", "date": "2017-01-22T12:00:00-07:00", "title": "Stupid"}, {"content": "The app is good, not perfect, but I find the balance between Tinder, OkCupid and Bumble harmonious as they all work slightly differently. My gripe is with the behaviour of men on dating apps. It's largely gross! I've written a blog about my experience mytindertainment dot com. Happy swiping!", "rating": "4", "version": "1.10.11", "date": "2017-01-22T11:52:00-07:00", "title": "Good, apart from the misogyny."}, {"content": "It's such a cute app and I've met some of the loveliest people on it! 🌟", "rating": "5", "version": "1.10.11", "date": "2017-01-17T10:06:00-07:00", "title": "Love it!"}, {"content": "I can't get onto bumble today. It just shows the yellow loading sign but it never loads.", "rating": "1", "version": "1.10.11", "date": "2017-01-16T05:39:00-07:00", "title": "Can't get on"}, {"content": "Beautifully designed, simple to use app, that does what all the others do, but better. Like Apple, Bumble has taken something we all know and given it to us in a simpler, more stylish and more effective way. Dating is great, BFF rocks and I can't wait for BIZZ. Get with the future of networking, in all aspects of your life, and download this app.", "rating": "5", "version": "1.10.11", "date": "2017-01-15T13:16:00-07:00", "title": "The best out there and getting better"}, {"content": "Loving the girl power angle", "rating": "4", "version": "1.10.11", "date": "2017-01-14T16:48:00-07:00", "title": "Amusing way to pass your day"}, {"content": "I like this app. But it would be nice if there was an option whether or not to put your fb details up. Plus a bit more info space would be nice.\nThe idea of having the woman writing first is great. But I've found that most the guys I've matched with, and written too, don't write back, or just un match with me! Come on guys!", "rating": "4", "version": "1.10.11", "date": "2017-01-13T14:50:00-07:00", "title": "Good"}, {"content": "Having reviewed the reviews and used the app for better part of a month there are better places for my age group. Loads of married men on here and it lacks the two way interaction that I now realise is what makes a good dating app/site. I'm not an old person or a techno phone in the least, but I'm also using another well known pay for website in tandem that I'm getting loads of success on. My 28 year old computer nerd brother told me his mates have loads of success on it, think that now sums it up well! So under 30, go for it 😀 over 40 pay for a site !!", "rating": "1", "version": "1.10.11", "date": "2017-01-13T13:12:00-07:00", "title": "Not for single women in mid 40's"}, {"content": "Great for women who don't want relentless douchebags messaging them d**k pics!", "rating": "5", "version": "1.10.11", "date": "2017-01-11T05:46:00-07:00", "title": "Great app"}, {"content": "Easy to use. Swipe right if you like him, if he likes you too he will send a message back. Profiles lifted from your  FB account so more likely honest.  Gentleman please!!! Some of you are too aggressive with no regards for what the women say they want on other sites. Be smart and let a lady pick you", "rating": "5", "version": "1.10.11", "date": "2017-01-11T01:35:00-07:00", "title": "More honest, less aggressive"}, {"content": "Subscribed and was working fine - now suddenly the subscriber features/extras aren't available and yet it's a rolling subscription and says I'm already subscribed...!?! 🤔😤", "rating": "1", "version": "1.10.11", "date": "2017-01-10T18:07:00-07:00", "title": "Paying for nothing!?"}, {"content": "Great app, no problems with it at all, just wish I got more matches 😅", "rating": "5", "version": "1.10.11", "date": "2017-01-10T14:51:00-07:00", "title": "Good app"}, {"content": "Smashing\nSuper", "rating": "5", "version": "1.10.11", "date": "2017-01-10T13:58:00-07:00", "title": "Great"}, {"content": "When I used this app I found it fun and effective. However when I no longer needed it I followed the instructions within the app to delete it. What I didn't realise is that to actually stop paying you have to cancel your subscription via your phone settings (iTunes & App Store- click Apple ID- click subscriptions). They must be making loads of money off people who think cancelling within the app is sufficient.", "rating": "1", "version": "1.10.11", "date": "2017-01-10T00:56:00-07:00", "title": "CANCEL SUBSCRIPTION FULLY!"}, {"content": "Good", "rating": "5", "version": "1.10.11", "date": "2017-01-09T14:49:00-07:00", "title": "Mr"}, {"content": "Good idea awful in practise \n\nZero point in this app full of fake profiles. Women you do match with don't respond within their 24 hour period complete waste of every guys time", "rating": "1", "version": "1.10.11", "date": "2017-01-08T09:25:00-07:00", "title": "Awful"}, {"content": "Joined a few days ago and it's so obvious there are fake profiles to entice you to pay. Total rip off, making money from people hoping to genuinely meet someone!", "rating": "1", "version": "1.10.11", "date": "2017-01-07T02:59:00-07:00", "title": "Fake profiles"}, {"content": "Matches takes time to come.", "rating": "5", "version": "1.10.11", "date": "2017-01-06T09:39:00-07:00", "title": "Bumble"}, {"content": "It's all right, really. Gives fems a slight imbalance of power, but probably what's needed to counter the RSI swipe-righters.", "rating": "5", "version": "1.10.11", "date": "2017-01-04T08:45:00-07:00", "title": "Can't complain"}, {"content": "Fun little app to pass some time.", "rating": "4", "version": "1.10.11", "date": "2017-01-03T05:53:00-07:00", "title": "Fun"}, {"content": "I've downloaded the app yesterday and have been talking to this lovely guy- to meet up for today. In the morning when I opened the app it just keeps loading and so I switched my phone off, tried it again, deleted and re-downloaded but still to no avail. Could someone from the support team please help? I'm supposedly meeting him today but with no number, location or time...", "rating": "3", "version": "1.10.11", "date": "2017-01-01T23:09:00-07:00", "title": "Help!"}, {"content": "Great", "rating": "5", "version": "1.10.11", "date": "2017-01-01T06:26:00-07:00", "title": "Great app"}, {"content": "Ok", "rating": "5", "version": "1.10.11", "date": "2016-12-31T15:03:00-07:00", "title": "Good"}, {"content": "Recently every time I open the app it won't load up. I have to delete it and download it again", "rating": "3", "version": "1.10.11", "date": "2016-12-31T00:18:00-07:00", "title": "Seems to have got worse"}, {"content": "It's been almost a year since I met my girlfriend on Bumble. Awesome app and I have it to thank for helping me find what seems to be the love of my life.", "rating": "5", "version": "1.10.11", "date": "2016-12-28T10:12:00-07:00", "title": "Update"}, {"content": "A very easy to use app though not met anyone yet but still going strong", "rating": "5", "version": "1.10.10", "date": "2016-12-27T16:52:00-07:00", "title": "Great app"}, {"content": "I like this app because there's no hidden charges, it's easy to use and the people you talk to on here aren't like most dating apps. They seem to be genuine people.", "rating": "5", "version": "1.10.10", "date": "2016-12-26T11:05:00-07:00", "title": "Nice and simple to use"}, {"content": "Simple and nice idea behind it.", "rating": "5", "version": "1.10.10", "date": "2016-12-23T11:20:00-07:00", "title": "Great."}, {"content": "Great app. \nNo hidden costs👍👍", "rating": "4", "version": "1.10.10", "date": "2016-12-22T21:35:00-07:00", "title": "Good"}, {"content": "It actually makes a difference how much I enjoy using this compared to other dating app.", "rating": "4", "version": "1.10.9", "date": "2016-12-19T05:56:00-07:00", "title": "Good UI"}, {"content": "Review 2: That weird logo disappeared after a while, so im pushing this back up to 5 stars. It's SO much better than Tinder - I've not had a single error with matches disappearing part way through conversations. \n\nWhere matches are a dime a dozen on Tinder, on here they are fewer, but always seem to lead to better conversation, better success and the \"no talking in 24hrs\" is great because if you're genuinely not interested, thats it.\n\nPutting the power in the hands of women doesn't make men lazy; it simply changes the nature of the game - for the better IMO.\n\nReview 1: Not a fan of the new Badoo logo across the photos. It's good otherwise though.", "rating": "5", "version": "1.10.9", "date": "2016-12-14T03:50:00-07:00", "title": "Good app, bad update"}, {"content": "Pretty good app", "rating": "5", "version": "1.10.9", "date": "2016-12-13T04:25:00-07:00", "title": "👌"}, {"content": "The best one i've used so far, Thanks Bumble!!", "rating": "5", "version": "1.10.9", "date": "2016-12-10T11:20:00-07:00", "title": "Great app!"}, {"content": "I'm real user and it is a good app .  It makes easier to be on the other side not contacting first as a male. Antonio", "rating": "5", "version": "1.10.9", "date": "2016-12-05T05:42:00-07:00", "title": "Good app"}, {"content": "THERE NEEDS TO BE SOME SORT OF BUMBLE AUTO SWIPER... Having to swipe right every 2 seconds is very annoying!!!", "rating": "2", "version": "1.10.8", "date": "2016-12-04T09:05:00-07:00", "title": "SWIPER"}, {"content": "Had it for a while as I liked the concept from a guys point of view, initially it was great lots of matches and seemingly good looking local people.Now after a bit of success for the developer, you get your matches held back on the 'bee line' which basically means pay us money to see who likes you. Furthermore lots of fake profiles added as I can tell some of these people definitely don't live by me.Shame il be deleting this as it had potential but don't trust companies who fleece their customers as soon as they can.", "rating": "2", "version": "1.10.8", "date": "2016-12-01T18:56:00-07:00", "title": "A lot of change not worth it"}, {"content": "I get the idea behind the app which is why I downloaded it! But the unfortunate fact of the matter is I've got like 1 match in the month I've had it and she didn't even message me! Not worth downloading lads", "rating": "1", "version": "1.10.8", "date": "2016-11-30T11:11:00-07:00", "title": "Terrible App"}, {"content": "I tried out the verification thing, it accepted my pic within a minute. It didn't add a verified badge to profile, so what's the point of it?", "rating": "1", "version": "1.10.8", "date": "2016-11-29T01:44:00-07:00", "title": "So much for verification pic"}, {"content": "These Apps are dying their death, and perhaps rightfully so. However what this means in simple practical terms is that most the profiles are dormant or just fake! A total waste of time downloading, especially for boys. Go out chat to and meet real people, you'll have a far better time!", "rating": "1", "version": "1.10.7", "date": "2016-11-27T01:39:00-07:00", "title": "DON'T DOWNLOAD - FAKE & DEAD PROFILES"}, {"content": "Don't bother, 90% of users either deleted it for a better app or are simply fake", "rating": "1", "version": "1.10.7", "date": "2016-11-25T05:14:00-07:00", "title": "Fake"}, {"content": "Good app - but it's very hard to tell whether you've sent the last message or the other person has. There needs to be something that differentiates between the two.", "rating": "3", "version": "1.10.7", "date": "2016-11-24T04:08:00-07:00", "title": "Frustrating"}, {"content": "So I have friends who have deleted their accounts at yet they still come up! You need to make a last active feature to stop wasting people's time. I'm getting hardly any matching and starting to wonder if they are all old un used accounts hmmmm", "rating": "2", "version": "1.10.7", "date": "2016-11-23T14:11:00-07:00", "title": "A little misleading"}, {"content": "No.", "rating": "1", "version": "1.10.7", "date": "2016-11-21T15:49:00-07:00", "title": "Facebook Only"}, {"content": "Finally a dating app that really does its job!!!", "rating": "5", "version": "1.10.7", "date": "2016-11-19T16:31:00-07:00", "title": "The best"}, {"content": "Easy to use and great!", "rating": "5", "version": "1.10.7", "date": "2016-11-18T17:45:00-07:00", "title": "Great"}, {"content": "Best app ever.Big like !!!!", "rating": "5", "version": "1.10.7", "date": "2016-11-17T11:14:00-07:00", "title": "Idanwalli"}, {"content": "So much better than Tinder. And has quality people.", "rating": "5", "version": "1.10.6", "date": "2016-11-15T22:07:00-07:00", "title": "It's a great dating app"}, {"content": "Such a classier way of meeting guys online and really makes you feel like youre in control of your own game! Been a great success so far and would definitely recommend", "rating": "5", "version": "1.10.6", "date": "2016-11-13T15:15:00-07:00", "title": "Bumble Bumble Bumble"}, {"content": "The bumble bff option should be a staple app for any student that's especially if you've just moved out. It's so easy to find like minded people that you may never have had the opportunity to meet! ⭐️⭐️⭐️⭐️⭐️", "rating": "5", "version": "1.10.6", "date": "2016-11-13T14:17:00-07:00", "title": "Bumble BFF"}, {"content": "Absolutely love this app, recommended by a friend in the US and haven't stopped using since!! 🐝💛🐝 Love the BFF version as well, girl power!", "rating": "5", "version": "1.10.6", "date": "2016-11-13T13:50:00-07:00", "title": "Bumble is buzzin"}, {"content": "Love this app. Perfect for looking for other singles or even a friend if you've moved to a new area. Would highly recommend.", "rating": "5", "version": "1.10.6", "date": "2016-11-13T13:38:00-07:00", "title": "5 star app"}, {"content": "Recommend this 👌🏼👌🏼", "rating": "5", "version": "1.10.6", "date": "2016-11-13T11:33:00-07:00", "title": "Great app!"}, {"content": "Perfect for meeting new people, this is a must try app!", "rating": "5", "version": "1.10.6", "date": "2016-11-13T11:18:00-07:00", "title": "Great app! BUMBLE BFF ❤️"}, {"content": "Great app!!", "rating": "5", "version": "1.10.6", "date": "2016-11-13T09:56:00-07:00", "title": "Bumble"}, {"content": "Such a great way to meet new people !!! Made lots of friends through using bumble BFF and will definitely carry on using it. It's great 😊😊😊", "rating": "5", "version": "1.10.6", "date": "2016-11-13T09:01:00-07:00", "title": "Bumble BFF"}, {"content": "Had such a laugh meeting guys on here (they're all so good looking 😍😍) but Bumble BFF is what really sets this apart from other dating apps! Literally no need to use Tinder anymore, and it's so nice to meet so many new people! Would highly recommend", "rating": "5", "version": "1.10.6", "date": "2016-11-13T06:29:00-07:00", "title": "Bumble BFF!!"}, {"content": "Bumble BFF is great fun! Especially when you're new to an area and just want someone to show you around and to help you meet new people!", "rating": "5", "version": "1.10.6", "date": "2016-11-13T02:25:00-07:00", "title": "Bumble BFF👭"}, {"content": "Bumble is great for meeting people! I have recommended to all my friends and we're all loving it!! Get it!", "rating": "5", "version": "1.10.6", "date": "2016-11-12T04:37:00-07:00", "title": "Bumble bff is awesome"}, {"content": "The problem with this app is that it doesn't matter who you swipe right to, because once you do, you go right to the bottom of their stack, which means it can take day, weeks or they might not even ever see you. It should move you up the stack if you're nearby or share interests, but it clearly doesn't.", "rating": "1", "version": "1.10.6", "date": "2016-11-12T01:31:00-07:00", "title": "Questionable users"}, {"content": "I like the fact that people have to respond quickly to encourage people to talk. However, loading the app can take hours and if you are talking to someone you can miss out because the loading is ridiculous and only seems to load once a day. Sort it out.", "rating": "3", "version": "1.10.6", "date": "2016-11-12T00:57:00-07:00", "title": "Not bad but terrible loading"}, {"content": "It takes a lot of dedication and it makes me feel like I'm being coached by a robot.", "rating": "3", "version": "1.10.6", "date": "2016-11-12T00:46:00-07:00", "title": "Pt"}, {"content": "Bumble is just a better version of tinder and Bumble BFF is a great feature 🐝❤️", "rating": "5", "version": "1.10.6", "date": "2016-11-11T09:23:00-07:00", "title": "Mr Joe van Rietschoten"}, {"content": "I seriously recommend this app! I've met some great people on bumble as well as the bumble bff feature! Really fun and sociable and so easy to use! Way better than tinder! 🐝🐝🐝🐝", "rating": "5", "version": "1.10.6", "date": "2016-11-11T07:39:00-07:00", "title": "BUMBLE is great!"}, {"content": "My friend deleted her profile and my other friends recently saw it still on the app.\n\nConfirmed that they don't deactivate your account and/or use your profile to make it look like there's more active users or more hot girls.\n\nWaste of time and breaching privacy laws.", "rating": "1", "version": "1.10.6", "date": "2016-11-11T03:18:00-07:00", "title": "Liars"}, {"content": "I'm not single but I love using bumble BFF! It's a great way to meet people and I love being about to talk first. Fab app I'd recommend to anyone ✅", "rating": "5", "version": "1.10.6", "date": "2016-11-10T06:42:00-07:00", "title": "Bumble BFF!"}, {"content": "Really easy to use and gives the girl the control. I've met some great guys on here and would definitely recommend. BFF mode is also an excellent way to make friends in a new city.", "rating": "5", "version": "1.10.6", "date": "2016-11-09T10:00:00-07:00", "title": "Great App + BFF mode"}, {"content": "Girls have to write first. Girls never write first. So as a guy you get 24hrs to look at your match before she disappears. Pretty much everyone on there is on tinder anyway, so just use that.", "rating": "1", "version": "1.10.6", "date": "2016-11-09T05:34:00-07:00", "title": "Just use tinder"}, {"content": "I've been on this app for a long time now, and all I can say is that it keeps on getting better! \n\nMiles better than any other dating app on the market (and I've tried just about all of them). Makes girls message first, which for me means - no harassment, I'm guaranteed that the guys will actually message me, and it's kind of empowering :) from what my guys friends have said they've found they get no bots and the girls they match will actually speak to them rather than ignore! Win win I think!\n\nAlso I've just started using the Bumble bff option, which I've found great as someone new to London - since I don't know that many people it's a great way to make new girlfriends and expand a social circle! \n\nKeep up the amazing work Bumble 😊", "rating": "5", "version": "1.10.6", "date": "2016-11-08T10:50:00-07:00", "title": "The best dating app ever!"}, {"content": "Used this app for over a week now. I'm not a bad looking guy - tall, good build - but haven't had a single match in my area. I'll get plenty of matches on tinder but nothing here. The app is either full of fake profiles or girls who no longer use it.", "rating": "1", "version": "1.10.6", "date": "2016-11-08T09:18:00-07:00", "title": "Pointless"}, {"content": "May not work for everyone but I've had some good dates from it and, for free, it's certainly worth a punt.", "rating": "5", "version": "1.10.4", "date": "2016-11-07T16:12:00-07:00", "title": "Very good app"}, {"content": "Bumble and Bumble BFF is a great way to meet people and make friends! I've had great experiences with it! The app is innovative and easy to use - hardly has any bugs! I would highly recommend!", "rating": "5", "version": "1.10.4", "date": "2016-11-07T16:09:00-07:00", "title": "Fantastic!"}, {"content": "Loving bumble bff!! Great for making new connections", "rating": "5", "version": "1.10.4", "date": "2016-11-07T15:29:00-07:00", "title": "Download!!"}, {"content": "It's so nice to be able to meet other girls to make friends with and chat to, a really cool concept :)", "rating": "5", "version": "1.10.4", "date": "2016-11-07T11:43:00-07:00", "title": "Bumble BFF is super fun"}, {"content": "Fab idea if you're moving into a new place and want to meet and make new friends! Great tool for seeing what potential new friends are in your area. Would recommend to a friend and it's a great new, innovative way of meeting people!", "rating": "5", "version": "1.10.4", "date": "2016-11-07T09:59:00-07:00", "title": "Bumble BFF"}, {"content": "Love it. 🙋🏼", "rating": "5", "version": "1.10.4", "date": "2016-11-07T09:03:00-07:00", "title": "Excellent app!"}, {"content": "Bumble is the best for finding a date but without being harassed by creepy men ah!! I love having the control to message first and the time pressure is great! Big thumbs up to bumble", "rating": "5", "version": "1.10.4", "date": "2016-11-07T07:42:00-07:00", "title": "Love the control"}, {"content": "Not quite sure why exactly but bumble seems to have 'better quality' people on there :) really like this dating app - love that the girl has to message first", "rating": "5", "version": "1.10.4", "date": "2016-11-07T06:23:00-07:00", "title": "Seems to have hotter guys than other apps"}, {"content": "Love this app! It's so easy to use and the reminders to talk to your matches before the 24 hours are up are great - it's so easy to forget! (Also the caliber of men is so much higher than tinder). The BFF part is good too, can always find someone to go to the gym with!", "rating": "5", "version": "1.10.4", "date": "2016-11-07T03:59:00-07:00", "title": "Love it"}, {"content": "Cool . Better quality of profiles than most places", "rating": "5", "version": "1.10.4", "date": "2016-11-04T07:19:00-07:00", "title": "Kk"}, {"content": "It's ok no so bad but they need to leave men's as well to write not just woman first", "rating": "4", "version": "1.10.4", "date": "2016-11-01T10:33:00-07:00", "title": "Ok"}, {"content": "Every time you open this app the first lot of profiles are clearly models who I'm sure aren't on the app. They're obviously professional shots. Don't waste your time", "rating": "1", "version": "1.10.4", "date": "2016-10-25T12:52:00-07:00", "title": "Full of fakes"}, {"content": "This is a stupid app and they really haven't thought it through. Because women have to message first, men may as well just swipe right on every single woman and then just wait and see which women messages and then chose who want to reply to. This completely devalues the whole matching process as I'm sure a lot of people will do this and therefore women get tons of matches from men who may not be interested anyway. Hasn't it not even crossed their minds that this is what people will do?", "rating": "2", "version": "1.10.4", "date": "2016-10-24T20:29:00-07:00", "title": "Nice idea but"}, {"content": "Bumble will get you what you want...either laid or a relationship. Like a more upscale version of Tinder. The premise of girls talking first is pretty genius. The chat interface is somewhat clunky but considering what you get for a free account it's a small gripe. Overall a strong, well-thought out dating app.", "rating": "4", "version": "1.10.4", "date": "2016-10-20T22:09:00-07:00", "title": "Awesome viral app"}, {"content": "Waste of time and flawed design.", "rating": "1", "version": "1.10.4", "date": "2016-10-19T03:00:00-07:00", "title": "Clearly created by feminists."}, {"content": "I've found someone else much much better", "rating": "1", "version": "1.10.3", "date": "2016-10-16T16:08:00-07:00", "title": "Goodbye Bumble"}, {"content": "Wp", "rating": "5", "version": "1.10.3", "date": "2016-10-12T10:49:00-07:00", "title": "Seems better than tinder."}, {"content": "Fills up storage with hundreds of cached images, never clears them. Was using almost a gigabyte of storage after a weeks use. Can you guys prune your image cache at some point?", "rating": "3", "version": "1.10.3", "date": "2016-10-12T08:56:00-07:00", "title": "Decent app, Broken image cache"}, {"content": "Too pushy, very buggy and overall didn't work for me.", "rating": "1", "version": "1.10.3", "date": "2016-10-11T13:20:00-07:00", "title": "Absolute garbage!"}, {"content": "I absolutely loved this dating app, it's so easy to use and I chatted to and met up with some really lovely men - much higher quality people than on Tinder! I am pleased to say that both myself and my work colleague have met our now boyfriends using the app, would thoroughly recommend!", "rating": "5", "version": "1.10.3", "date": "2016-10-10T09:59:00-07:00", "title": "Awesome app!"}, {"content": "Pretty good", "rating": "4", "version": "1.10.3", "date": "2016-10-09T08:11:00-07:00", "title": "Marc"}, {"content": "So fun to use - easy, exciting and gives the power to roam free with out hassle or worry", "rating": "5", "version": "1.10.3", "date": "2016-10-09T06:55:00-07:00", "title": "Bumble changes the face of dating"}, {"content": "I just updated my profile and ten minutes later received a message to say my profile had been \"moderated\". I click on the link and my profile has been deleted as apparently there was nudity... Literally there were 6 pictures of my face. So if we can't upload pictures of our face then what are we supposed to do?", "rating": "1", "version": "1.10.3", "date": "2016-10-08T10:41:00-07:00", "title": "Profile deleted without warning"}, {"content": "fun, easy to use, beautiful layout, the best way to meet new people near me. So good I even deleted tinder!", "rating": "5", "version": "1.10.3", "date": "2016-10-06T07:03:00-07:00", "title": "Best dating app around!"}, {"content": "I prefer it to Tinder, yet it's very similar. The women text first premise means I don't have to waste energy writing ignored messages. I got laid with it so HURRAAHHHH!", "rating": "4", "version": "1.10.3", "date": "2016-10-06T00:57:00-07:00", "title": "Pretty good - not a wasted message if you're a man"}, {"content": "Bumble is an innovative idea, and so much fun. Really helpful when in a new area and such an easy app to use!", "rating": "5", "version": "1.10.3", "date": "2016-10-04T05:36:00-07:00", "title": "Great"}, {"content": "Just moved to a new city with my boyfriend and heard about this dating app which also had a friends section ... One thing led to another and now I've got a solid group of girlfriends!!", "rating": "5", "version": "1.10.3", "date": "2016-10-03T23:41:00-07:00", "title": "Great for girlfriends!"}, {"content": "Matched a few girls, but they never message, guess this is just another way to fill their ego.", "rating": "1", "version": "1.10.3", "date": "2016-10-03T23:29:00-07:00", "title": "Time wasted"}, {"content": "Super amazing app and easy to use, not only find love but find friends!! Love how girls make the first move- no more dodgy pick up lines!!", "rating": "5", "version": "1.10.3", "date": "2016-10-03T13:27:00-07:00", "title": "Fantastic app!!"}, {"content": "This is a great app - stable and bug free, nicely designed and with some neat additions to the standard dating app format (e.g. Deadlines so you have to communicate immediately). However... No matches for me!?? Not so popular after all :( I'm very sad about this and must blame on bumble algorithm due to being in denial.", "rating": "5", "version": "1.10.3", "date": "2016-09-29T08:24:00-07:00", "title": "Great app but no matches. Wtf?"}, {"content": "Good stuff", "rating": "4", "version": "1.10.3", "date": "2016-09-28T15:32:00-07:00", "title": "Nice"}, {"content": "Is easy to find with bumble", "rating": "5", "version": "1.10.3", "date": "2016-09-28T06:49:00-07:00", "title": "Love"}, {"content": "So many beautiful girls in one place and they have to make the first move, so no more creepy ice breakers!", "rating": "5", "version": "1.10.3", "date": "2016-09-26T14:21:00-07:00", "title": "Refreshing"}, {"content": "The app is easy to use and the interface is good. Downsides are it seems to connect with girls who I definitely haven't swiped right on. As a guy you do question its use when it's almost exactly the same as Tinder yet you can't initiate conversation - might as well just use as an app that you have more control/ability to message…", "rating": "2", "version": "1.10.3", "date": "2016-09-26T01:40:00-07:00", "title": "Good idea for women, bit pointless for men"}, {"content": "Doesn't work. \nAll they want you to do is pay money to make it work. \nGarbage!", "rating": "1", "version": "1.10.3", "date": "2016-09-25T17:31:00-07:00", "title": "Rubbish"}, {"content": "There's no point in having an app for people to just like each other and not communicate. \nPlus it's left down to the woman to make the first move, then be annoyed because she doesn't get a reply back. Pointless! \nCertainly not worth parting with your cash for.", "rating": "1", "version": "1.10.3", "date": "2016-09-22T01:17:00-07:00", "title": "Pointless"}, {"content": "I keep being kicked out the app and when I try to log in with my Facebook credentials I'm left hanging. Rubbish!", "rating": "1", "version": "1.10.3", "date": "2016-09-20T23:45:00-07:00", "title": "Facebook log-in broken"}, {"content": "A really great way of making new connections!!", "rating": "5", "version": "1.10.3", "date": "2016-09-18T12:21:00-07:00", "title": "Great App!!!"}, {"content": "Keeps logging me off and sometimes asking me to put another pic. Annoying interference especially if my existing pic is not offensive or rude. Dump this app", "rating": "1", "version": "1.10.3", "date": "2016-09-15T12:47:00-07:00", "title": "Crap app"}, {"content": "Stay away from update, could not see any conversations, pending matches, and pending discussions.  Then reinstalled app and lost everything.", "rating": "1", "version": "1.10.3", "date": "2016-09-14T04:48:00-07:00", "title": "Poor update"}, {"content": "One day randomly deleted all my conversations/matches \nAnnoying.", "rating": "1", "version": "1.10.3", "date": "2016-09-14T04:40:00-07:00", "title": "Buggy"}, {"content": "Matches are few and far between, quality over quantity is important but is there a large enough user base?", "rating": "3", "version": "1.10.2", "date": "2016-09-11T07:32:00-07:00", "title": "Mostly good"}, {"content": "The app is so irritating - freezes all the time. Reinstall and try again is all the Helpdesk tell you. I've matched and chatted to a few people on there but now I'll probably not get back in to continue!", "rating": "1", "version": "1.10.2", "date": "2016-09-11T00:09:00-07:00", "title": "Constantly freezes"}, {"content": "I used to really like Bumble, but the new update which doesn't allow you to see who likes you (until you pay extra) makes no sense.  This app had great  potential but has lost me as a user after the last version update.", "rating": "1", "version": "1.10.2", "date": "2016-09-10T21:09:00-07:00", "title": "New version is disappointing"}, {"content": "What it says above. Paid for the Beeline subscription but doesn't work and no one replies when u email support. Thanks for taking my monies. 🍆", "rating": "1", "version": "1.10.2", "date": "2016-09-09T13:48:00-07:00", "title": "Beeline not working, customer support ignoring"}, {"content": "Bought boost but it's absolutely not working. Nothing happened other than the fee was charged. I can't use any feature.", "rating": "1", "version": "1.10.2", "date": "2016-09-08T00:04:00-07:00", "title": "Boost feature is a waste of money"}, {"content": "Better than tinder, but find me love quicker", "rating": "4", "version": "1.10.2", "date": "2016-09-07T15:39:00-07:00", "title": "High time"}, {"content": "An app based on the premise that women will message you first... What? Why not create an app where you draw blood from a stone next?", "rating": "1", "version": "1.10.2", "date": "2016-09-07T00:00:00-07:00", "title": "What were you thinking?"}, {"content": "The makers have filled the app with modelesque women in bikinis to try and make the app seem cool while the user base builds. But people aren't stupid and we see through it. The purpose is to empower women, yet creating fake scantly clad profiles does the opposite. SORT IT OIT BUMBLE.", "rating": "1", "version": "1.10.2", "date": "2016-09-06T20:23:00-07:00", "title": "BOTS BOTS AND MORE BOTS"}, {"content": "This will send male suicide through the roof", "rating": "1", "version": "1.10.2", "date": "2016-09-06T12:01:00-07:00", "title": "Losers"}, {"content": "Love the fact that the convo expires if either of you don't reply within 24hrs", "rating": "5", "version": "1.10.2", "date": "2016-09-02T07:47:00-07:00", "title": "Eliminates time-wasters"}, {"content": "Good :)", "rating": "4", "version": "1.10.2", "date": "2016-09-02T00:19:00-07:00", "title": "Review"}, {"content": "Works well", "rating": "5", "version": "1.10.2", "date": "2016-09-01T06:28:00-07:00", "title": "Too"}, {"content": "Best app ever - met my boyfriend on here and I adore him ❤️ thank you for giving women a level playing field ! X", "rating": "5", "version": "1.10.2", "date": "2016-09-01T05:48:00-07:00", "title": "Best app ever !!"}, {"content": "Used to like this app but since the update I now get to know that people have liked me but not be able to see who until I pay the subscription fee! And I can't remove these people from my 'expiring connections' either. Annoying!", "rating": "1", "version": "1.10.2", "date": "2016-09-01T05:28:00-07:00", "title": "Disappointing since the update"}, {"content": "Like the other reviews have pointed out, this is full of fake profiles.", "rating": "1", "version": "1.10.1", "date": "2016-08-27T16:18:00-07:00", "title": "If you could remove fake profiles, that'd be great"}, {"content": "I paid £7.99 for bumble boost and not once has it worked!\nThe servers are constantly down and ai've contacted them five times and not one solution has been suggested!\n\nDon't get this! Terrible app and even worse service.", "rating": "1", "version": "1.10.1", "date": "2016-08-27T11:51:00-07:00", "title": "Frustrating! Terrible!"}, {"content": "Photos are clear, young professional matches and easy functionality that has fun features like gifs. I like the fact that girls message first as it reduces the risk of creepy messages. All in all very happy and the only dating app I would recommend!", "rating": "5", "version": "1.10.1", "date": "2016-08-24T04:59:00-07:00", "title": "Best dating app!"}, {"content": "Best", "rating": "5", "version": "1.10.1", "date": "2016-08-23T12:00:00-07:00", "title": "Mr"}, {"content": "Still doesn't allow sign-in. Very poor app build quality. Do not buy!", "rating": "1", "version": "1.10.1", "date": "2016-08-22T14:00:00-07:00", "title": "Still full of glitches"}, {"content": "Still yet to see a real profile on here and never, ever had a match (look at all the reviews for past versions and you'll see it's the main theme!)\nTinder, BootyShake and even Badoo are all better bets than bumble", "rating": "1", "version": "1.10.1", "date": "2016-08-21T06:50:00-07:00", "title": "Fake reviews, fake profiles"}, {"content": "I paid and didn't get the extra features... Pointless to claim to the support team because they dont bother to get back", "rating": "1", "version": "1.10.1", "date": "2016-08-17T15:08:00-07:00", "title": "Dont pay"}, {"content": "I paid for the boost features, only to be prompted to pay again when I try to use them. No response from support either. Bee very wary about giving this buggy app your cash.", "rating": "1", "version": "1.10.1", "date": "2016-08-16T04:19:00-07:00", "title": "Stung!"}, {"content": "This version reflects the desire of the Bumble team to generate revenue rather than improving the app for users - it's just become too confusing. Blurred faces, faded profiles... Who needs or wants to \"learn\" a dating app.", "rating": "2", "version": "1.10.0", "date": "2016-08-15T15:22:00-07:00", "title": "Roll back to last version!"}, {"content": "Simply light and cool!", "rating": "5", "version": "1.10.0", "date": "2016-08-15T13:14:00-07:00", "title": "Amazing!"}, {"content": "Since when did you have to pay to see matches?? I'm sure only a month or so ago that was not the case!! Another app selling out. Uninstalling.", "rating": "1", "version": "1.10.0", "date": "2016-08-15T11:37:00-07:00", "title": "Changed for the worse"}, {"content": "Better quality of guy", "rating": "4", "version": "1.10.0", "date": "2016-08-15T09:53:00-07:00", "title": "Bumble dating app.....love it!"}, {"content": "Great idea & the app works well overall, sadly having swiped my way through loads of girls profiles (of which a lot seem very promising) barely a quarter of the matches I'd have got from tinder. I'd guess a lot of fake/old profiles sadly.", "rating": "3", "version": "1.10.0", "date": "2016-08-13T12:18:00-07:00", "title": "Just ok"}, {"content": "Bumble have now started sending out irritating random push alerts, such as 'It's cool to be kind' - nothing to do with the app at all!", "rating": "1", "version": "1.10.0", "date": "2016-08-10T04:33:00-07:00", "title": "Annoying push alerts"}, {"content": "The premise of this app is that when you match you know each other are interested - 3 days 10 matches 10 messages sent - no replies!\n\nOn a traditional dating app I hate to send the first message, took the plunge with this app, put myself out with my comfort zone, and now left questioning myself and attractiveness and even less likely to message first now, so yeah the 1 star was over generous!", "rating": "1", "version": "1.10.0", "date": "2016-08-09T03:54:00-07:00", "title": "Best app to make you feel unattractive"}, {"content": "It won't even let me sign in just keeps going onto the loading screen then back to the sign in screen. Useless!", "rating": "1", "version": "1.10.0", "date": "2016-08-09T01:13:00-07:00", "title": "Can't sign in"}, {"content": "Won't allow sign in!", "rating": "1", "version": "1.10.0", "date": "2016-08-09T00:55:00-07:00", "title": "Can't open app"}, {"content": "Think an update is required. Asking me to sign in and when I do the app crashes. Please sort it out.", "rating": "1", "version": "1.10.0", "date": "2016-08-09T00:40:00-07:00", "title": "Signing in"}, {"content": "Lot of glitches. Asks you to sign in again periodically.", "rating": "1", "version": "1.10.0", "date": "2016-08-07T23:48:00-07:00", "title": "Poor app"}, {"content": "I don't want people to know where I have worked. Nor could I put in my actual profession.", "rating": "1", "version": "1.10.0", "date": "2016-08-07T11:45:00-07:00", "title": "Can't connect other than FB"}, {"content": "Downloaded but had to delete because you have to have facebook. Why do you have to have facebook for some of these apps, I don't want and never will want it so won't have these apps.", "rating": "1", "version": "1.10.0", "date": "2016-08-07T11:13:00-07:00", "title": "Why?"}, {"content": "Really Good- at least you know the girls are interested. The all is also pretty solid, don't think it's crashed once yet", "rating": "4", "version": "1.10.0", "date": "2016-08-06T06:05:00-07:00", "title": "Really Good"}, {"content": "It's innovative and now the only app I use - find it easier when you match to start convos and less creeps are attracted to a feminist app! Great design and I enjoy it! Had way more dates via this than ANY other app.", "rating": "5", "version": "1.10.0", "date": "2016-08-05T06:36:00-07:00", "title": "Great innovative and safe feeling app"}, {"content": "The idea works to some extent, but it's slow to load profiles and message threads. Some way of demanding that people write something would be good.", "rating": "3", "version": "1.10.0", "date": "2016-08-03T14:19:00-07:00", "title": "Good but slow"}, {"content": "Much better than tinder - generally better quality guys to choose from and a little more interested in dating! Downside is that girls do have to say something first but for some of us that's standard practice :)", "rating": "4", "version": "1.9.8", "date": "2016-07-30T01:57:00-07:00", "title": "Best app for quality matches"}, {"content": "I do like the app. Just that matches don't actually message. I know it's up to them but why match if you don't want to know that person to make a clear decision?", "rating": "1", "version": "1.9.8", "date": "2016-07-24T21:19:00-07:00", "title": "Terrible"}, {"content": "The app is an app, but the women on it are great lookers! There have been no takers yet!", "rating": "5", "version": "1.9.6", "date": "2016-07-22T07:12:00-07:00", "title": "The women on this app are great lookers!!"}, {"content": "Love this app", "rating": "5", "version": "1.9.6", "date": "2016-07-14T14:00:00-07:00", "title": "Great"}, {"content": "Had this for about a week now, it's good, seems to work as I've had about 100 connections but it'd be nice to know exactly how many you have had, out of curiosity, something the developers could think about maybe? I know other similar apps do that and it'd be nice to see how many connections you make:)", "rating": "4", "version": "1.9.6", "date": "2016-07-05T01:36:00-07:00", "title": "Great! But maybe a connection count could be added!?:)"}, {"content": "As a female using the app, I get matches & after making the initial contact, get no response. I tend not to swipe on the overly obvious fake profiles (same pics used on 3 different profiles 😂 come on now!) but I wonder if there are ANY real men on it at all.\n\nI've had much better luck with the BFF function & made friends with 3 fab girls. So I suppose I'll just use this as a friendship making app instead! 😁", "rating": "3", "version": "1.9.6", "date": "2016-07-05T00:46:00-07:00", "title": "The BFF function is 👏🏽"}, {"content": "Ladies 1st I like the concept", "rating": "5", "version": "1.9.6", "date": "2016-07-04T04:44:00-07:00", "title": "Decent app"}, {"content": "This is so far one of my favourite dating apps at the moment. Easy to use and I like the way it puts women in control.", "rating": "4", "version": "1.9.6", "date": "2016-06-26T00:30:00-07:00", "title": "Bumbletastic"}, {"content": "Created an account from Facebook set up which was fine but when it came to swiping left/right I couldn't do either. A bug in the app meant it wouldn't let me select left or right.", "rating": "1", "version": "1.9.6", "date": "2016-06-25T14:15:00-07:00", "title": "Terrible"}, {"content": "I never ever ever get matched....\nI feel so much unloved right now *sad face*", "rating": "2", "version": "1.9.6", "date": "2016-06-22T03:04:00-07:00", "title": "Unloved....."}, {"content": "Crashed and won't re-load! Sort it out", "rating": "3", "version": "1.9.6", "date": "2016-06-18T11:53:00-07:00", "title": "Buggy!"}, {"content": "I've loved using this app. Had lots of matches, met up with one or two and would highly recommend it! Thanks Bumble!", "rating": "5", "version": "1.9.6", "date": "2016-06-17T15:04:00-07:00", "title": "A really nice way to meet people"}, {"content": "Great idea, works well. A bit annoying how the photos go out of aspect on the rectangular cards that you swipe. Will only get better as more people get it.", "rating": "4", "version": "1.9.6", "date": "2016-06-17T00:22:00-07:00", "title": "Good app"}, {"content": "The app is not bad but lots of fake profiles and the time limit it gives is outrageous. I go to work, go for food, have a social life, sleep. Bumble must think we live on this app. I'll online date for maybe 30 mins a week when I'm wanting to chill. I lose most my matches due to this ridiculous rule. So deleted the app which is a shame.", "rating": "2", "version": "1.9.5", "date": "2016-06-15T15:13:00-07:00", "title": "Why the time limit?!"}, {"content": "For an app that is free bumble is the best. Have used a few and the quality of people on bumble seem the highest. The matches are consistently high quality and regular and its pretty straight forward. The best app especially for us women as we get a say...... Finally.", "rating": "5", "version": "1.9.5", "date": "2016-06-15T00:40:00-07:00", "title": "Great App and it's FREE!!!!"}, {"content": "Good", "rating": "5", "version": "1.9.5", "date": "2016-06-13T13:15:00-07:00", "title": "Very good"}, {"content": "Great app, easy to use, interesting people. Recommend!", "rating": "5", "version": "1.9.5", "date": "2016-06-12T04:54:00-07:00", "title": "Great app"}, {"content": "Developers should be ashamed", "rating": "1", "version": "1.9.5", "date": "2016-06-11T15:08:00-07:00", "title": "Fake profiles"}, {"content": "This app forces you to login using Facebook.  I fail to understand why I have to install and create an account on another app to use this app.... Deleted", "rating": "1", "version": "1.9.5", "date": "2016-06-07T15:46:00-07:00", "title": "Forces use of Facebook"}, {"content": "Either I'm ugly or there's no birds on there", "rating": "2", "version": "1.9.5", "date": "2016-06-06T13:38:00-07:00", "title": "Can't tell"}, {"content": "Great concept but it's highly unlikely that the majority of the profiles are real.\nIt'd be a great app if they cleared out the fake profiles.", "rating": "2", "version": "1.9.5", "date": "2016-06-05T15:55:00-07:00", "title": "Seemingly riddled with fake profiles"}, {"content": "The quality of women is so much higher on here than on other sites I've tried. Which is probably why I've only had a couple of matches so far! Lol.", "rating": "5", "version": "1.9.5", "date": "2016-06-03T06:55:00-07:00", "title": "It's good but it's hard"}, {"content": "Contrary to lots of other comments, I have had lots of matches and conversations. The trouble is, the app is quite slow. I've used it on several different Internet connections and it's typically slow and freezes/times out. Also, not anywhere near the number of people on here as tinder.", "rating": "3", "version": "1.9.5", "date": "2016-05-31T17:47:00-07:00", "title": "Ok, but could be great"}, {"content": "This is my first ever app review. I thought I'd take the time out to write it because this app is awesome. It takes a little while to ramp up, but now like every other swipe right is a match. I've had it for about an hour and have over 50 matches. The best thing about it is having the women message you with witty and interesting opening lines. It's great.", "rating": "5", "version": "1.9.5", "date": "2016-05-31T15:01:00-07:00", "title": "Amazing app"}, {"content": "Not working, I've just come across someone I've already matched with. Don't think the messages are working properly either, after I introduce myself some automatically don't countdown as if the guy has already responded but they haven't. App updated needed for bug fixes.", "rating": "2", "version": "1.9.5", "date": "2016-05-31T11:43:00-07:00", "title": "Good until the update"}, {"content": "Love this app! Full of well educated and good looking guys 😍. Have met some really lovely people and several with long term potential. Love the premise of act immediately or disappear...cut right down on time wasters. God work Bumble! Keep it up!", "rating": "5", "version": "1.9.5", "date": "2016-05-27T15:16:00-07:00", "title": "Brilliant, innovative, full of hotties! ❤️"}, {"content": "Im a handsome man that gets asked out by girls in LA, yet I must have swiped right to over 800 girls. I only got 3 matches. It's statistically impossible. Lots of fake profiles to jazz up the app and get public attention. Fake fake fake app. - waste of time. Shame on the deceitful app owner.", "rating": "1", "version": "1.9.5", "date": "2016-05-26T21:05:00-07:00", "title": "Fake profiles - oldest trick in the book"}, {"content": "The app has been solid, it doesn't crash and helps me discover some amazing people in my city!", "rating": "5", "version": "1.9.5", "date": "2016-05-25T13:47:00-07:00", "title": "Pretty good experience so far"}, {"content": "Not too bad", "rating": "5", "version": "1.9.5", "date": "2016-05-25T10:46:00-07:00", "title": "Decent app"}, {"content": "I prefer Bumble to other dating apps - better layout, the rewind feature and the ladies go first.", "rating": "5", "version": "1.9.5", "date": "2016-05-23T14:53:00-07:00", "title": "Women in charge."}, {"content": "Won't even let me start a profile. Absolutely garbage!!!!", "rating": "1", "version": "1.9.5", "date": "2016-05-23T02:20:00-07:00", "title": "Garbage"}, {"content": "Well,\nI not really into web dating but I decided to have a shot since I'm in a new city and that woman have to talk for a change.\nThe thing is , the match rule make it difficult for people to meet and chat, profile disappear for no reasons.\nBut otherwise it's a good app, that's why I gave an average rating.", "rating": "3", "version": "1.9.5", "date": "2016-05-19T17:53:00-07:00", "title": "A bit weird"}, {"content": "You should be able to see who has swiped you right especially if you are women it's helps make the decision better, have made some interesting connections", "rating": "3", "version": "1.9.5", "date": "2016-05-18T11:19:00-07:00", "title": "Good first run"}, {"content": "Better calibre of matches here, seem more intelligent and less douche bag like! Had great connections, try it!!!", "rating": "4", "version": "1.9.5", "date": "2016-05-17T05:32:00-07:00", "title": "Best free dating app out there"}, {"content": "Only show men their matches - save everyone a LOT of time ! :)", "rating": "1", "version": "1.9.5", "date": "2016-05-15T00:54:00-07:00", "title": "Time wasted"}, {"content": "Easy and fun to use!", "rating": "5", "version": "1.9.5", "date": "2016-05-13T23:57:00-07:00", "title": "Fun app"}, {"content": "There seem to be people taking loads of time to write reviews on how the bumble app must be broken as they aren't getting matches - it works fine.", "rating": "5", "version": "1.9.5", "date": "2016-05-11T17:33:00-07:00", "title": "I don't think the app is broken..."}, {"content": "Like the shake back feature. \nIt's just like Tinder but a bit better", "rating": "4", "version": "1.9.5", "date": "2016-05-07T08:27:00-07:00", "title": "I like it. No complaints"}, {"content": "Would imagine this App would be great if anyone was actually using it! Seemingly Fake profiles \"manager\" \"director\" etc", "rating": "2", "version": "1.9.5", "date": "2016-05-07T02:16:00-07:00", "title": "Empty"}, {"content": "Because 350,000% of the profiles are fake, you're more than likely not going to match with anyone, meaning you're more than likely going to waste your time using this app. \n\nA word for the wise, spend your time eating chicken strips or something instead of using this app.", "rating": "1", "version": "1.9.5", "date": "2016-05-06T15:39:00-07:00", "title": "Bumble... Buzzzzzz without the 'bu'"}, {"content": "Great", "rating": "5", "version": "1.9.5", "date": "2016-05-04T03:32:00-07:00", "title": "Amazing app!!"}, {"content": "Swipe for hours and receive zero activity.", "rating": "2", "version": "1.9.5", "date": "2016-05-03T00:02:00-07:00", "title": "Decent app but a graveyard of inactive users"}, {"content": "Terrible app that doesn't work. I've got 850+ matches of Tinder and haven't had a single person swipe right to me in the two weeks I've had this app. Waste of time downloading it and filling in the bio. Don't download it", "rating": "1", "version": "1.9.5", "date": "2016-05-02T14:37:00-07:00", "title": "Bumble"}, {"content": "What's wrong with the good old username and password? I'd rather not have to connect up to a fb account", "rating": "1", "version": "1.9.5", "date": "2016-05-02T03:29:00-07:00", "title": "\"Sign in using Facebook\""}, {"content": "Really nice female friendly app. Less matches, but more quality.  Nice to be in control as a female, getting more responses than on any other dating app. Highly recommended.", "rating": "5", "version": "1.9.5", "date": "2016-05-01T15:38:00-07:00", "title": "Lovely, female friendly app"}, {"content": "widked", "rating": "5", "version": "1.9.4", "date": "2016-04-27T20:46:00-07:00", "title": "good"}, {"content": "Swiped over 200 people and have only had 2 matches. Others say the accounts are fake and I completely agree. The pictures are way to professional. Both matches never spoke and in comparison to tinder where I can get over 15 in a week bumble is rubbish. 2 matches in over a month.... I understand the app is classier but this is a joke. Great concept but is full if fakes", "rating": "1", "version": "1.9.4", "date": "2016-04-25T18:52:00-07:00", "title": "Full of fakes and no matches"}, {"content": "More of a dating app than just a hook up", "rating": "4", "version": "1.9.4", "date": "2016-04-25T00:19:00-07:00", "title": "Classy Tinder"}, {"content": "Don't have Facebook\n\nCan't use so deleted", "rating": "1", "version": "1.9.4", "date": "2016-04-22T14:18:00-07:00", "title": "Sign in with Facebook"}, {"content": "Nice gui", "rating": "5", "version": "1.9.4", "date": "2016-04-22T02:02:00-07:00", "title": "Good design"}, {"content": "... Better guys, better conversations ... Just better than tinder. You may come across the odd dude looking for a hook up. But that's online dating for ya", "rating": "4", "version": "1.9.4", "date": "2016-04-21T12:11:00-07:00", "title": "Better than tinder"}, {"content": "Good job", "rating": "5", "version": "1.9.3", "date": "2016-04-17T03:30:00-07:00", "title": "Good job"}, {"content": "Complete waste of time \nUtter rubbish \nScam after scam after scam \nWorse than lovoo", "rating": "1", "version": "1.9.3", "date": "2016-04-16T01:51:00-07:00", "title": "Utter rubbish"}, {"content": "I find that I will swipe on about 5 guys per day, maximum before 'running out'. The level of info people put on profiles is disappointing and makes it difficult to find a discussion starting point. The reply rate on here is pretty low but then maybe that's just for me! Tempted to delete but I like the idea.", "rating": "2", "version": "1.9.3", "date": "2016-04-14T17:03:00-07:00", "title": "Not enough users....yet?"}, {"content": "Love the new no \"ghosting\" feature. Make things a lot easier especially for us girl!!", "rating": "4", "version": "1.9.3", "date": "2016-04-14T00:38:00-07:00", "title": "Great fun. Great work. Great app!"}, {"content": "Reccomend", "rating": "5", "version": "1.9.3", "date": "2016-04-12T23:42:00-07:00", "title": "Great app , great people"}, {"content": "Since Facebook is basically just spam and adverts these days my account got deleted. And since you can't sign up to this without Facebook I'd say it's pretty poor and lazy app development.", "rating": "1", "version": "1.9.1", "date": "2016-04-12T01:12:00-07:00", "title": "No option to sign up without Facebook"}, {"content": "...for the unlucky 99% of men who are never to be spoken too. Good job ladies, you win again. Now you can have your cake - lots of likes to make you feel good about yourself, and never have to hear from any of those bloody men! Unless it's Burly Wealthy Hunk magazine's man of the year 2015.", "rating": "3", "version": "1.9.1", "date": "2016-04-07T20:02:00-07:00", "title": "Like Tinder, but without hope..."}, {"content": "Not bad, has huge potential.", "rating": "5", "version": "1.9.1", "date": "2016-04-07T14:49:00-07:00", "title": "Bumble"}, {"content": "Great", "rating": "5", "version": "1.9.1", "date": "2016-04-03T06:00:00-07:00", "title": "Great"}, {"content": "Average", "rating": "5", "version": "1.9.1", "date": "2016-03-30T14:23:00-07:00", "title": "Average"}, {"content": "The concept of the app is brilliant, however I noticed that when you get a Match no one wants to chat. Very disappointing", "rating": "5", "version": "1.9.1", "date": "2016-03-30T05:24:00-07:00", "title": "Brilliant concept"}, {"content": "Great app. I like that I don't have to start the conversation and the people I meet on the app are much more serious than on Tinder. However, it's very obvious that the app holds back matches.", "rating": "3", "version": "1.9.1", "date": "2016-03-28T15:10:00-07:00", "title": "Restricted by Devs"}, {"content": "Brilliant lay out and easy to use. Has a serious lack of men though. I only get to look at about 2 a day.", "rating": "4", "version": "1.9.1", "date": "2016-03-22T05:43:00-07:00", "title": "Easy to use"}, {"content": "Nice app- especially for girls who want to filter out creeps", "rating": "4", "version": "1.9.1", "date": "2016-03-22T04:50:00-07:00", "title": "Cool concept"}, {"content": "The interface is a lot smoother than other dating apps giving it a much more enjoyable feel", "rating": "5", "version": "1.9.1", "date": "2016-03-21T02:55:00-07:00", "title": "Great app"}, {"content": "Good", "rating": "5", "version": "1.9.1", "date": "2016-03-20T10:35:00-07:00", "title": "Good"}, {"content": "The app ask to upload photo but doesn't work.", "rating": "1", "version": "1.9.1", "date": "2016-03-20T10:17:00-07:00", "title": "Doesn't work"}, {"content": "Love bumble - great download - brilliant way to meet new interesting people & love the update amazing way to meet new friends when in different places 💘💘💘", "rating": "5", "version": "1.9.1", "date": "2016-03-19T06:03:00-07:00", "title": "Love bumble!"}, {"content": "The new BFF feature is so cool, I've even found some people round my uni and made some really great friends", "rating": "5", "version": "1.9.1", "date": "2016-03-18T08:17:00-07:00", "title": "New amazing features"}, {"content": "1 year on, my hypothesis remains correct: girls don't talk first.\n\nIf they did, Bumble would neither be creating fake profiles, showing me matches from different counties, nor notifying me that I don't use the app.\n\nDeleted. There are other apps.", "rating": "1", "version": "1.9.1", "date": "2016-03-18T01:51:00-07:00", "title": "Premise is Bunk"}, {"content": "I want to unlock", "rating": "5", "version": "1.9.1", "date": "2016-03-17T14:57:00-07:00", "title": "Vibee"}, {"content": "Have been using Bumble for a while now and the app is great- functional and quick, never crashes on my phone. Also the new BFF update is the best thing I've seen in a while, so useful for travelling or moving to a new city alone- couldn't recommend this more.", "rating": "5", "version": "1.9.1", "date": "2016-03-15T04:45:00-07:00", "title": "Awesome app!!"}, {"content": "Little slow moving app, but good potential.", "rating": "5", "version": "1.9.1", "date": "2016-03-14T13:14:00-07:00", "title": "Good app for ladies not looking harassed!"}, {"content": "Really enjoy using this to be fair, get a lot more real matches and no fake accounts. Less creepy people too!", "rating": "5", "version": "1.9.1", "date": "2016-03-14T08:03:00-07:00", "title": "Fantastic App"}, {"content": "I love it! Bumble really does breath a whole new life into mobile dating. The app runs smoothly and I never run out of potential matches, which is something that would happen often on other apps. Could not recommend highly enough, especially with the new BFF feature.", "rating": "5", "version": "1.9.1", "date": "2016-03-13T16:34:00-07:00", "title": "So refreshing!!"}, {"content": "This is the best app I have dowloaded since upgrading to my iPhone. It's so much better than tinder and happn and is a great idea. I have recommended it to all my friends and they love it as well. What a good app.", "rating": "5", "version": "1.9.1", "date": "2016-03-13T15:22:00-07:00", "title": "Great app. I love bumble"}, {"content": "Absolutely love bumble, made some great connections already. Would highly recommend it to those looking to meet new people!", "rating": "5", "version": "1.9.1", "date": "2016-03-13T13:31:00-07:00", "title": "Bumble all the wayy"}, {"content": "Very inventive! It's refreshing to see an app taking a new approach to the dating world. The combination of being able to find love interests as well as friendships is dynamic and exciting. Would highly recommend.", "rating": "5", "version": "1.9.1", "date": "2016-03-13T12:55:00-07:00", "title": "Two in one!"}, {"content": "Dear bumble, sometimes I see a profile and think my friend might be interested ... It'd be great if you could refer profiles to your friends.  Otherwise, good app.", "rating": "4", "version": "1.9.1", "date": "2016-03-13T11:33:00-07:00", "title": "Suggested upgrade"}, {"content": "This app is easy to use and has an amazing database of other users. The new feature is great for when moving to a new city or going travelling, when you want to find someone to explore with!", "rating": "4", "version": "1.9.1", "date": "2016-03-12T07:02:00-07:00", "title": "Great new feature"}, {"content": "I don't think half the people on this are real. Tend to get a choice of a bout 4 swipes before there's no one new around me. When you do match, responses are a rarity... Other swipe dating apps are far better", "rating": "1", "version": "1.9.1", "date": "2016-03-11T10:13:00-07:00", "title": "Matches are few and far between"}, {"content": "Simple interface. Looks great.", "rating": "5", "version": "1.9.1", "date": "2016-03-11T04:22:00-07:00", "title": "Simple."}, {"content": "Really liked the app, and how it gave girls the control. Also think the new addition of the BFF option made it different from other dating apps out there", "rating": "5", "version": "1.9.1", "date": "2016-03-11T03:26:00-07:00", "title": "BFF mode"}, {"content": "I was so excited for this!! The BFF mode is (sadly) everything I need right now, having moved to a new area with no one at work that's particularly \"friend material\". However this app has more bugs than I can count :( I can't seem to do literally anything. Please fix the bugs, once word gets out about this BFF feature I think this will be incredible (once more people get involved obviously) but I don't see many more people getting involved if the app stays this awful!", "rating": "2", "version": "1.9.1", "date": "2016-03-10T14:25:00-07:00", "title": "Good potential, but disappointing"}, {"content": "It's a great app - I'm always too lazy to message first - but I have had some great dates from here. It's slightly less intense than Tinder or Happn but still pretty accessible. However, there does seem to be some auto selections - I get matched with 2-3 people a day I definitely didn't swipe right on!", "rating": "3", "version": "1.9.0", "date": "2016-03-07T12:48:00-07:00", "title": "Good app. Slightly more civilised than tinder"}, {"content": "Finally found a dating app that has NORMAL guys on it who are at my uni and stops all the sleaziness of tinder 🎉🎉🐝🐝", "rating": "5", "version": "1.9.0", "date": "2016-03-06T08:10:00-07:00", "title": "Yes yes and yes"}, {"content": "Had loads of success on this app, really easy to meet loads of top people and with the new BFF option can meet and hang out with similar people…100% Class", "rating": "5", "version": "1.9.0", "date": "2016-03-05T07:48:00-07:00", "title": "Amazing App, BUMBLE FOREVER"}, {"content": "Amazing app, had real success on here and the new BFF option has helped me meet some really cool people to just hang out with! 100% classss", "rating": "5", "version": "1.9.0", "date": "2016-03-05T07:44:00-07:00", "title": "BFF"}, {"content": "Heard about bumble through one of my friends, such a great app with a very simple interface. Although it's slightly similar to other apps, it still feels fresh, different and with the girl only being able to initiate the conversation, I could see it getting very popular. Would highly recommend.", "rating": "5", "version": "1.9.0", "date": "2016-03-05T06:10:00-07:00", "title": "Great App!"}, {"content": "Fake profiles paid to chat to you once. Waste of time - use Tinder instead.", "rating": "1", "version": "1.9.0", "date": "2016-03-05T01:16:00-07:00", "title": "Uses paid fake profiles"}, {"content": "Love the app, like tinder but with a twist. I like how females have the control in the situation and don't get bombarded with creepy messages. Plus the talent is pretty good.", "rating": "5", "version": "1.8.0", "date": "2016-03-03T11:07:00-07:00", "title": "Looking for my honey"}, {"content": "An easy to use app with some very nice people on there.", "rating": "5", "version": "1.8.0", "date": "2016-03-03T04:56:00-07:00", "title": "Find your honey on Bumble"}, {"content": "Amazing talent but when you match they don't chat...nothing you can do about it!!!", "rating": "4", "version": "1.8.0", "date": "2016-03-01T13:59:00-07:00", "title": "Good but come on Ladies"}, {"content": "As everyone else has said it is full with fake accounts", "rating": "1", "version": "1.8.0", "date": "2016-02-28T17:27:00-07:00", "title": "Fake accounts"}, {"content": "Still not had a single response from anyone. When the girls are too good to be true, it's because they're not real! Stick with BootyShake and the others. At least the folks are real and online!", "rating": "1", "version": "1.8.0", "date": "2016-02-27T21:14:00-07:00", "title": "Fakesville"}, {"content": "Nothing new, it's just like tinder but worse (if that's possible)", "rating": "1", "version": "1.8.0", "date": "2016-02-27T08:31:00-07:00", "title": "Same old apps just repackaged"}, {"content": "Fake profiles, no responses. Waste of time.", "rating": "1", "version": "1.8.0", "date": "2016-02-27T08:27:00-07:00", "title": "Waste of time"}, {"content": "The app has clearly been populated with a large volume of fake accounts to give the appearance of a large user-base. Don't waste your time.", "rating": "1", "version": "1.8.0", "date": "2016-02-26T15:10:00-07:00", "title": "Populated with fake accounts"}, {"content": "It's a cool app, works smoothly, I would put a \"last online\" on your matches' profile so you actually know if your match is interested or not in starting a chat", "rating": "4", "version": "1.7.4", "date": "2016-02-26T01:00:00-07:00", "title": "Cool"}, {"content": "Cool app and great way of doing a dating app", "rating": "5", "version": "1.7.4", "date": "2016-02-19T06:19:00-07:00", "title": "Good"}, {"content": "Brill", "rating": "5", "version": "1.7.4", "date": "2016-02-18T14:28:00-07:00", "title": "Fab"}, {"content": "A great little app. Bumble seems to attract really nice people who take it all a little more seriously than other 'dating' apps. My only negative comment would be that it would be good to have a reminder when someone is going to time-out.", "rating": "5", "version": "1.7.4", "date": "2016-02-18T10:12:00-07:00", "title": "Superb"}, {"content": "Great concept and I like the look of the app. However once matches come along there are no replies. So either guys are being ignorant or the app is fake....", "rating": "3", "version": "1.7.4", "date": "2016-02-16T10:54:00-07:00", "title": "Good concept but poor outcome"}, {"content": "I'm guessing most the profile are fake, all the men seem to be from the same area and no one ever gets back to you. Nice idea but waste of time.", "rating": "1", "version": "1.7.4", "date": "2016-02-16T10:48:00-07:00", "title": "Shouldn't be so hard to find a match"}, {"content": "What about those of us without Facebook accounts - and before anyone gives me grief about not being on FB, I do have several very good reasons why I was but am now not.", "rating": "1", "version": "1.7.4", "date": "2016-02-15T11:50:00-07:00", "title": "Oi - idiots!"}, {"content": "Good to have the chance to make first move without seeming \"desperate\" we men love to say.", "rating": "5", "version": "1.7.4", "date": "2016-02-13T16:04:00-07:00", "title": "Good app"}, {"content": "1. If someone says 'hi', it says they have expired. \n2. All your photos suddenly disappear. You can't re-upload and it doesn't let you back in. \n\nWhy launch if it doesn't work??", "rating": "1", "version": "1.7.4", "date": "2016-02-11T12:35:00-07:00", "title": "So many bugs it's unusable"}, {"content": "Novel idea, to have the shoe on the other foot; however many women I match with seem overwhelmed by the burden of opening a conversation and just time out. I could see how this would be a frustration if individuals really took it seriously. I personally find it very cathartic to swipe through profiles. As eminent philosopher Jay Z once put it, \"(s)he who does not feel me is not real to me, therefore (s)he doesn't exist\"", "rating": "3", "version": "1.7.4", "date": "2016-02-11T11:45:00-07:00", "title": "Interesting (on paper) but cathartic"}, {"content": "Not even worth one star...", "rating": "1", "version": "1.7.4", "date": "2016-02-10T01:07:00-07:00", "title": "Don't download"}, {"content": "Lots of matches but no one starts to chat, so I assume it's a fake/scam.\nDon't download it", "rating": "1", "version": "1.7.4", "date": "2016-02-09T16:57:00-07:00", "title": "Fake and poor"}, {"content": "As a girl I find it refreshing that only guys I like can contact me. Been on here about a week and had maybe 3 or 4 guys message back, but no dates as yet.  Everyone seems to be basically inactive or probably fake which is a shame.  And I know I'm picky but have to keep widening my distance setting as I keep running out of people to swipe.  Also matches should last 48 hours, as sometimes I forget or I'm busy and then they're gone.", "rating": "1", "version": "1.7.3", "date": "2016-02-06T01:57:00-07:00", "title": "Great idea"}, {"content": "Been on here a good few weeks and not one match. I may not be the best looking guy but come on! Also all the women look like models so surely too good to be true!!", "rating": "1", "version": "1.7.3", "date": "2016-02-05T09:49:00-07:00", "title": "Too many fakes"}, {"content": "Once you're past the fakes (they come all at once when you start), this is a good app. Good to make the girls do the initial hellos for a change. \n\nUse about as often as tinder and had some good dates off it.", "rating": "4", "version": "1.7.3", "date": "2016-02-05T04:10:00-07:00", "title": "Get past the models"}, {"content": "But I don't think you'll ever meet anyone. The premise is flawed, we all know women really don't want to message first so if you do get any matches (unlikely) you almost certainly won't get a message! \nAlso as has been said I think a lot of the profiles might not even be real people.", "rating": "1", "version": "1.7.3", "date": "2016-02-05T00:07:00-07:00", "title": "Looks good but......."}, {"content": "Full of fake profiles. Without fail, every time you open the app, the first 20 profiles you see are all models, only after you have swiped past these 20 will you start to see genuine profiles. This morning in the last couple of minutes I have seen 2 fake ones who I know personally and who aren't on this app. Complete with correct name etc... Since I got this about a week ago, there's about a dozen I know personally who have never even heard of this app. All arrows point at the people who run it. Not every girl in London is a model. Try atleast be a bit more discreet with it Bumble if you're gonna go down this route. Atleast most of the the butters girls on Tinder are real", "rating": "1", "version": "1.7.3", "date": "2016-02-03T08:49:00-07:00", "title": "DONT GET THIS APP!!!!"}, {"content": "Don't know why there's so many bad reviews of this. I find it really easy to use, genuine people and WAY better than tinder.", "rating": "5", "version": "1.7.2", "date": "2016-02-03T05:39:00-07:00", "title": "Great app!"}, {"content": "You CANNOT upload pictures. What a waste of time and space. Instantly deleted.", "rating": "1", "version": "1.7.2", "date": "2016-02-03T04:46:00-07:00", "title": "Rubbish"}, {"content": "Usability is fundamentally flawed. Changing pictures is not immediately obvious and this shows when the app interface has 'Hint' copy set within it. An interface should be intuitive enough for the user to not need hints.", "rating": "1", "version": "1.7.2", "date": "2016-01-30T12:07:00-07:00", "title": "Bad usability"}, {"content": "Guys, I won't lie, you're going to have to up your game for Bumble. Simply sticking topless selfies won't cut it on here. Put some thought into your profile and the matches will come. I've spoken to plenty of girls on here. The difference is we have to wait for the girl to read our profiles and decide if she wants to write. If you're here for an ego boost then stick with Tinder in my view ...", "rating": "4", "version": "1.7.2", "date": "2016-01-28T12:10:00-07:00", "title": "Everyone has an opinion..."}, {"content": "So in terms of the app itself it works quite well, a reasonable amount of people and quite a few matches. The onus is on me to initiate a conversation, that's ok, it is 2016 after all. The problem is no one seems to reply for whatever reason. Maybe they're not interested after all or maybe it's because the notifications on this app are pretty poor? I rarely see badges on this app even though they are turned on. Ah well, time will tell.", "rating": "3", "version": "1.7.2", "date": "2016-01-28T05:15:00-07:00", "title": "Would be great if matches replied..."}, {"content": "The app nagged me incessantly to review it, so I have. One star for being an annoying @&*%", "rating": "1", "version": "1.7.2", "date": "2016-01-28T04:16:00-07:00", "title": "Lord Commander"}, {"content": "I'm gay so this loses its USP a little but the app works really smoothly, and the countdown to chat seems useful. It's a bit quiet in terms of users but hopefully that will pick up in the future", "rating": "4", "version": "1.7.2", "date": "2016-01-27T05:25:00-07:00", "title": "Pretty good app!"}, {"content": "I've had tinder and on a bad day I will swipe 100 women and match with at least 30+. \n\nOn bumble 99.9% of the profiles are fake as 95% of women in London are not Victoria secret models. Nor do they ever write back. \n\nJust to try I swiped 1000+ women without I looking and I matched with 5. \n\nThese five never wrote a word. \n\nRidiculous! If this company doesn't go bust in 6 months I will personally go hostile take over and make a parking lot of their office.", "rating": "1", "version": "1.7.2", "date": "2016-01-26T17:46:00-07:00", "title": "Worst app ever."}, {"content": "I've had three very awkward moments so far with Facebook friends, where they'd selected me. Including an ex. This is shocking. Besides that the app is much better than Tinder, because women feel more in control, and guys feel less inclined to write garbage thinking it'll impress them. I've had success with it, but the 1st connection Facebook friend thing really needs to be addressed", "rating": "3", "version": "1.7.2", "date": "2016-01-26T08:13:00-07:00", "title": "Keeps showing up Facebook friends!"}, {"content": "Sadly not enough uptake in my country try. \n\nI have about a 9% match rate on tinder. And the people have never ran out yet. On bumble I had swiped about 200 (60 mile radius) and not got a signed match. And I have ran out profiles.\n\nI'm not looking for one night stands or for true love. I'm after genuine connections, friendships and causal connections. I think I'm the majority of the target audience.\n\nIn short just not enough people, and not active enough. Needs more marketing.", "rating": "2", "version": "1.7.2", "date": "2016-01-23T09:30:00-07:00", "title": "Great concept hasn't got past early adopter stage"}, {"content": "Bumble is truly a terrible app\n\nFull ok fake profiles \n\nEven if you swipe for 5 months you get only 5 matches and none of them speak. \n\nYet the app has the audacity to send me messages telling me people are waiting for me to swipe. \n\nPathetic.", "rating": "1", "version": "1.7.2", "date": "2016-01-23T01:15:00-07:00", "title": "Bumbleisrubbish"}, {"content": "In line with others - suspect this has quite a few fake profiles.  Otherwise works well and harmless fun.", "rating": "2", "version": "1.7.2", "date": "2016-01-22T12:10:00-07:00", "title": "Got a match?"}, {"content": "Can't speak to how often people match - that's subjective - but what I observe is that positive matches do not initiate conversation. Much better rate of having a promising conversation on Tinder, Happn or most other dating apps.", "rating": "1", "version": "1.7.2", "date": "2016-01-21T16:25:00-07:00", "title": "Great idea but doesn't work"}, {"content": "Came here from DJ Khaled Snapchat🔑", "rating": "3", "version": "1.7.2", "date": "2016-01-21T14:56:00-07:00", "title": "Another One 🔑"}, {"content": "Loved the idea of this app, however matches are very rare. Maybe there just isn't that many people using the app. Of the matches I have had, not one has messaged me after. Pointless. Either the app or my profile, but very tedious! :(", "rating": "2", "version": "1.7.2", "date": "2016-01-21T12:19:00-07:00", "title": "Not that good to be honest!"}, {"content": "I like the concept of this app, has great potential however there are literally too many fake profiles, had this app longer than tinder and only got a few matches and even then they did not say anything probably fake profiles, you can also tell if they're fake as the photos look professionally taken.\n\nIn addition based on the very few matches and having like 99+% of all profiles shown, with next to nothing matches, demonstrates that this is clearly fake, statistically speaking I should have more matches as I've pretty much like everyone, good concept, needs a lot of work promoting it and removing fake profiles", "rating": "1", "version": "1.7.2", "date": "2016-01-21T09:19:00-07:00", "title": "Too many fakes"}, {"content": "Can't fault the app itself but I haven't had a single match and I'm not exactly a troll. You'd have more luck getting a date in a graveyard", "rating": "1", "version": "1.7.2", "date": "2016-01-19T11:20:00-07:00", "title": "Good app, cack service"}, {"content": "I didn't realise how many female directors there are in London and some of them only 29 years old 😂. On top of that Oxford university seems to be where a large quantity of these ladies studied😝\nHad several matches and surprise surprise the ladies haven't sent a message. Full of fake profiles which I suppose is giving the illusion the app is more popular than it really is. \n\nTo the founders: I realise the online dating world is competitive, but you're going to have to do better than that!", "rating": "1", "version": "1.7.2", "date": "2016-01-18T21:35:00-07:00", "title": "Crumble"}, {"content": "Great concept..... However lets get rid of the fake profiles please! Get plenty of matches however not a single person has replied! What a load of rubbish!", "rating": "1", "version": "1.7.2", "date": "2016-01-18T10:38:00-07:00", "title": "Don't bother...."}, {"content": "Not sure if it's a genuine app due to the lack of matches, or I might have bad selfies. Most likely the latter.", "rating": "2", "version": "1.7.2", "date": "2016-01-17T17:09:00-07:00", "title": "Indecisive"}, {"content": "I have used a few dating sites and this one is one of the better ones, I am male and I have had a few matches.\nIf you are use to tinder and have hundreds of matches be ready for a shock as you don't get that many on here if you are male.\nIf you are male and use this app you need thick skin be prepared to be turned down lots of times and when you do get a match hopefully she will send you a message within the 24-hour period.\nOtherwise you are back to swiping.", "rating": "4", "version": "1.7.2", "date": "2016-01-17T10:09:00-07:00", "title": "Not bad"}, {"content": "Best dating app as it's the most user friendly and allows you scan through in the fewest movents", "rating": "5", "version": "1.7.2", "date": "2016-01-17T07:02:00-07:00", "title": "Efficient"}, {"content": "I came to the review section to check whether I was the only one with lots of matches but no one ever replying to my messages. \nI'm sort of glad to find out I'm not the only one but that just leaves me thinking what a great deception this app is. Great concept, but nasty execution.", "rating": "1", "version": "1.7.0", "date": "2016-01-16T02:28:00-07:00", "title": "Fake accounts"}, {"content": "First six are always fake and the 7th not so attractive one is your match. Ruined", "rating": "1", "version": "1.7.0", "date": "2016-01-11T11:46:00-07:00", "title": "FAKE"}, {"content": "Dodgy app, not a single real person. Waste of time downloading don't bother \n\nRam Prakash", "rating": "1", "version": "1.7.0", "date": "2016-01-10T14:09:00-07:00", "title": "Fake profiles"}, {"content": "I like the concept of the app as for a change the emphasis is on the lady to message first. \nThe frustrating part is it only gives them 24hrs! \nThe notification side needs work as I don't check daily and have received messages but not seen them.", "rating": "4", "version": "1.7.0", "date": "2016-01-10T12:29:00-07:00", "title": "Still improving"}, {"content": "No point in getting this. There's been about one genuine girl I've seen on there. All the rest are fake.", "rating": "1", "version": "1.7.0", "date": "2016-01-10T10:40:00-07:00", "title": "Fake accounts. Fake accounts everywhere"}, {"content": "Almost impossible to get a match due to 'fake' or 'dead' accounts. Profiles appear but it's clear that there's no one really behind it and it's just a ploy to make the app look more populated.", "rating": "1", "version": "1.7.0", "date": "2016-01-09T15:56:00-07:00", "title": "Fake accounts"}, {"content": "As others have warned, this app is *full* of fake profiles.", "rating": "1", "version": "1.7.0", "date": "2016-01-09T11:12:00-07:00", "title": "Full of fake profiles"}, {"content": "For the first few weeks I was amazed by how good looking, intelligent and entrepreneurial all the guys on Bumble were...a way higher standard than Tinder etc. \n\nBut after getting loads of matches and initiating conversations with them, I realised they're almost all fake accounts to lure users in. I almost never get a reply (whereas on Tinder and Happn I have plenty of great conversations that often lead to dates). \n\nIt's a waste of time, and insulting that an app focused on empowering women should actually seek to deceive its users like this.", "rating": "1", "version": "1.7.0", "date": "2016-01-06T16:03:00-07:00", "title": "Full of fake accounts"}, {"content": "Bunch of fake accounts. Seriously guys, don't waste your time on this.", "rating": "1", "version": "1.7.0", "date": "2016-01-05T22:37:00-07:00", "title": "Fake"}, {"content": "Bare worldies", "rating": "5", "version": "1.7.0", "date": "2016-01-04T13:57:00-07:00", "title": "Not bad"}, {"content": "Girls have full control in this all. I'm a lad and I'm okay looking and I have literally one in 100 or 1 in 150 girls message.", "rating": "1", "version": "1.7.0", "date": "2016-01-04T10:55:00-07:00", "title": "No good for lads"}, {"content": "I'm highly suspicious that a lot of your accounts are not \"real\". Sure, I bet these people exist, but I don't for one second think they are genuine! A) high number of pictures are often too professional - let's face it, most of us mere mortals are rubbish photographers! b) a higher number of \"hotter\" people than peer apps b) mainly similar professions - business owners, lawyers and directors seem to be represented really well!! d) when I log into VIB there is a sudden change in \"personal\" to a more normal aura - I.e genuine accounts e) when tinder experienced a \"charge\" on new year days Bumble was as per normal! \n\nI am actually quite offended by this approach! It's smoke and mirrors! Do you think people are stupid! I understand you want to avoid having a lack of volume which will result with people losing interest, but this deceitful approach breaks any trust! This is basically the same as bars in Mayfair employing attractive young people to sit in their venues. I thought those business practices were behind, even more so for an app which is designed to empower women! 😂😂😂\n\nThe app is a good idea and works. Shame that management elected to deceive their customers though.", "rating": "1", "version": "1.7.0", "date": "2016-01-04T07:57:00-07:00", "title": "Fake accounts leave bitter taste"}, {"content": "I've recently re downloaded this app. No matches (after having loads previously) and run out of swipes after a day of use.", "rating": "1", "version": "1.7.0", "date": "2016-01-02T17:04:00-07:00", "title": "No matches this time"}, {"content": "I've got Tinder and all the others. Time this appears to bring up really hot girls, as in, model like 9/10+. I'm sorry, but when you get 20 of them in a row to flick through, it rings alarm bells.\n\nThere's an old saying - If something's too good to be true, it usually is!!", "rating": "1", "version": "1.7.0", "date": "2015-12-29T10:44:00-07:00", "title": "Possible fake profiles?"}, {"content": "It's a great concept, I love how it works. You can choose which guys you want to message, rather than having 100's of messages from randomers... Great! However, I found it really hard on the meeting side of it, to actually have a conversation with a guy that lasted more than a few messages. No one wants to reply? No idea why! Anyway, still a good app!", "rating": "3", "version": "1.7.0", "date": "2015-12-27T13:56:00-07:00", "title": "Still single...."}, {"content": "Many who I know are interested in finding long term partners including myself do not have or wish to have a Facebook account and this app requiring it really disappointed so deleted it!", "rating": "1", "version": "1.7.0", "date": "2015-12-27T11:18:00-07:00", "title": "Requires Facebook so only for mainstream"}, {"content": "I love the concept of this app, but there are so many bots! I noticed that I was saying yes to every girl as they were all stunning, so I decided to do an experiment. I raised the age range and found an 83 year old who looked 18...", "rating": "2", "version": "1.7.0", "date": "2015-12-27T10:21:00-07:00", "title": "So many bots!!"}, {"content": "Great to use and has very good potential. Just needs more users! I ran out of people within 30 miles of me after about 10 minutes altogether...", "rating": "4", "version": "1.7.0", "date": "2015-12-27T05:00:00-07:00", "title": "Needs more users!"}, {"content": "Most profiles seem to be randomly generated", "rating": "2", "version": "1.7.0", "date": "2015-12-27T02:00:00-07:00", "title": "Feels like a few fake profiles"}, {"content": "It's a great app! Shame I'm not a VIBee yet 😉", "rating": "5", "version": "1.7.0", "date": "2015-12-26T19:00:00-07:00", "title": "Fantastic App!"}, {"content": "It's okay, does what it says on the tin but could be better!", "rating": "3", "version": "1.7.0", "date": "2015-12-26T14:49:00-07:00", "title": "Meh it's okay!"}, {"content": "Ok app, but stacked full of fake profiles (which appear first) to lure you in. Developers obviously assume that the genuine user base are stupid.", "rating": "1", "version": "1.7.0", "date": "2015-12-24T11:32:00-07:00", "title": "Fake profiles"}, {"content": "Great app, works well and loads quickly. Nice people on it too...", "rating": "5", "version": "1.7.0", "date": "2015-12-20T03:11:00-07:00", "title": "Nice and honest"}, {"content": "Really enjoying using this so far, the calibre of guys is so good everyone I see is at least 8/10 would highly recommend!", "rating": "4", "version": "1.7.0", "date": "2015-12-19T16:17:00-07:00", "title": "Hothothot"}, {"content": "Breath of fresh air.  UX is just perfect!", "rating": "5", "version": "1.7.0", "date": "2015-12-18T23:57:00-07:00", "title": "Fantastic"}, {"content": "Best dating app I've ever used. Much classier. Connections are quality.", "rating": "5", "version": "1.7.0", "date": "2015-12-16T07:38:00-07:00", "title": "💜 Bumble"}, {"content": "Get on bumble.", "rating": "5", "version": "1.7.0", "date": "2015-12-14T09:05:00-07:00", "title": "Yaaaas bumble"}, {"content": "I can't get the app to work, I've not had a single match!", "rating": "1", "version": "1.7.0", "date": "2015-12-13T07:15:00-07:00", "title": "Doesn't work"}, {"content": "Love bumble, great talent, friendly and fun, it is by far the best dating app I've used!", "rating": "5", "version": "1.7.0", "date": "2015-12-10T05:39:00-07:00", "title": "Tinder who?"}, {"content": "I used Bumble for a couple of weeks and actually connected with a couple of nice people, but it's packed with fake profiles, and seems to be front-loaded with profiles of ludicrous white, tall, skinny blonde supermodels, seemingly lifted from other apps. Very strange. Nice idea but I can't recommend it.", "rating": "2", "version": "1.7.0", "date": "2015-12-08T17:24:00-07:00", "title": "Too many fake profiles"}, {"content": "Started off well. The concept of the app is good but it does make it difficult to make a connection. Even if you do find a match (had quite a few) couldn't even get a conversation going. Got bored quite quickly", "rating": "2", "version": "1.7.0", "date": "2015-12-08T14:27:00-07:00", "title": "Good not great"}, {"content": "So much easier to swipe right on this App as there is a much better selection of people. None of the seediness of Tinder. Would really recommend.", "rating": "5", "version": "1.7.0", "date": "2015-12-07T14:10:00-07:00", "title": "Great"}, {"content": "If you are male and use this app. Don't expect to get a single match. Used it for 3 months now, and still nothing. Don't waste the download.", "rating": "1", "version": "1.7.0", "date": "2015-12-06T17:48:00-07:00", "title": "Not a single match"}, {"content": "Cuba", "rating": "4", "version": "1.7.0", "date": "2015-12-06T14:08:00-07:00", "title": "Cool"}, {"content": "Looks like it could be a great pretty good app but it really doesn't have a big enough user base as there are about ten people within 100 miles of me", "rating": "3", "version": "1.7.0", "date": "2015-12-04T23:37:00-07:00", "title": "Standard"}, {"content": "Highly advised. Full of belters. No more 'full time mummies' or 'university of life' students or rotters. Everyone's 7.5/10+ and literate.", "rating": "5", "version": "1.7.0", "date": "2015-12-03T16:19:00-07:00", "title": "Game changer."}, {"content": "But needs more users", "rating": "5", "version": "1.7.0", "date": "2015-12-01T04:13:00-07:00", "title": "A classy tinder"}, {"content": "Lovely stuff", "rating": "5", "version": "1.6.4", "date": "2015-11-30T11:44:00-07:00", "title": "Lovely stuff"}, {"content": "Powerful", "rating": "5", "version": "1.6.4", "date": "2015-11-28T11:15:00-07:00", "title": "Mra"}, {"content": "The interface is good and it seems many times classier than tinder. However clearly many of the profiles are fake with professionally shot photos of models! It's also pretty quiet, which kind of ruins it. Would probably be better in bigger cities...", "rating": "3", "version": "1.6.4", "date": "2015-11-26T03:26:00-07:00", "title": "Not bad but probably not as good as people think."}, {"content": "A beautifully made app full of amazing people", "rating": "5", "version": "1.6.4", "date": "2015-11-24T12:58:00-07:00", "title": "Amazing"}, {"content": "A", "rating": "5", "version": "1.6.4", "date": "2015-11-23T12:51:00-07:00", "title": "A+"}, {"content": "Far too many professionally shot photos of highly successful people on this app which leads me to believe that a high proportion a fake; set up by the developers to draw you in. \nI remain to be convinced.", "rating": "2", "version": "1.6.4", "date": "2015-11-22T02:59:00-07:00", "title": "Remain Sceptical"}, {"content": "Lots of astonishingly beautiful ladies but very little interaction. Those that have connected haven't chatted so why bother? Perhaps I am not the target participant.", "rating": "3", "version": "1.6.4", "date": "2015-11-22T02:21:00-07:00", "title": "Beautiful but quiet"}, {"content": "I don't use Facebook!!  What happened to good old username and password?  Bleurgh... Waste of time", "rating": "1", "version": "1.6.4", "date": "2015-11-21T04:49:00-07:00", "title": "\"Sign in with Facebook\""}, {"content": "Good app!", "rating": "4", "version": "1.6.4", "date": "2015-11-20T15:49:00-07:00", "title": "Good app"}, {"content": "Whoever created bumble is a genius, free backtrack, no \"last online\" and quality people! Also great idea about ladies speaking first, limits the inappropriate messages we sometimes receive on other dating apps! Amazing!", "rating": "5", "version": "1.6.4", "date": "2015-11-19T06:13:00-07:00", "title": "Genius"}, {"content": "It's very easy to use but not a lot of users yet", "rating": "4", "version": "1.6.4", "date": "2015-11-14T16:23:00-07:00", "title": "Good app"}, {"content": "Being single has been anything but lonely with Bumble", "rating": "5", "version": "1.6.4", "date": "2015-11-14T13:53:00-07:00", "title": "Tinder is going down!"}, {"content": "...it feels more genuine than Tinder so it's good if you're taking the dating more seriously. If only more people would write something about themselves!", "rating": "4", "version": "1.6.4", "date": "2015-11-14T13:26:00-07:00", "title": "Only had one match yet, but..."}, {"content": "Need to sort out landscape vs portrait photos though. Landscape always zooms in to fill the page. Not good", "rating": "3", "version": "1.6.4", "date": "2015-11-14T06:20:00-07:00", "title": "Good"}, {"content": "Bumble seems to be like Tinder on steroids, much more user friendly, superior interface design and populated with very pretty girls!", "rating": "5", "version": "1.6.4", "date": "2015-11-14T01:47:00-07:00", "title": "Simple and easy to use"}, {"content": "It's not a bad app, it works just like the others pretty much!", "rating": "4", "version": "1.6.4", "date": "2015-11-12T16:26:00-07:00", "title": "Not bad.."}, {"content": "Found few very interesting people. Clicked with few, quite a nice mix of profiles. Quite different from generic scatter gun approach on other sites. More authentic, and profile with substance", "rating": "5", "version": "1.6.1", "date": "2015-11-12T02:58:00-07:00", "title": "Interesting people"}, {"content": "Actually wrote a blog post on this, but Bumble is the only dating app I'd recommend to others. Easy to use and I've had a few dates with people from there. Those that keep saying \"fake profiles\" maybe you need to amend your preferences...", "rating": "4", "version": "1.6.1", "date": "2015-11-11T10:35:00-07:00", "title": "Clears the creeps out"}, {"content": "Men like the chase, so I do wonder if men realise that woman have to speak first?\n\n I'm not sure there are fake profiles, it's all the same men on tinder, pof and the rest. I'm also not sure there are a lot of men out there who want relationships, more eager boosts. Some of these dating apps are like childhood swap cards I think. The men who have spoken to me on this site are looking for dirty pen pals. Someone should invent an app for that.", "rating": "1", "version": "1.6.1", "date": "2015-11-07T00:46:00-07:00", "title": "The flaw is in the premise"}, {"content": "I agree with previous reviews. About 80-90% of the girl profiles are fake profiles. Model shots, you will match with quite a few of them. They never talk to you, and if they do then they stop writing after 3 messages. Probably hired to chat to people. A lot of girl use this type of app to promote their Instagram as well, in hope to become famous...of course.", "rating": "1", "version": "1.6.1", "date": "2015-11-04T08:51:00-07:00", "title": "Full of Fake Profiles"}, {"content": "I would say 65-75% of the profiles of women (and men) on bumble are fake. The fake profiles have modeling shoot quality photos (clearly taken by a professional photographer, probably retouched). Then the job field lists them as something very bizarre, like corporate exec at a big company, when they say they are 23? Don't get me wrong, I'm not saying someone can't be beautiful and successful at a young age, it's that there are hundreds of these profiles, all of which just don't feel believable. Presumably the developer feels the need to pad out the numbers while it's still a growing app.", "rating": "3", "version": "1.6.1", "date": "2015-11-03T17:00:00-07:00", "title": "What's real is good, but not all of it is...."}, {"content": "I've had plenty of matches, but not one has figured out they need to start the conversation", "rating": "3", "version": "1.6.1", "date": "2015-11-02T01:32:00-07:00", "title": "The Women don't seem to realise THEY have to start the conversations"}, {"content": "...the standard is just so much higher! \nMaybe it's the fact the girls talk first, I'm not sure.\nAll I know is that the talent is a lot higher here than Tinder and Happn", "rating": "5", "version": "1.6.1", "date": "2015-11-01T01:48:00-07:00", "title": "Honestly...."}, {"content": "Unreal talent.", "rating": "5", "version": "1.6.1", "date": "2015-10-28T03:00:00-07:00", "title": "Top Dollar"}, {"content": "It's a refreshing take on dating apps. Cuts out a lot of wasted time messaging girls who weren't really interested in the first place", "rating": "5", "version": "1.6.1", "date": "2015-10-25T07:50:00-07:00", "title": "Interesting change to apps"}, {"content": "Doesn't seem to have the weirdos!", "rating": "5", "version": "1.6.1", "date": "2015-10-23T14:47:00-07:00", "title": "Best dating app"}, {"content": "Cake by the ocean!", "rating": "5", "version": "1.6.1", "date": "2015-10-21T14:50:00-07:00", "title": "Here because of Joe Jonas and DNCE"}, {"content": "Whilst initially pleased at the constant stream of photos of gorgeous men, you soon realise how many fake profiles there are. Disappointing.", "rating": "1", "version": "1.6.1", "date": "2015-10-19T04:33:00-07:00", "title": "Fake fake fake"}, {"content": "Are these birds bots? So banging", "rating": "5", "version": "1.6.1", "date": "2015-10-18T11:53:00-07:00", "title": "Brains"}, {"content": "Absolutely brilliant concept, but I've had bumble almost a week and haven't had even one match!\n\nA real shame as I was excited to try this out.", "rating": "1", "version": "1.5.3", "date": "2015-10-16T14:21:00-07:00", "title": "I can't tell if it's working!"}, {"content": "Can't do anything without Facebook... which I don't use. Should be listed first thing as a requirement in the description to not waste my time. Uninstalled faster than it took to install.", "rating": "1", "version": "1.5.3", "date": "2015-10-12T23:52:00-07:00", "title": "Requires Facebook"}, {"content": "Only lets me search 13-17 year olds so pretty useless!", "rating": "1", "version": "1.5.3", "date": "2015-10-12T22:57:00-07:00", "title": "Useless so far..."}, {"content": "Swipes do not register. There's no real app support. Deleting and reinstalling do not work. Some amazing looking people on the app- I'm beginning to think it's all fake. Remember these developers get access to your Facebook! Be warned...", "rating": "1", "version": "1.5.3", "date": "2015-10-11T13:08:00-07:00", "title": "Hopeless"}, {"content": "Amazing app concept, easy to use and UEX better than any other app. Not to mention the messaging section alone is probably better that whatsapp. However, I gave 3 stars because this latest version us a little buggy and some buttons have to be clicked 3/4 times before they work. Never experienced this on any other version on my 5s.\n\nFix it and I will give you 5 stars with laude", "rating": "3", "version": "1.5.3", "date": "2015-10-10T01:03:00-07:00", "title": "Absolutely in love but..."}, {"content": "It's really frustrating using this app because when connecting through Facebook they automatically generate your info and for some reason it puts my earliest info in my bio. So now everyone who reads my bio thinks I'm a 25 year old high school student. And you can't change it. We should be able to highlight the part of our fb bio that's most recent.", "rating": "2", "version": "1.5.3", "date": "2015-10-03T05:36:00-07:00", "title": "Generated profile misleading"}, {"content": "I only have the option of an age range of 13 - 17+. I'm 26 but should be given the option to match up with 13 year olds?!", "rating": "1", "version": "1.5.3", "date": "2015-10-01T15:47:00-07:00", "title": "Not for over 18s"}, {"content": "Love this app - feel safe and in control when using it. Thanks bumble", "rating": "5", "version": "1.5.2", "date": "2015-10-01T07:28:00-07:00", "title": "Great app"}, {"content": "Extremely limited, most ppl are miles away! Not impressed", "rating": "1", "version": "1.4.20", "date": "2015-09-18T14:45:00-07:00", "title": "Trying and failing to be the new tinder"}, {"content": "It's like a not very good version of Tinder. Rather than adding options like bootyshake does, this limits your match possibility and because of this it doesn't work at all for me", "rating": "1", "version": "1.4.20", "date": "2015-09-17T04:07:00-07:00", "title": "Empty Room"}, {"content": "Doesn't anyone else see anything wrong with the roles in this application? \n\nEmpowering, more like classism translated into gender.", "rating": "1", "version": "1.4.20", "date": "2015-08-31T06:31:00-07:00", "title": "V"}, {"content": "The app has become incredibly slow, I'm not even able to send feedback from within Bumble. \n\nGuys, fix this or I might need to go back to Tinder!", "rating": "1", "version": "1.4.1", "date": "2015-06-14T23:20:00-07:00", "title": "App SO slow"}, {"content": "Good but keeps reverting back to previous versions of  photos selected", "rating": "3", "version": "1.4.1", "date": "2015-06-10T11:06:00-07:00", "title": "Good but buggy"}, {"content": "If this were the other way around, there'd be a riot (and a lawsuit).", "rating": "1", "version": "1.4.0", "date": "2015-05-26T08:57:00-07:00", "title": "Sexist trash"}, {"content": "Except that even though I've set the app to show people within 25 miles, it's still showing me people from the other end of the country. So in short, it doesn't work.", "rating": "1", "version": "1.3.1", "date": "2015-04-14T17:42:00-07:00", "title": "Great idea..."}, {"content": "The First Review Of This App...And I Can Only DeScribe It As I Like Turtles", "rating": "5", "version": "1.3.1", "date": "2015-04-13T00:40:00-07:00", "title": "Opinion"}, {"content": "Despite the unprepossessing hue coating the background, I rather enjoyed myself on this application. It's about time the cyber female plucked up the courage to inaugurate coitus!", "rating": "5", "version": "1.3.0", "date": "2015-03-30T14:39:00-07:00", "title": "Bumblefluff"}, {"content": "After reading an article in this Septembers English edition of Elle magazine I came across one of the founders of tinder. Whitney Wolfe is the only female part of the original founders of tinder.\n\nHaving use the at myself for the last three months on and off I decided that I would use this new bumble app which was created by Whitney. The idea is to have a more female friendly environment where women do the pursuing.\nThis sounded more relaxed than Tinder where dies can be quite aggressive and assume every woman is a one night stand.\nNot to be arrogant but one of the benefits of tinder is that you don't have to be on the app for more than an hour before you have at least a handful of matches.\n\nI was on bumble for just about 24 hours and nothing not a single match, which has me thinking this is the allure  of tinder is.\n\nNot only do you get an opportunity to see the guys that potentially if you're very busy you wouldn't normally be able to meet or see but it serves as a bit of an ego boost, let's just be honest!\n\nBumble has the premise of the same thing as Tinder but with no matches it's very confusing to understand what the point of this app is. Reluctantly I am back to Tinder and since registry and again I already have three matches.\n\nSorry I won't be using bumble it's a pointless app!", "rating": "1", "version": "1.3.0", "date": "2015-03-25T12:48:00-07:00", "title": "Rubbish"}, {"content": "They have literally put stickers everywhere over bristol. All over my door. Not a way to advertise.", "rating": "1", "version": "1.3.0", "date": "2015-03-16T06:43:00-07:00", "title": "Vandals"}, {"content": "Left stickers all over Cotham in Bristol. Terrible adverts. Vandalism!! Clean it up!", "rating": "1", "version": "1.3.0", "date": "2015-03-14T03:53:00-07:00", "title": "Vandalism"}, {"content": "There should be a back button to return swipes you never wanted to reject.\nThis occasionally happens as when swiping up for a pick it rejects it instead. Really annoying", "rating": "3", "version": "1.2.1", "date": "2015-03-05T03:24:00-07:00", "title": "Updates"}, {"content": "I've heard good things, but can't test it for myself as the \"sign in using facebook\" button doesn't work.", "rating": "1", "version": "1.2.1", "date": "2015-03-04T09:56:00-07:00", "title": "Can't sign in :("}, {"content": "Too many of today's apps have people who just like to post a profile that tots up messages so that it boosts their ego about being wanted. \n\nAnd it's the 21st century now people. Guys doing all the leg work and putting themselves out there to be rejected belongs in the 50's.", "rating": "5", "version": "1.2.0", "date": "2015-02-15T08:10:00-07:00", "title": "A 21st century app"}, {"content": "The sign in with Facebook button doesn't work, so frustrating.", "rating": "1", "version": "1.2.0", "date": "2015-02-15T05:23:00-07:00", "title": "Useless"}, {"content": "Took 10 mins to go through all the people within a 50 mile radius but the concept and UI is great!", "rating": "5", "version": "1.2.0", "date": "2015-02-14T14:32:00-07:00", "title": "Just needs more people"}, {"content": "Why go live if the app isn't yet working !", "rating": "1", "version": "1.2.0", "date": "2015-02-08T09:32:00-07:00", "title": "Oh dear"}, {"content": "Met someone I've been dreaming of my whole life!", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:54:00-07:00", "title": "Thank you, Bumble!"}, {"content": "Way better than Tinder", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:54:00-07:00", "title": "Love it"}, {"content": "Empowers women, and gives us men a chance to kick back and give them control! :-P", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:54:00-07:00", "title": "Love the concept"}, {"content": "Much better, keep going", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:53:00-07:00", "title": "Cool update"}, {"content": "Really nice approach to make women feel safe. Really high quality users, joining all the time :)", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:50:00-07:00", "title": "Great app"}, {"content": "Won't work at all, can't even sign in with fb", "rating": "1", "version": "1.0.7", "date": "2014-12-20T16:17:00-07:00", "title": "Nope"}, {"content": "Apparently there isn't anyone in my area,pretty pointless so I take it this app needs an update", "rating": "1", "version": "1.0.7", "date": "2014-12-15T11:27:00-07:00", "title": "Doesn't work"}, {"content": "It would help if there was people in my area, apparently there is none. Kinda makes the app useless for me...had it a while now too", "rating": "3", "version": "1.04", "date": "2014-12-05T09:11:00-07:00", "title": "Unfortunate circumstances"}, {"content": "Referring to your heterosexual relationship rule - that the female must message the man in the first 24 hours or the connection is lost forever is offensive and sexist and I genuinely hope that your app bombs. You've copied Tinder and just made a really rubbish, discriminatory version. Good luck with that!", "rating": "1", "version": "1.04", "date": "2014-12-05T00:10:00-07:00", "title": "Sexist, offensive"}, {"content": "\"Sign in with Facebook\" button doesn't even work, can't even start the app.", "rating": "1", "version": "1.04", "date": "2014-12-04T12:14:00-07:00", "title": "Doesn't Work"}, {"content": "I only have the option of an age range of 13 - 17+. I'm 26 but should be given the option to match up with 13 year olds?!", "rating": "1", "version": "1.5.3", "date": "2015-10-01T15:47:00-07:00", "title": "Not for over 18s"}, {"content": "Love this app - feel safe and in control when using it. Thanks bumble", "rating": "5", "version": "1.5.2", "date": "2015-10-01T07:28:00-07:00", "title": "Great app"}, {"content": "Extremely limited, most ppl are miles away! Not impressed", "rating": "1", "version": "1.4.20", "date": "2015-09-18T14:45:00-07:00", "title": "Trying and failing to be the new tinder"}, {"content": "It's like a not very good version of Tinder. Rather than adding options like bootyshake does, this limits your match possibility and because of this it doesn't work at all for me", "rating": "1", "version": "1.4.20", "date": "2015-09-17T04:07:00-07:00", "title": "Empty Room"}, {"content": "Doesn't anyone else see anything wrong with the roles in this application? \n\nEmpowering, more like classism translated into gender.", "rating": "1", "version": "1.4.20", "date": "2015-08-31T06:31:00-07:00", "title": "V"}, {"content": "The app has become incredibly slow, I'm not even able to send feedback from within Bumble. \n\nGuys, fix this or I might need to go back to Tinder!", "rating": "1", "version": "1.4.1", "date": "2015-06-14T23:20:00-07:00", "title": "App SO slow"}, {"content": "Good but keeps reverting back to previous versions of  photos selected", "rating": "3", "version": "1.4.1", "date": "2015-06-10T11:06:00-07:00", "title": "Good but buggy"}, {"content": "If this were the other way around, there'd be a riot (and a lawsuit).", "rating": "1", "version": "1.4.0", "date": "2015-05-26T08:57:00-07:00", "title": "Sexist trash"}, {"content": "Except that even though I've set the app to show people within 25 miles, it's still showing me people from the other end of the country. So in short, it doesn't work.", "rating": "1", "version": "1.3.1", "date": "2015-04-14T17:42:00-07:00", "title": "Great idea..."}, {"content": "The First Review Of This App...And I Can Only DeScribe It As I Like Turtles", "rating": "5", "version": "1.3.1", "date": "2015-04-13T00:40:00-07:00", "title": "Opinion"}, {"content": "Despite the unprepossessing hue coating the background, I rather enjoyed myself on this application. It's about time the cyber female plucked up the courage to inaugurate coitus!", "rating": "5", "version": "1.3.0", "date": "2015-03-30T14:39:00-07:00", "title": "Bumblefluff"}, {"content": "After reading an article in this Septembers English edition of Elle magazine I came across one of the founders of tinder. Whitney Wolfe is the only female part of the original founders of tinder.\n\nHaving use the at myself for the last three months on and off I decided that I would use this new bumble app which was created by Whitney. The idea is to have a more female friendly environment where women do the pursuing.\nThis sounded more relaxed than Tinder where dies can be quite aggressive and assume every woman is a one night stand.\nNot to be arrogant but one of the benefits of tinder is that you don't have to be on the app for more than an hour before you have at least a handful of matches.\n\nI was on bumble for just about 24 hours and nothing not a single match, which has me thinking this is the allure  of tinder is.\n\nNot only do you get an opportunity to see the guys that potentially if you're very busy you wouldn't normally be able to meet or see but it serves as a bit of an ego boost, let's just be honest!\n\nBumble has the premise of the same thing as Tinder but with no matches it's very confusing to understand what the point of this app is. Reluctantly I am back to Tinder and since registry and again I already have three matches.\n\nSorry I won't be using bumble it's a pointless app!", "rating": "1", "version": "1.3.0", "date": "2015-03-25T12:48:00-07:00", "title": "Rubbish"}, {"content": "They have literally put stickers everywhere over bristol. All over my door. Not a way to advertise.", "rating": "1", "version": "1.3.0", "date": "2015-03-16T06:43:00-07:00", "title": "Vandals"}, {"content": "Left stickers all over Cotham in Bristol. Terrible adverts. Vandalism!! Clean it up!", "rating": "1", "version": "1.3.0", "date": "2015-03-14T03:53:00-07:00", "title": "Vandalism"}, {"content": "There should be a back button to return swipes you never wanted to reject.\nThis occasionally happens as when swiping up for a pick it rejects it instead. Really annoying", "rating": "3", "version": "1.2.1", "date": "2015-03-05T03:24:00-07:00", "title": "Updates"}, {"content": "I've heard good things, but can't test it for myself as the \"sign in using facebook\" button doesn't work.", "rating": "1", "version": "1.2.1", "date": "2015-03-04T09:56:00-07:00", "title": "Can't sign in :("}, {"content": "Too many of today's apps have people who just like to post a profile that tots up messages so that it boosts their ego about being wanted. \n\nAnd it's the 21st century now people. Guys doing all the leg work and putting themselves out there to be rejected belongs in the 50's.", "rating": "5", "version": "1.2.0", "date": "2015-02-15T08:10:00-07:00", "title": "A 21st century app"}, {"content": "The sign in with Facebook button doesn't work, so frustrating.", "rating": "1", "version": "1.2.0", "date": "2015-02-15T05:23:00-07:00", "title": "Useless"}, {"content": "Took 10 mins to go through all the people within a 50 mile radius but the concept and UI is great!", "rating": "5", "version": "1.2.0", "date": "2015-02-14T14:32:00-07:00", "title": "Just needs more people"}, {"content": "Why go live if the app isn't yet working !", "rating": "1", "version": "1.2.0", "date": "2015-02-08T09:32:00-07:00", "title": "Oh dear"}, {"content": "Met someone I've been dreaming of my whole life!", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:54:00-07:00", "title": "Thank you, Bumble!"}, {"content": "Way better than Tinder", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:54:00-07:00", "title": "Love it"}, {"content": "Empowers women, and gives us men a chance to kick back and give them control! :-P", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:54:00-07:00", "title": "Love the concept"}, {"content": "Much better, keep going", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:53:00-07:00", "title": "Cool update"}, {"content": "Really nice approach to make women feel safe. Really high quality users, joining all the time :)", "rating": "5", "version": "1.1.1", "date": "2015-01-07T02:50:00-07:00", "title": "Great app"}, {"content": "Won't work at all, can't even sign in with fb", "rating": "1", "version": "1.0.7", "date": "2014-12-20T16:17:00-07:00", "title": "Nope"}, {"content": "Apparently there isn't anyone in my area,pretty pointless so I take it this app needs an update", "rating": "1", "version": "1.0.7", "date": "2014-12-15T11:27:00-07:00", "title": "Doesn't work"}, {"content": "It would help if there was people in my area, apparently there is none. Kinda makes the app useless for me...had it a while now too", "rating": "3", "version": "1.04", "date": "2014-12-05T09:11:00-07:00", "title": "Unfortunate circumstances"}, {"content": "Referring to your heterosexual relationship rule - that the female must message the man in the first 24 hours or the connection is lost forever is offensive and sexist and I genuinely hope that your app bombs. You've copied Tinder and just made a really rubbish, discriminatory version. Good luck with that!", "rating": "1", "version": "1.04", "date": "2014-12-05T00:10:00-07:00", "title": "Sexist, offensive"}, {"content": "\"Sign in with Facebook\" button doesn't even work, can't even start the app.", "rating": "1", "version": "1.04", "date": "2014-12-04T12:14:00-07:00", "title": "Doesn't Work"}]}