{"data": [{"content": "I cannot believe this game is highly rated.  It's a cute interface and amuses for a while but after a few plays it's not all all engaging and just repeats.\n\nFor the price, it's shocking. In that bracket there are seriously great experiences to be had, even at 79p this would struggle to justify its cost.\n\nThe gameplay is very weak and I expect significantly more content for a £2.50 game.", "rating": "2", "version": "1.05", "date": "2017-01-22T00:24:00-07:00", "title": "Overpriced : 1hr entertainment"}, {"content": "I like the dynamics and it is very interesting", "rating": "5", "version": "1.05", "date": "2017-01-15T10:44:00-07:00", "title": "Good game"}, {"content": "Very intelligent game and super addictive. Totally recommended. 100% worth the money.", "rating": "5", "version": "1.05", "date": "2017-01-06T18:17:00-07:00", "title": "5 star"}, {"content": "Not fun in the slightest. Would like a refund, how're that is not possible.", "rating": "1", "version": "1.05", "date": "2017-01-01T09:50:00-07:00", "title": "Boring - Do not buy."}, {"content": "Needs an update, can get a bit same-ish after a while. Apart from that it's pretty good.", "rating": "4", "version": "1.05", "date": "2016-12-31T22:32:00-07:00", "title": "Not Bad!."}, {"content": "If this was released in the 80s it would have got poor reviews. One star for style.", "rating": "1", "version": "1.05", "date": "2016-12-29T01:40:00-07:00", "title": "Would have done badly on a c64"}, {"content": "I really like this game. Trying to balance out your different sections and trying to make right decisions makes it nicely challenging. However, I would really like there to be a gender choice, so that you can play as a queen too.", "rating": "5", "version": "1.05", "date": "2016-12-28T12:32:00-07:00", "title": "Great game"}, {"content": "A really good, innovative game that performs well and is worth 79p, but after a certain point there isn't much to do and gets boring as the game only lasts a week if you play regularly. Some improvement and it could be a great game?", "rating": "4", "version": "1.05", "date": "2016-12-28T10:39:00-07:00", "title": "Good but..."}, {"content": "A really fun, seemingly simple but deceptively complex game.", "rating": "5", "version": "1.05", "date": "2016-12-28T07:46:00-07:00", "title": "Nifty and fun"}, {"content": "Nice looking game but ultimately disappointing. Results are very random, I keep looking for a pattern, a way to win, but just when you think you are getting somewhere you suddenly die for some strange and random reason. Ok for 79p I guess. Can't understand how this can be a game of the year. 2016 must be a poor year for games!", "rating": "3", "version": "1.05", "date": "2016-12-26T00:40:00-07:00", "title": "Disappointing"}, {"content": "Perfect", "rating": "5", "version": "1.05", "date": "2016-12-25T19:11:00-07:00", "title": "Top"}, {"content": "It's a nice game to spend time on in car journeys and planes ect. There is lots of content and replay value and I can see it getting slot of cool updates in the future. It's a nice game 4/5", "rating": "4", "version": "1.05", "date": "2016-12-25T02:42:00-07:00", "title": "That's pretty gud"}, {"content": "This game is very enjoyable with a unique plot, characters and ideas. I was shocked to see so many negative reviews since this was one of the best ios games I had played in a while, and maybe the best ios 2016 game. Don't listen to negative reviews, this game is worth the money and is entertaining, fun and has days of playtime in it.", "rating": "5", "version": "1.05", "date": "2016-12-24T10:39:00-07:00", "title": "Amazing, original game, well worth the money"}, {"content": "Was expecting a really 'light' game. Loved the complexity and depth. Amazing", "rating": "5", "version": "1.05", "date": "2016-12-16T13:32:00-07:00", "title": "Great depth"}, {"content": "Doesn't believe the hype!", "rating": "1", "version": "1.05", "date": "2016-12-16T04:40:00-07:00", "title": "Sh!t"}, {"content": "Every time I open this app it just goes black and nothing happens", "rating": "1", "version": "1.05", "date": "2016-12-13T23:46:00-07:00", "title": "Won't open"}, {"content": "All round it's a bit sh!t tbh.", "rating": "2", "version": "1.05", "date": "2016-12-11T12:43:00-07:00", "title": "Disappointed"}, {"content": "It's not as good as the hype. It's okay but the £2.29 price tag is not worth the payment of what you get.", "rating": "3", "version": "1.05", "date": "2016-12-09T14:41:00-07:00", "title": "Average and over hyped"}, {"content": "I LOVE this game! So detailed and smart - the amount of luck and intellect is SO Accurate to what real life would be like!! so so so so good", "rating": "5", "version": "1.05", "date": "2016-12-09T11:23:00-07:00", "title": "So good !"}, {"content": "It's an ok game. Becomes a bit samey after 5 or 6 goes. \n\nI didn't enjoy it as much as everyone else. \n\nProbs wouldn't have paid for the full game if I'd tried a free version.", "rating": "3", "version": "1.05", "date": "2016-12-08T11:27:00-07:00", "title": "It's alright.."}, {"content": "Played through several times in ten minutes and feel like it's done for me. Not worth the price, you figure out the mechanics in the first few rounds and I'm not sure what the incentive is to keep playing.", "rating": "3", "version": "1.05", "date": "2016-12-08T03:27:00-07:00", "title": "Not the great game I was expecting"}, {"content": "If you are on the fence do it! Had so much fun this week on this.", "rating": "5", "version": "1.05", "date": "2016-11-17T04:13:00-07:00", "title": "Best iOS game I've played in a while - buy"}, {"content": "Would love the option to pick a gender…", "rating": "4", "version": "1.05", "date": "2016-11-14T10:11:00-07:00", "title": "Great fun but…"}, {"content": "This is a fun and entertaining game, with a amazing art style and lots of tricks up its sleeve but I lacks content it needs more cards and buffs", "rating": "5", "version": "1.04", "date": "2016-11-12T02:38:00-07:00", "title": "Great game"}, {"content": "Lacks something", "rating": "3", "version": "1.03", "date": "2016-11-02T23:27:00-07:00", "title": "Hmm"}, {"content": "The game is nice and keeps me want to play. Issues: swiping doesn't feel responsive even on 6s. There's a delay, card doesn't follow finger and it's easy to make wrong move. Second problem, there's no state preservation, if you close app and open in 2 days, you start over.\n\nI have feelings this issues caused by the fact that's Reigns available on different platforms, so there's not attention to iOS specific details, will try to purchase mostly iOS exclusives from now on.", "rating": "3", "version": "1.03", "date": "2016-11-02T13:45:00-07:00", "title": "Could be better"}, {"content": "I really enjoy this simple to play yet entertaining game. Only problem is I'm frustrated as I know there's new storylines/ characters/ deaths to unlock but I keep getting the same cards over and over! Definitely worth the price though a really unique and engaging game.", "rating": "5", "version": "1.03", "date": "2016-10-27T16:37:00-07:00", "title": "Really awesome game"}, {"content": "Love playing the game, but it's frustrating when you get a high scoring run & it crashes forcing you to restart the app, losing your progress. Please fix this!", "rating": "4", "version": "1.03", "date": "2016-10-23T03:43:00-07:00", "title": "Great game, shame about the bug"}, {"content": "This app is extremely good, and worst of all, extremely addicting.. I played for four hours straight... The only downside to it is that every so often, one of the playthroughs on a certain King would come up with a death, but wouldn't end that turn.", "rating": "4", "version": "1.03", "date": "2016-10-21T16:26:00-07:00", "title": "Really good!!"}, {"content": "I really like this app, but it keeps crashing! So frustrating! The King dies but the reign won't save or let you move on to a new King. If you reboot the app it goes back to the previous King and you lose everything. Please fix this!", "rating": "3", "version": "1.03", "date": "2016-10-20T01:27:00-07:00", "title": "Bugs!"}, {"content": "The concept is genius and the game is incredibly addictive. Easily the best mobile gaming experience I've had in years!", "rating": "5", "version": "1.03", "date": "2016-10-17T16:51:00-07:00", "title": "Masterpiece"}, {"content": "Such a great game! But until it's fixed I'm only giving it one star.", "rating": "1", "version": "1.03", "date": "2016-10-07T06:40:00-07:00", "title": "Amazing but broken"}, {"content": "This game is so addictive, I play it whenever I have a spare minuet, and for just £2.29, it's a no brainer, giving endless hours of well thought out fun with endless routes. Recommended in case you couldn't guess :)", "rating": "5", "version": "1.03", "date": "2016-10-06T07:03:00-07:00", "title": "Worth. Just worth."}, {"content": "Great game, absolutely love it, shame it hangs after some reigns and I have to restart, losing progress from the last reign. Fix that and u will have 5 stars.", "rating": "2", "version": "1.03", "date": "2016-10-03T23:11:00-07:00", "title": "Amazing"}, {"content": "Best paid game I've played since Galaxy on Fire, love love love it! Some excellent, surprisingly in depth gameplay and game mechanics and also addictive and even funny at times. Highly recommend.", "rating": "5", "version": "1.03", "date": "2016-10-01T02:40:00-07:00", "title": "Well worth it!"}, {"content": "Blends the silliness of card games like munchkin with some genuinely tricky gameplay. I find myself coming back to this game again and again..", "rating": "5", "version": "1.03", "date": "2016-09-30T04:58:00-07:00", "title": "Cracking fun!"}, {"content": "This game is fantastic!\nHilarious story and amazing music. Definitely The tinder of Roguelike RPGs. I love it!", "rating": "5", "version": "1.03", "date": "2016-09-28T16:16:00-07:00", "title": "Tinder of roguelike RPGs"}, {"content": "This is a great game & really addictive, the problem is it keeps hanging & I have to re-start it which means it does not register that reign - seems to happen frequently on a high score 😡", "rating": "2", "version": "1.03", "date": "2016-09-26T10:24:00-07:00", "title": "Keeps hanging ☹️"}, {"content": "Even when you know most of the cards you keep going back for replay value. Clever little game.", "rating": "5", "version": "1.03", "date": "2016-09-25T12:56:00-07:00", "title": "Very entertaining"}, {"content": "A modern day masterpiece of mobile game entertainment", "rating": "5", "version": "1.03", "date": "2016-09-25T07:15:00-07:00", "title": "Stunning"}, {"content": "Fantastic in small bits of free time", "rating": "5", "version": "1.02", "date": "2016-09-21T02:58:00-07:00", "title": "10/10"}, {"content": "It freezes when I die sometimes and doesn't save my progress :(", "rating": "3", "version": "1.02", "date": "2016-09-19T14:37:00-07:00", "title": "Good but crashes"}, {"content": "Quite often you complete an objective or beat your own best score and the game hangs! Very annoying!", "rating": "3", "version": "1.02", "date": "2016-09-18T03:06:00-07:00", "title": "Good but"}, {"content": "It's sick", "rating": "5", "version": "1.02", "date": "2016-09-17T09:53:00-07:00", "title": "Sick"}, {"content": "Amazing game keeps you going for ages never gets boring. Love it", "rating": "5", "version": "1.02", "date": "2016-09-16T14:21:00-07:00", "title": "Great"}, {"content": "The game is overall quite fun to play there's much more they could do to make it better such as if two powers reach max you should be protected by one of such powers", "rating": "4", "version": "1.02", "date": "2016-09-15T04:27:00-07:00", "title": "It's fun"}, {"content": "...all the kings have the same names and its a trifle outdated as Queens have ruled over kingdoms for many years yet they don't get a look in.  Females are just in the game to be rescued, married, have babies or be witches. It's 2016, we have thousands of years of history with both good and bad Kings & Queens sat on the throne, so the game should reflect that.  This game is basically ousting Queen's reigns from existence so perhaps the developers should have been focused on Pope reigns as there has never (yet) been a female Pope.", "rating": "2", "version": "1.01", "date": "2016-09-10T07:05:00-07:00", "title": "Bit boring..."}, {"content": "Same cards over and over, also the outcomes of some cards are ridiculous", "rating": "1", "version": "1.01", "date": "2016-09-09T02:39:00-07:00", "title": "Dull and repetitive"}, {"content": "Fast fun game to pick up and play and return to. \nI loved it and got my dad into it. It's the first game he's played in 20 years. Simple and fun!", "rating": "5", "version": "1.01", "date": "2016-09-08T15:00:00-07:00", "title": "A refined fun"}, {"content": "Reigns is a really cleverly designed game that branches out every time you play and offers something very different. Well worth checking out!", "rating": "5", "version": "1.01", "date": "2016-09-08T00:40:00-07:00", "title": "Innovative and Deserving of Huge Success"}, {"content": "This game truly is extremely fun to play and I would definitely recommend it. However, I have repeatedly been plagued by game corruptions causing my save to die for no reason which has got remarkably annoying as time has gone on.", "rating": "4", "version": "1.01", "date": "2016-09-07T16:33:00-07:00", "title": "Good but plagued by corruptions"}, {"content": "Good, entertaining for a few moments. \n\nBut a nagging feeling that it's all too random. I don't get a sense that my choices actually mean something to stay alive.", "rating": "3", "version": "1.01", "date": "2016-09-06T02:27:00-07:00", "title": "A bit random"}, {"content": "Even though it is a bit overpriced for what it offers it is a good game", "rating": "4", "version": "1.01", "date": "2016-09-05T12:48:00-07:00", "title": "A bit expensive"}, {"content": "This game is amazing apart from the fact that every you force close the app (double pressing the home screen button and swiping up) it will bring up a message that your game save is corrupt and you have no choice but to restart. Please fix this bug as it is ruining the game.", "rating": "4", "version": "1.01", "date": "2016-09-04T14:18:00-07:00", "title": "Annoying Bug"}, {"content": "I don't normally write reviews, but I had to for this one. At the start I thought the game was quite repetitive but later on the 'trick the devil' plot adds more depth to the game. However, when you complete all endings the game just becomes repetitive and pointless, but it's good nonetheless", "rating": "5", "version": "1.01", "date": "2016-09-04T10:54:00-07:00", "title": "Wow"}, {"content": "I bloody love the game, everything about it, but once I get past the first millennia, it starts to bug out. Names and cards don't appear, then after about 3 hours it corrupts the data and I have to restart everything. It's done this about 7 times over the past few days and it's really annoying. Needs to be fixed.", "rating": "3", "version": "1.01", "date": "2016-09-02T09:40:00-07:00", "title": "Good, but keeps corrupting my data."}, {"content": "Good game just every time I come back onto the app it says corrupted data and forces me to reset everything", "rating": "3", "version": "1.01", "date": "2016-09-02T05:27:00-07:00", "title": "Corrupting data"}, {"content": "Uhh", "rating": "3", "version": "1.01", "date": "2016-09-02T04:57:00-07:00", "title": "Good story but very repetive and kinda disturbing"}, {"content": "The game is strangely addictive, but that's about it. The game endings are frustrating and make no sense half the time, and it becomes fairly monotonous very quickly.", "rating": "2", "version": "1.01", "date": "2016-09-02T03:24:00-07:00", "title": "Not wonderful"}, {"content": "May seem simple to begin with, but keep at it, it's a very rewarding game!", "rating": "5", "version": "1.01", "date": "2016-09-01T18:29:00-07:00", "title": "Keep at it"}, {"content": "I'm in love with this app because it combines all the features of a 'choose your own story' type game with the thrill of a quicker, plate-juggling game. It also doesn't drag on too long like some games can and is convenient for whenever you get a spare few minutes. I thoroughly recommend downloading this app! Totally worth it!!!", "rating": "5", "version": "1.01", "date": "2016-09-01T13:52:00-07:00", "title": "Download now!"}, {"content": "This is an amazing game with great animations, awesome balancing system and difficult questions. This would be one of my favourite games but every four hour period that you don't play the game, the data becomes corrupt and you have to start from scratch. This means that I would not recommend this game to people who hate being forced to start again in a game.", "rating": "2", "version": "1.01", "date": "2016-09-01T01:54:00-07:00", "title": "Could be amazing..."}, {"content": "Said yes to a barking dog and it killed the entire population of my kingdom 10/10", "rating": "5", "version": "1.01", "date": "2016-08-30T12:49:00-07:00", "title": "Lyk if u cry evrytim"}, {"content": "The app its self is good but takes ages to download", "rating": "3", "version": "1.01", "date": "2016-08-30T07:24:00-07:00", "title": "Too long to download"}, {"content": "There is no way this game has got the reviews it has honestly, I would struggle to download this game even if it was free! It's very simplistic and repetitive, and you get bored within 5 mins of playing. Seriously done waste you time or money!", "rating": "1", "version": "1.01", "date": "2016-08-29T01:04:00-07:00", "title": "REVIEWS ARE FAKE! DO NOT BUY!!!"}, {"content": "Very simple at first, but very difficult to master. Worth every penny.", "rating": "5", "version": "1.01", "date": "2016-08-28T00:59:00-07:00", "title": "Great game!"}, {"content": "Editors choice??? I would be more wary next time.  Fun ish for a few days.", "rating": "2", "version": "1.01", "date": "2016-08-27T14:32:00-07:00", "title": "A bit dull and repetitive"}, {"content": "this game is very fun and enjoyable but what ruins it is the fact that the game files corrupt every time i open the game an hour later than i last played it\n\n5 stars but becuase of the corrupting files 2", "rating": "2", "version": "1.01", "date": "2016-08-27T11:33:00-07:00", "title": "Corrupting game files"}, {"content": "It's funny and addictive. I hesitated about buying it as people say it can get repetitive. And yes some of the same cards come around, but it totally doesn't take away from the game. If anything, I means you can play more tactically. My high score is 59 years so far. Better get reigning again and beat it!!", "rating": "5", "version": "1.01", "date": "2016-08-26T12:20:00-07:00", "title": "Great game"}, {"content": "It's a good game but every time I open the game, it says,\"Game data corrupted\" and makes me reset the everything in the game. This is very annoying, but it doesn't stop me from playing.", "rating": "4", "version": "1.01", "date": "2016-08-26T11:46:00-07:00", "title": "Good but problems"}, {"content": "Extremely addictive and fun to play, but also makes you think about your decisions. Never bores me!", "rating": "5", "version": "1.01", "date": "2016-08-25T12:52:00-07:00", "title": "So fun!"}, {"content": "If you get this bug you are screwed and you cant pretty much play the game. After every reboot of the game you are going to get a message saying \"Your files got corrupted, want to restart the game?\" And even if you do, next time you will open the app its gonna be the same thing. Please fix!", "rating": "2", "version": "1.01", "date": "2016-08-24T22:44:00-07:00", "title": "Awful bug"}, {"content": "Why waste your time reading this Review GET THIS EPIC GAME", "rating": "5", "version": "1.01", "date": "2016-08-24T12:05:00-07:00", "title": "Epic Game"}, {"content": "Ok there are so many spoilers ahead. I played this game. I enjoyed it, and then I found out how to end it. Trick the Devil. By myself, I found out how, and I was so prepared by the time the Devil arrived. Then my King died, as he does, and this Spirit says \"Still no luck Tricking the Devil?\" I say Yes, because if I hadn't I felt I'd end the game because if I said no it might think of that as giving up. So I said Yes and got the Bad Ending even though I would have made it if I survived a little bit longer.", "rating": "3", "version": "1.01", "date": "2016-08-24T06:37:00-07:00", "title": "So close..."}, {"content": "This sort of shoddy game making is the problem with the games industry at large. It is unacceptable to present a piece of work for sale that is clearly unfinished or hasn't been fully tested. Pathetic. I would like a refund EDITOR. You must not have played the game you were recommending.", "rating": "1", "version": "1.01", "date": "2016-08-23T22:01:00-07:00", "title": "Why should I pay to be a beta tester"}, {"content": "So, I can appease the church, but then the army might come after me... I can keep the money lenders from taking over the kingdom, but the people are so powerful they've deposed me... And that's assuming I survived the dungeons, duels and dragon. Maybe I should have said yes to that crusade...\n\nThis is a funny and clever game, forcing you to try to maintain your rule with each king by balancing the church, people, military and money. Tied into that is an overarching quest to break a curse forcing you to be resurrected in every new ruler. The mechanics are simple: a card is turned over, requiring a response, and you swipe right for yes (mostly), or left for no. Yet there is a decent amount of strategy involved and the quest keeps you going.\n\nThe replay value is perhaps a little low, but this is a compelling and enjoyable piece of entertainment until you finally crack it.", "rating": "4", "version": "1.01", "date": "2016-08-23T12:46:00-07:00", "title": "Swipe right for medieval malarkey"}, {"content": "Not a game that you'll probably play for hours on end but enjoyable for a quick half hour.\nSimple to play, my only issue is that the battery seems to get hammered!", "rating": "4", "version": "1.01", "date": "2016-08-23T09:56:00-07:00", "title": "Enjoyable but a battery guzzler"}, {"content": "I am slightly perplexed with peoples enthusiam for this game. I am not a shoot em up kinda of gamer and so thought that this may have a fun bit of strategy to it. It is effectively a card game with a number of scenarios that roll out of making decisions. Yes I have lived for up to 35 years and so I have tested it. Pick up/ put down and entirely forgetable. Further hugely overpriced for what it is.", "rating": "2", "version": "1.01", "date": "2016-08-23T04:14:00-07:00", "title": "Slightly Perplexed"}, {"content": "Nice game to play, very addictive! Animation and sound are great.\nIt's too glitchy at the moment, which causes huge frustration. Things like resetting stats and the card animation completely bugging out are awful and need fixing. There's nothing more frustrating than getting close to Reigning for 70+ years only to have the card animation completely bug out and then the death scene hang forcing a restart of the app, losing all of your achievements in that run.", "rating": "3", "version": "1.01", "date": "2016-08-23T03:01:00-07:00", "title": "Good game, but glitchy"}, {"content": "Kinda boring after an hour or so.", "rating": "2", "version": "1.01", "date": "2016-08-22T09:30:00-07:00", "title": "Ehhhh"}, {"content": "Like FTL, but a lot more death, like looooooads more death.", "rating": "5", "version": "1.01", "date": "2016-08-22T09:20:00-07:00", "title": "A little repetitive, but inexplicably fun."}, {"content": "A great concept for a game, it would be good to see more cards released to extend the gameplay. Unfortunately however, I haven't been able to get very far as every time I reopen the app, it tells me the save file has corrupted.", "rating": "3", "version": "1.01", "date": "2016-08-22T05:22:00-07:00", "title": "Great game but glitchy"}, {"content": "This really is a great game. I just hope more content is added over time.", "rating": "5", "version": "1.01", "date": "2016-08-22T03:31:00-07:00", "title": "RB"}, {"content": "I love this game but when I  close the game and go back into the game it says my data is corrupted and I have to reset all my progress I hope they fix this problem in future updates", "rating": "3", "version": "1.01", "date": "2016-08-22T02:02:00-07:00", "title": "Really good but.."}, {"content": "The game is an alright and briefly enjoyable little story - but you can get caught in loops of repetitive gameplay. Am annoyed though as the data corrupts frequently and ruins your saves. Not worth the price.", "rating": "3", "version": "1.01", "date": "2016-08-21T12:16:00-07:00", "title": "Ok"}, {"content": "Extremely fun game to begin with, love the balancing of the four powers to keep your head and the game gets more fun as you unlock more cards + people and delve further into the story. The only issue which is stopping me from playing is the fact that my save game data has corrupted 4 times in the 2 days of having it, I was extremely close to the end too. Such a shame as it's definitely worth 4-5 stars and the price tag but this issue keeps me from rating it higher.", "rating": "3", "version": "1.01", "date": "2016-08-21T11:49:00-07:00", "title": "Fun but issues"}, {"content": "Awesome simple game. Can get a bit repetitive but I still can't stop playing. Hilarious too.", "rating": "5", "version": "1.01", "date": "2016-08-21T07:21:00-07:00", "title": "Love It!"}, {"content": "Reigns is a real time sinker, but a quite challenging one.\nThe flow of play is super smooth and it also manages to generate quit a lot of fun moments!\nDefinitely recommended!", "rating": "5", "version": "1.01", "date": "2016-08-21T04:18:00-07:00", "title": "Genuinely fun and challenging!"}, {"content": "I think that this game is fantastic. I really enjoy playing it. This would be a five star review, but every time I open the game after at least an hour away from it, my save game corrupts and I have to start from scratch. The one time that this didn't happen, the game collected all my previous kings into one King with a 500 year reign. In summary, great game, but please fix these issues.", "rating": "3", "version": "1.01", "date": "2016-08-20T04:29:00-07:00", "title": "Great game, but has performance issues"}, {"content": "Played this loads to start with and really enjoyed it. Interesting to work out the mechanics of each card and choice but also to see it fit into the overall story. But! I am now stuck - need to arrange a honey moon, find the blood and loser a limb but no matter how many times I play I don't get a path which takes me to any of these events. I wonder if I got rid of a card earlier in the game which has left me in a dead end. Disappointing as otherwise it would be a five star game.", "rating": "3", "version": "1.01", "date": "2016-08-20T02:59:00-07:00", "title": "Really good fun until. .."}, {"content": "Fun game, has become predictable after a few goes which is either helpful or boring depending on if you are looking for a challenge", "rating": "4", "version": "1.01", "date": "2016-08-20T02:28:00-07:00", "title": "Very playable despite being predictable"}, {"content": "The game corrupted on my iPad, had to delete and redownload really upset. A great game though, I'm just upset about this. My game recently corrupted multiple times, making me lose hours of gameplay, if this keeps happening I'm going to have to keep dropping stars.", "rating": "2", "version": "1.01", "date": "2016-08-20T01:39:00-07:00", "title": "Ahhh"}, {"content": "pretty good, fun tinder esque system. dont understand why there are no queens? its clearly based on british and west european history- which had many successful queens. weird that they dont really give you the option. its not like the game is titled around the king, just the idea of a monarch. but other than that its pretty good", "rating": "3", "version": "1.01", "date": "2016-08-20T00:27:00-07:00", "title": "pretty good- no queens?"}, {"content": "Data keeps on corrupting whenever I close the app, so I have to restart everything.", "rating": "2", "version": "1.01", "date": "2016-08-19T15:24:00-07:00", "title": "Fun but broken"}, {"content": "It made my iPad Air 2 become very very hot to the point where it was too hot to touch needs fixing", "rating": "1", "version": "1.01", "date": "2016-08-19T12:06:00-07:00", "title": "Overheating issue"}, {"content": "I bought this game hoping that it was worth it.\nI started playing and died quite fast. I played some more and found the trick of it and died less times. After 1 hour I got addicted to the game! It's so worth it! Just 1 thing.\nPlease make it so when you die. Eg. You're so rich that they throw a party and u die and they don't realise you were dead until the next day since they were so drunk. Make it so it shows different messages. Because my money kept increasing and I had to say to about everything to pay to get rid of it. Otherwise I would die and I would like it more if it something different happens.\nOtherwise best game!", "rating": "5", "version": "1.01", "date": "2016-08-19T11:59:00-07:00", "title": "2016 Best Game!"}, {"content": "Great game!!! Yogscast showed me!!! Great price \n\nThanks", "rating": "5", "version": "1.01", "date": "2016-08-19T11:12:00-07:00", "title": "Amazing"}, {"content": "It's a great game, however every time I reopen the app I'm forced to reset as the data is corrupt", "rating": "4", "version": "1.01", "date": "2016-08-19T10:29:00-07:00", "title": "Great game....but"}, {"content": "Great game, looking forward to new updates!", "rating": "5", "version": "1.01", "date": "2016-08-19T05:19:00-07:00", "title": "Brilliant!"}, {"content": "The game grows the more you play. You need to give it more than 15 minutes though...!", "rating": "5", "version": "1.01", "date": "2016-08-18T13:30:00-07:00", "title": "Quirky but great"}, {"content": "This game has more depth than I expected (although more cards would be appreciated).", "rating": "4", "version": "1.01", "date": "2016-08-17T22:47:00-07:00", "title": "Challenging and Fun"}, {"content": "Great original game! Well worth the money!! Love it", "rating": "5", "version": "1.01", "date": "2016-08-17T14:51:00-07:00", "title": "Ruling is hard, swiping is easy"}, {"content": "Great for quick pick-up-and-play sessions. Really well written and dead funny at times. More cards please!!!!", "rating": "5", "version": "1.01", "date": "2016-08-17T13:40:00-07:00", "title": "Brilliant"}, {"content": "Don't generally write reviews, but I want to encourage this kind of innovative, humorous, and entertaining pay-once game making.\n\nGot a brain? Then you'll love it.", "rating": "5", "version": "1.01", "date": "2016-08-17T12:32:00-07:00", "title": "Wonderful"}, {"content": "Installed it, ran it a few times. Seems ok.\n\nNow though, when i start it it just hangs on the starting splash screen. I get the starting cheer noise, but nothing else.....", "rating": "1", "version": "1.01", "date": "2016-08-17T07:38:00-07:00", "title": "Game fails to start"}, {"content": "Looks pretty but didn't take long to switch from 'playing for fun' to 'playing because I paid £2!'", "rating": "3", "version": "1.01", "date": "2016-08-17T05:18:00-07:00", "title": "Rapidly becomes dull"}, {"content": "177 years in power lololollo\n\n(Check the leaderboard)\n\nPretty challenging game actually.\n\nP.S don't listen to the haters. They just don't know how to play the game or understand the point of it", "rating": "5", "version": "1.01", "date": "2016-08-17T04:48:00-07:00", "title": "Bruh"}, {"content": "Really great fun game, but gets a little repetitive. Hopefully the updates will add some new aspects. Thanks.", "rating": "4", "version": "1.01", "date": "2016-08-17T03:15:00-07:00", "title": "Great little game"}, {"content": "A nice little game but only fun for a day or so. Rather tedious after that - you have to accept that you are doomed to fail and the app decides when you 'die' rather than your decisions", "rating": "2", "version": "1.01", "date": "2016-08-17T02:23:00-07:00", "title": "Hype"}, {"content": "Only problem is when you get into a game with the red dwarf and have the dice effect you go in a loop until you die in a feast", "rating": "5", "version": "1.01", "date": "2016-08-17T01:21:00-07:00", "title": "Awesome game"}, {"content": "Great game and I'm determined to complete all the Royal deeds even if it kills me......! However it only gets four stars for two reasons because firstly it crashed on me when I completed my first run and when I got beyond the year 2100ad which was VERY annoying and secondly as a female gamer you don't get a choice to pick being Queen rather than King!!!!!", "rating": "4", "version": "1.01", "date": "2016-08-17T00:55:00-07:00", "title": "Royal....."}, {"content": "I was sold on the developers description alone, but on downloading and playing it, I was hugely disappointed. Monotonous, repetitive, underwhelming & insipid. Personally feel the praise for the app is exaggerated!", "rating": "1", "version": "1.01", "date": "2016-08-16T23:29:00-07:00", "title": "Don't believe the hype!"}, {"content": "Got totally done by the Apple review. Must have played 15 20 minutes. Repetitive. Boring. A bit too randomized. Poor AI. A worse iteration of a \"tindered game\". What a bore. And Apple say they were \"floored\". Geezus. It's a 69p game at best.", "rating": "2", "version": "1.01", "date": "2016-08-16T21:17:00-07:00", "title": "ZZZZZzzzz"}, {"content": "Really good game with lots of content once you unlock the cards. However I don't like the per second increase/decrease mechanic as it's a turn based game and it makes you have to rush through.", "rating": "5", "version": "1.01", "date": "2016-08-16T18:44:00-07:00", "title": "Quality Game"}, {"content": "The creators have put a great amount of work to the tone and variety in this game, and it's such a clever simple system that it works very well.\n\nHave found myself addicted to it for small bouts of time, enough to take up tiny waits of 3-4min as much as longer spans of 30-40min. Beautifully and smartly done.", "rating": "5", "version": "1.01", "date": "2016-08-16T15:38:00-07:00", "title": "Very simple, and great fun"}, {"content": "Why the hype? This is very boring and repetitive. Certainly don't understand the price tag! Lasted an hour then deleted.", "rating": "2", "version": "1.01", "date": "2016-08-16T14:54:00-07:00", "title": "???"}, {"content": "Many s true nerd sent me, money well spent", "rating": "5", "version": "1.01", "date": "2016-08-16T12:00:00-07:00", "title": "I love this game."}, {"content": "No strategy, just answer each question to keep each of your four ratings in middle.  Spectrum quality graphics.  Spectrum complexity game.", "rating": "1", "version": "1.01", "date": "2016-08-16T10:11:00-07:00", "title": "Waste of money"}, {"content": "When I first started I did not know if I was saying yes or no. It is also on my pad and will not turn over.", "rating": "1", "version": "1.01", "date": "2016-08-16T09:48:00-07:00", "title": "Confusing at first."}, {"content": "Got to say, this game is fun for about 10 minutes but wears thin very quickly. I honestly don't get the hype, it's basic, repetitive and boring. Should have been a free download but it only cost a couple of quid so not going to complain too much about that. Maybe I'm just not seeing what everyone else is seeing but it's two stars from me. I'm giving it two because it kept me interested for a brief while, one star would have been if I'd have found it rubbish immediately. The rubbishness grows on you sadly.", "rating": "2", "version": "1.01", "date": "2016-08-16T08:36:00-07:00", "title": "Meh! Why all the fuss?!"}, {"content": "Is addictive to start with, but after time the storyline gets repetitive, apart from added stuff as u progress through the game. \n\nIs challenging to balance the 4 factors (which your decisions affect) - religion, people, army, and money, but overall a good game.", "rating": "3", "version": "1.01", "date": "2016-08-16T07:13:00-07:00", "title": "Limited storyline"}, {"content": "A lot of fun and certainly worth it. After a couple hours of playing the same things happen and it stops evolving so much, so seems a bit slow. New experiences become harder to come by, although there are more to experience as the \"goals\" I haven't stumbled across yet are still there. Good game though.", "rating": "4", "version": "1.01", "date": "2016-08-16T06:09:00-07:00", "title": "Worth the Price"}, {"content": "WHAT ARE YOU WAITING FOR.... NOW!!!!", "rating": "5", "version": "1.01", "date": "2016-08-15T18:06:00-07:00", "title": "GET THE GAME!"}, {"content": "So cool", "rating": "5", "version": "1.01", "date": "2016-08-15T17:07:00-07:00", "title": "So cool"}, {"content": "It's boss", "rating": "5", "version": "1.01", "date": "2016-08-15T16:05:00-07:00", "title": "Ha"}, {"content": "Excellent game. Can stop playing it.. You can reign for 20 years in a matter of minutes. Well designed and quite funny too. Would have been nicer for 99p but I guess I've had my money worth judging on much I'm playing this.", "rating": "5", "version": "1.01", "date": "2016-08-15T14:42:00-07:00", "title": "Genius"}, {"content": "Wow I was hesitant at first but once I downloaded it (3 days ago !!) I haven't been able to get off it 🤑🤑", "rating": "5", "version": "1.01", "date": "2016-08-15T14:30:00-07:00", "title": "Best Choice Game Ever !!"}, {"content": "Concept is great, love the art style, and the pace is... Average. \n\nAll this is good, but after you get half way through the game you've just about seen all the cards. I know it must be a lot of work and appreciate that the developers have put a lot of effort into it, but it does need more content. \n\nLove the game, but please, please, please add more cards!", "rating": "4", "version": "1.01", "date": "2016-08-15T13:07:00-07:00", "title": "Very good! Repetitive."}, {"content": "Reigns is a funny and amazing but difficult game that I am completely addicted to. I don't think there is really anything that needs to be improved but I look forward to seeing how this great game will grow.", "rating": "5", "version": "1.01", "date": "2016-08-15T13:07:00-07:00", "title": "Amazing game"}, {"content": "This is an amazing and absorbing game, however when played a few times, can get repetitive. It is truly deep and makes you think about your actions. Will you let the witch sell her wares? The happiness of your population will increase but your religiousness will decrease. The deepness and witty humour will repeal the repetitiveness for a while, but the game ends up getting a bit stale. I also find it slightly unfair that the devil never returns, but that is a minor complaint. Overall Reigns is a great game and I definitely recommend buying. The tinder of Kings!", "rating": "4", "version": "1.01", "date": "2016-08-15T10:19:00-07:00", "title": "Excellent, but a bit repetitive."}, {"content": "...Screen orientation issue with landscape is annoying and must surely be an oversight by author. Tried getting support but email bounced back! Having said that the is very enjoyable and it is a great idea.", "rating": "4", "version": "1.01", "date": "2016-08-15T10:07:00-07:00", "title": "Enjoyable but....."}, {"content": "I think for the price tag it's a bit overrated. A lot of the decisions you need to make don't make any sense, so there is little feeling of reward if you do well, and it simply feels unjust if you die quickly - you'll just be left thinking, well, why though?\n\nAlso, it really is quite boring after a few rounds of the same questions/decisions. The game needs a lot more variety and the graphics should be vastly improved to justify the price tag at least! \n\nI think a lot of the great reviews could be from family/friends of the developers.", "rating": "2", "version": "1.01", "date": "2016-08-15T09:53:00-07:00", "title": "Overrated!"}, {"content": "Every decision counts", "rating": "5", "version": "1.01", "date": "2016-08-15T08:46:00-07:00", "title": "Funny and clever game"}, {"content": "A unique and quirky game.", "rating": "4", "version": "1.01", "date": "2016-08-15T01:14:00-07:00", "title": "Intriguing"}, {"content": "It's one of those games where you think \"Ok *next time* I'm going to do better\" each time you die. You will find yourself absorbed in the balancing system to try and optimise your turn. Very good sound design too.", "rating": "5", "version": "1.01", "date": "2016-08-14T17:56:00-07:00", "title": "10/10 would die again"}, {"content": "Absolutely amazing, truly unique game. Intriguing and stands out as one of the most special, well-thought out games in smartphone gaming history. Can provide hours of fun and you'll want to beat your highscore no matter what.", "rating": "5", "version": "1.01", "date": "2016-08-14T17:11:00-07:00", "title": "One-of-a-kind"}, {"content": "Very interesting and intriguing game. Try it, you will like it. :)", "rating": "5", "version": "1.01", "date": "2016-08-14T15:19:00-07:00", "title": "King of Apps"}, {"content": "Honestly, as tricky as the game is, this game is fun, addictive and really worth the price tag.\n\nI only really have two problems with the game, of which both are pretty minor details that I'm sure would be worked on anyway:\n\n1. When a king's name is passed on it would be cool to see like \"Harry I\", \"George II\", \"James VI\" etc.\n\n2. When you die it would be a nice if the method that killed you was different, for example when you reach to the top of gold the way you always die is throwing a party and \"eating too much, everyone was drunk and was unaware\". If there were 4 or 5 for each category that would make things feel a lot fresher.\n\n3. Third and finally, i'm not sure if this is already a feature in the game because of it being more of a technical point but, for example, one of the sons of the king who revolted and killed him became king after. I would think it to be a good detail if things were tougher for said new king because of his actions, so basically a character's actions can have consequences sort of thing.\n\nOverall, great game and i'm looking forward to how it grows!!", "rating": "4", "version": "1.01", "date": "2016-08-14T15:16:00-07:00", "title": "Truly a great game"}, {"content": "Just superb. A brilliant concept, very well executed. Essential. \n\nI'm sure this will win many awards!", "rating": "5", "version": "1.01", "date": "2016-08-14T15:10:00-07:00", "title": "Genius"}, {"content": "Witty and addictive. A tad repetitive at times but balancing the kingdom and not ending up dead after a few years reign is quite a challenge.", "rating": "5", "version": "1.01", "date": "2016-08-14T14:18:00-07:00", "title": "Hours of entertainment"}, {"content": "Had some fun playing this afternoon since I downloaded, but in what can only be about an hour or so of play it's taken about 40% of my battery and when it is not more than fairly basic cartoon graphics, that doesn't seem right.", "rating": "3", "version": "1.01", "date": "2016-08-14T11:28:00-07:00", "title": "Fun game, but a battery guzzler"}, {"content": "Interesting concept but gets repetitive quite quickly. Overpriced for what it is.", "rating": "3", "version": "1.01", "date": "2016-08-14T09:49:00-07:00", "title": "Reasonable, but nothing more."}, {"content": "Great game, but when duelling at the top, I can't see the white characters, which makes duelling very difficult... 😑", "rating": "3", "version": "1.01", "date": "2016-08-14T09:08:00-07:00", "title": "Good game, but bugs alert!"}, {"content": "It's a fun time waster if you happen to have a few minutes free during the day. \nIt can be slightly confusing g at times but that adds to the charm I feel, the randomness of the cards you receive keeps the game interesting as you try and rule your kingdom, I'm looking forward to breaking my record of 60+ years as a King.", "rating": "4", "version": "1.01", "date": "2016-08-14T03:59:00-07:00", "title": "Great for short, repeated sessions ."}, {"content": "It gets quiet repetitive after a few kings, same cards keeps popping up even if different answer is given, also far too easy to die.", "rating": "2", "version": "1.01", "date": "2016-08-14T01:14:00-07:00", "title": "A bit boring"}, {"content": "Simple format, but incredibly compelling story and outcomes. I've never been so invested in an iOS game. \n\nYou are the king, and a mere swipe to the left or right decides your kingdoms fate for a year. Sounds almost dull but the variety of characters you meet, the precarious balancing of the impacts of different decisions and the gradual reveal of more characters, plot twists and events make it utterly enthralling.  \n\nNo adverts or in game purchases means you aren't constantly yanked out of the experience for the sake of a few extra dollars for the developers, and there is no forced 'wait-to-play' nonsense that ruins so many other games.", "rating": "5", "version": "1.01", "date": "2016-08-13T21:09:00-07:00", "title": "Best iOS game I've ever played"}, {"content": "Taught me that good games are not all about graphics!", "rating": "5", "version": "1.01", "date": "2016-08-13T17:26:00-07:00", "title": "Simple but great fun!"}, {"content": "I like that you can pick this game up for five minutes or end up playing for longer. \n\nThere is something addictive about trying to get all the different deaths and I also enjoy the unpredictability of some of the decisions.", "rating": "5", "version": "1.01", "date": "2016-08-13T15:14:00-07:00", "title": "Easy to play. Good humour. Nice art style."}, {"content": "Can come across as repetitive but gets highly addictive and I always find myself trying to beat my previous score", "rating": "4", "version": "1.01", "date": "2016-08-13T15:09:00-07:00", "title": "Good fun"}, {"content": "10/10", "rating": "5", "version": "1.01", "date": "2016-08-13T13:23:00-07:00", "title": "👍👍👍"}, {"content": "As title suggests, bored after 20 minutes.", "rating": "3", "version": "1.01", "date": "2016-08-13T12:56:00-07:00", "title": "Bored after 20 mins"}, {"content": "I spent a whole day playing this, I'm ded", "rating": "5", "version": "1.01", "date": "2016-08-13T12:37:00-07:00", "title": "👁‍🗨"}, {"content": "Its fun but i cant figure out how to win", "rating": "5", "version": "1.01", "date": "2016-08-13T12:12:00-07:00", "title": "Fun BUT"}, {"content": "Very clever, irreverently funny, a must download!", "rating": "5", "version": "1.01", "date": "2016-08-13T10:50:00-07:00", "title": "Great game"}, {"content": "A good game but my saves seem to corrupt every time I come back to the game after a Ive come off it for a while. But it is fun while I play.", "rating": "4", "version": "1.01", "date": "2016-08-13T10:27:00-07:00", "title": "Corrupt Saves"}, {"content": "Surprisingly addictive. Well made, and engrossing!", "rating": "5", "version": "1.01", "date": "2016-08-13T08:32:00-07:00", "title": "Excellent!"}, {"content": "Best game I've bought in a long time, totally addicting. Although sometimes it is too easy to die!", "rating": "5", "version": "1.01", "date": "2016-08-13T08:23:00-07:00", "title": "Amazing!!"}, {"content": "What a Fantastic game. I was intrigued by the description and idea of this one and had checked a review before paying the price which I was somewhat concerned by. However, I can't recommend this game enough. You have to know what to expect as I fear some people may not appreciate how deep the game is at first glance. Fully recommend going for it though. Already love this one.", "rating": "5", "version": "1.01", "date": "2016-08-13T07:55:00-07:00", "title": "Top quality app"}, {"content": "I love this game. It's not only tricky and fun; it's also pretty funny with some great nerdy references. \nThe gameplay is ludicrously simple...the political game you must play is anything but.", "rating": "5", "version": "1.01", "date": "2016-08-13T07:31:00-07:00", "title": "Simple, clever and addictive"}, {"content": "It's a choose your own adventure rogue like card game full of wit and unexpected twists and turns. Love this!", "rating": "5", "version": "1.01", "date": "2016-08-13T07:20:00-07:00", "title": "Wow!"}, {"content": "This game is legit fun, challenging and just a general good time consuming app. It can be difficult at first but that's the point, making sure your kingdom is kept well but not giving people too much power, so many options. Played for around 3-4 hours and I have only got 1/2 the cards. Only just won a game where I die of old age. Buy this if you want something to pickup and play from time to time!", "rating": "5", "version": "1.01", "date": "2016-08-13T07:01:00-07:00", "title": "Great"}, {"content": "Great, fun little game.", "rating": "5", "version": "1.01", "date": "2016-08-13T06:42:00-07:00", "title": "Addictive"}, {"content": "A waste of money! There is no purpose. I just cannot understand the rave reviews", "rating": "1", "version": "1.01", "date": "2016-08-13T06:33:00-07:00", "title": "Utterly pointless"}, {"content": "But it's also a bit glitchy atm. Will raise to 5 on next update :)", "rating": "4", "version": "1.01", "date": "2016-08-13T05:40:00-07:00", "title": "It's really, really good"}, {"content": "Great game, very entertaining", "rating": "5", "version": "1.01", "date": "2016-08-13T05:09:00-07:00", "title": "Great game!"}, {"content": "I love this game- can't stop playing it even though I'm awful at the game😂.money well spent, if your thinking about buying this game and your looking through the reviews and you come across this one I would say to definitely get this game-DONT EXPECT ACTION AND MOVING A CHARACTER", "rating": "5", "version": "1.01", "date": "2016-08-13T03:27:00-07:00", "title": "Amazing"}, {"content": "So you can play it landscape or portrait, but can't change the landscape orientation, simple thing please fix", "rating": "1", "version": "1.01", "date": "2016-08-13T02:40:00-07:00", "title": "Please fix orientation?"}, {"content": "A choose-your-own-adventure rougelike? Colour me interested!\n\nA rare and clever combination of genres. It's easy to get into and yet has a lot of depth.\n\nWell worth your money IMHO.", "rating": "5", "version": "1.01", "date": "2016-08-13T02:28:00-07:00", "title": "A rare gem of originality"}, {"content": "Simple in design but is great fun\n\nCould use a hard restart to go back to 602bc", "rating": "5", "version": "1.01", "date": "2016-08-13T01:43:00-07:00", "title": "Great game with great potential"}, {"content": "You can't stop playing this game, love it!!", "rating": "5", "version": "1.01", "date": "2016-08-13T01:39:00-07:00", "title": "Hooked!!"}, {"content": "Gets really repetitive after a few kings pass, the same cards keep coming up again and again and gets boring.", "rating": "2", "version": "1.01", "date": "2016-08-13T01:32:00-07:00", "title": "Good game but.."}, {"content": "A wonderful and deep game! I really hope the developers continue to create fun content, it's a truly fantastic game!", "rating": "5", "version": "1.01", "date": "2016-08-13T01:18:00-07:00", "title": "Perfect!"}, {"content": "Starts out simple, then starts messing with you!", "rating": "4", "version": "1.01", "date": "2016-08-13T00:59:00-07:00", "title": "Clever"}, {"content": "I can't stop playing this game! Beautifully put together that plays excellently. Text that has incisive wit and charm. Highly recommended.", "rating": "5", "version": "1.01", "date": "2016-08-13T00:35:00-07:00", "title": "Clever, funny, addictive"}, {"content": "A very interesting game. As king, the wellbeing of your citizens rests on the decisions you make. The consequences carry over from one king to the next and not all is as it seems...", "rating": "5", "version": "1.01", "date": "2016-08-13T00:33:00-07:00", "title": "Great game!"}, {"content": "6/5", "rating": "5", "version": "1.01", "date": "2016-08-13T00:03:00-07:00", "title": "6/5"}, {"content": "You can only swipe right for YES or left for NO. I am expecting questions but get statements like \"You're people are hungry\". That is not a question. How can I answer yes or no to that. Can't see point in game. Worst money ever spent on App.", "rating": "1", "version": "1.01", "date": "2016-08-12T22:24:00-07:00", "title": "What's the point"}, {"content": "Game", "rating": "4", "version": "1.01", "date": "2016-08-12T22:09:00-07:00", "title": "Interesting"}, {"content": "The less said the best, but this is seriously enchanting from start to finish, and back again. Brilliant stuff, great humour and always surprising.", "rating": "5", "version": "1.01", "date": "2016-08-12T15:55:00-07:00", "title": "Fantastic game"}, {"content": "Interesting game", "rating": "4", "version": "1.01", "date": "2016-08-12T15:21:00-07:00", "title": "Interesting game"}, {"content": "Too random to be fun - one bad answer and it's game over.", "rating": "1", "version": "1.01", "date": "2016-08-12T15:15:00-07:00", "title": "Dull"}, {"content": "Good game, not repetitive, well worth the muns", "rating": "5", "version": "1.01", "date": "2016-08-12T15:06:00-07:00", "title": "Sick"}, {"content": "This is a great little bundle of fun. Easy to play but challenging to win. Perhaps future add ons could be released at a premium for further content?", "rating": "5", "version": "1.01", "date": "2016-08-12T15:05:00-07:00", "title": "Innovative, fun and good value"}, {"content": "Definitely worthwhile playing. Awesome fun and ludicrously addictive!", "rating": "5", "version": "1.01", "date": "2016-08-12T14:56:00-07:00", "title": "Seriously fun - really enjoying it!"}, {"content": "This game is great at putting you under pressure and making you seriously think about your choices while managing to also be something while relaxing. Well fun, can't stop playing and trying to stay on the throne!", "rating": "5", "version": "1.0", "date": "2016-08-12T13:58:00-07:00", "title": "Amazing"}, {"content": "Really cool game!\nWould recommend, gets repetitive, however with small details changed.", "rating": "4", "version": "1.0", "date": "2016-08-12T12:45:00-07:00", "title": "Great!"}, {"content": "Managed to get to 30 years so far, can't stop playing, very happy to give 5 stars. Sometimes frustrating the way the cards turn, but that is the best part of the game, it is so clever and yet simple. If they do updates that would just emphasise how great the developers are and how much effort they put into an enjoyable concept and game.\n\nThanks", "rating": "5", "version": "1.0", "date": "2016-08-12T12:42:00-07:00", "title": "Great game"}, {"content": "Good wish there was a restart button", "rating": "5", "version": "1.0", "date": "2016-08-12T11:46:00-07:00", "title": "Good"}, {"content": "I love the game... Once I can get it to open. Sometimes it takes 30 minutes for the app to load, but most of the time it just won't open at all. Really annoying and puts me off trying to play.", "rating": "1", "version": "1.0", "date": "2016-08-12T08:23:00-07:00", "title": "App Won't Open"}, {"content": "I can't recommend this enough. I got my whole family playing it and it's great fun. Fantastic to see who can last the longest too. The cards are interesting as are the scenarios. Well worth the money!", "rating": "5", "version": "1.0", "date": "2016-08-12T07:12:00-07:00", "title": "Excellent purchase"}, {"content": "Excellent and amusing gameplay that's deeper than I expected. Graphics, animation and sound are stylish and it feels great to play. Hope it continues to expand!", "rating": "5", "version": "1.0", "date": "2016-08-12T00:54:00-07:00", "title": "Amazing"}, {"content": "Addictive\nSimple\nContains actual depth!\nBest mobile game in such a log time!", "rating": "5", "version": "1.0", "date": "2016-08-11T23:11:00-07:00", "title": "Fantastic Game!"}, {"content": "Super addictive game, I hope at some point they add more cards, that would be great!! *hint* *hint*", "rating": "5", "version": "1.0", "date": "2016-08-11T19:16:00-07:00", "title": "Fantastic"}, {"content": "A brilliant game I've never come across before on the App Store - definitely recommend", "rating": "5", "version": "1.0", "date": "2016-08-11T16:12:00-07:00", "title": "Love it"}, {"content": "Absolutely amazing game!\n\nHard, fair, and complex storytelling with the backing of solid, crisp gameplay and amazing sound.\n\nA swath of text adventures at your finger tips.", "rating": "5", "version": "1.0", "date": "2016-08-11T13:39:00-07:00", "title": "Been waiting for this for a while"}, {"content": "Been playing continuously pretty much since down loading this game. Interesting decision making game similar to Dictator. This is much better and nicely implemented. \n\nWell worth the couple of pounds for a premium title!", "rating": "5", "version": "1.0", "date": "2016-08-11T13:37:00-07:00", "title": "Card Swiping!"}, {"content": "A very simple interaction has a lot of depth!", "rating": "5", "version": "1.0", "date": "2016-08-11T12:53:00-07:00", "title": "Very good!"}, {"content": "Absolutely loved the game totally worth the money but it does seem to get a bit annoying sometimes when you die for no reason ! All in all a great game and i would recommend it to others !", "rating": "5", "version": "1.0", "date": "2016-08-11T12:52:00-07:00", "title": "AMAZING!!!!!!!"}, {"content": "An absolutely extraordinary game. Simple UI leads the way to an engaging and complex experience that is very charming and entertaining. Great fun at a great price. Devolver has done it again!", "rating": "5", "version": "1.0", "date": "2016-08-11T07:42:00-07:00", "title": "Well worth the wait!"}, {"content": "Love this it looks simple on the outside but has got a lot of depth", "rating": "4", "version": "1.0", "date": "2016-08-11T07:06:00-07:00", "title": "Great little game"}, {"content": "As title suggests, bored after 20 minutes.", "rating": "3", "version": "1.01", "date": "2016-08-13T12:56:00-07:00", "title": "Bored after 20 mins"}, {"content": "I spent a whole day playing this, I'm ded", "rating": "5", "version": "1.01", "date": "2016-08-13T12:37:00-07:00", "title": "👁‍🗨"}, {"content": "Its fun but i cant figure out how to win", "rating": "5", "version": "1.01", "date": "2016-08-13T12:12:00-07:00", "title": "Fun BUT"}, {"content": "Very clever, irreverently funny, a must download!", "rating": "5", "version": "1.01", "date": "2016-08-13T10:50:00-07:00", "title": "Great game"}, {"content": "A good game but my saves seem to corrupt every time I come back to the game after a Ive come off it for a while. But it is fun while I play.", "rating": "4", "version": "1.01", "date": "2016-08-13T10:27:00-07:00", "title": "Corrupt Saves"}, {"content": "Surprisingly addictive. Well made, and engrossing!", "rating": "5", "version": "1.01", "date": "2016-08-13T08:32:00-07:00", "title": "Excellent!"}, {"content": "Best game I've bought in a long time, totally addicting. Although sometimes it is too easy to die!", "rating": "5", "version": "1.01", "date": "2016-08-13T08:23:00-07:00", "title": "Amazing!!"}, {"content": "What a Fantastic game. I was intrigued by the description and idea of this one and had checked a review before paying the price which I was somewhat concerned by. However, I can't recommend this game enough. You have to know what to expect as I fear some people may not appreciate how deep the game is at first glance. Fully recommend going for it though. Already love this one.", "rating": "5", "version": "1.01", "date": "2016-08-13T07:55:00-07:00", "title": "Top quality app"}, {"content": "I love this game. It's not only tricky and fun; it's also pretty funny with some great nerdy references. \nThe gameplay is ludicrously simple...the political game you must play is anything but.", "rating": "5", "version": "1.01", "date": "2016-08-13T07:31:00-07:00", "title": "Simple, clever and addictive"}, {"content": "It's a choose your own adventure rogue like card game full of wit and unexpected twists and turns. Love this!", "rating": "5", "version": "1.01", "date": "2016-08-13T07:20:00-07:00", "title": "Wow!"}, {"content": "This game is legit fun, challenging and just a general good time consuming app. It can be difficult at first but that's the point, making sure your kingdom is kept well but not giving people too much power, so many options. Played for around 3-4 hours and I have only got 1/2 the cards. Only just won a game where I die of old age. Buy this if you want something to pickup and play from time to time!", "rating": "5", "version": "1.01", "date": "2016-08-13T07:01:00-07:00", "title": "Great"}, {"content": "Great, fun little game.", "rating": "5", "version": "1.01", "date": "2016-08-13T06:42:00-07:00", "title": "Addictive"}, {"content": "A waste of money! There is no purpose. I just cannot understand the rave reviews", "rating": "1", "version": "1.01", "date": "2016-08-13T06:33:00-07:00", "title": "Utterly pointless"}, {"content": "But it's also a bit glitchy atm. Will raise to 5 on next update :)", "rating": "4", "version": "1.01", "date": "2016-08-13T05:40:00-07:00", "title": "It's really, really good"}, {"content": "Great game, very entertaining", "rating": "5", "version": "1.01", "date": "2016-08-13T05:09:00-07:00", "title": "Great game!"}, {"content": "I love this game- can't stop playing it even though I'm awful at the game😂.money well spent, if your thinking about buying this game and your looking through the reviews and you come across this one I would say to definitely get this game-DONT EXPECT ACTION AND MOVING A CHARACTER", "rating": "5", "version": "1.01", "date": "2016-08-13T03:27:00-07:00", "title": "Amazing"}, {"content": "So you can play it landscape or portrait, but can't change the landscape orientation, simple thing please fix", "rating": "1", "version": "1.01", "date": "2016-08-13T02:40:00-07:00", "title": "Please fix orientation?"}, {"content": "A choose-your-own-adventure rougelike? Colour me interested!\n\nA rare and clever combination of genres. It's easy to get into and yet has a lot of depth.\n\nWell worth your money IMHO.", "rating": "5", "version": "1.01", "date": "2016-08-13T02:28:00-07:00", "title": "A rare gem of originality"}, {"content": "Simple in design but is great fun\n\nCould use a hard restart to go back to 602bc", "rating": "5", "version": "1.01", "date": "2016-08-13T01:43:00-07:00", "title": "Great game with great potential"}, {"content": "You can't stop playing this game, love it!!", "rating": "5", "version": "1.01", "date": "2016-08-13T01:39:00-07:00", "title": "Hooked!!"}, {"content": "Gets really repetitive after a few kings pass, the same cards keep coming up again and again and gets boring.", "rating": "2", "version": "1.01", "date": "2016-08-13T01:32:00-07:00", "title": "Good game but.."}, {"content": "A wonderful and deep game! I really hope the developers continue to create fun content, it's a truly fantastic game!", "rating": "5", "version": "1.01", "date": "2016-08-13T01:18:00-07:00", "title": "Perfect!"}, {"content": "Starts out simple, then starts messing with you!", "rating": "4", "version": "1.01", "date": "2016-08-13T00:59:00-07:00", "title": "Clever"}, {"content": "I can't stop playing this game! Beautifully put together that plays excellently. Text that has incisive wit and charm. Highly recommended.", "rating": "5", "version": "1.01", "date": "2016-08-13T00:35:00-07:00", "title": "Clever, funny, addictive"}, {"content": "A very interesting game. As king, the wellbeing of your citizens rests on the decisions you make. The consequences carry over from one king to the next and not all is as it seems...", "rating": "5", "version": "1.01", "date": "2016-08-13T00:33:00-07:00", "title": "Great game!"}, {"content": "6/5", "rating": "5", "version": "1.01", "date": "2016-08-13T00:03:00-07:00", "title": "6/5"}, {"content": "You can only swipe right for YES or left for NO. I am expecting questions but get statements like \"You're people are hungry\". That is not a question. How can I answer yes or no to that. Can't see point in game. Worst money ever spent on App.", "rating": "1", "version": "1.01", "date": "2016-08-12T22:24:00-07:00", "title": "What's the point"}, {"content": "Game", "rating": "4", "version": "1.01", "date": "2016-08-12T22:09:00-07:00", "title": "Interesting"}, {"content": "The less said the best, but this is seriously enchanting from start to finish, and back again. Brilliant stuff, great humour and always surprising.", "rating": "5", "version": "1.01", "date": "2016-08-12T15:55:00-07:00", "title": "Fantastic game"}, {"content": "Interesting game", "rating": "4", "version": "1.01", "date": "2016-08-12T15:21:00-07:00", "title": "Interesting game"}, {"content": "Too random to be fun - one bad answer and it's game over.", "rating": "1", "version": "1.01", "date": "2016-08-12T15:15:00-07:00", "title": "Dull"}, {"content": "Good game, not repetitive, well worth the muns", "rating": "5", "version": "1.01", "date": "2016-08-12T15:06:00-07:00", "title": "Sick"}, {"content": "This is a great little bundle of fun. Easy to play but challenging to win. Perhaps future add ons could be released at a premium for further content?", "rating": "5", "version": "1.01", "date": "2016-08-12T15:05:00-07:00", "title": "Innovative, fun and good value"}, {"content": "Definitely worthwhile playing. Awesome fun and ludicrously addictive!", "rating": "5", "version": "1.01", "date": "2016-08-12T14:56:00-07:00", "title": "Seriously fun - really enjoying it!"}, {"content": "This game is great at putting you under pressure and making you seriously think about your choices while managing to also be something while relaxing. Well fun, can't stop playing and trying to stay on the throne!", "rating": "5", "version": "1.0", "date": "2016-08-12T13:58:00-07:00", "title": "Amazing"}, {"content": "Really cool game!\nWould recommend, gets repetitive, however with small details changed.", "rating": "4", "version": "1.0", "date": "2016-08-12T12:45:00-07:00", "title": "Great!"}, {"content": "Managed to get to 30 years so far, can't stop playing, very happy to give 5 stars. Sometimes frustrating the way the cards turn, but that is the best part of the game, it is so clever and yet simple. If they do updates that would just emphasise how great the developers are and how much effort they put into an enjoyable concept and game.\n\nThanks", "rating": "5", "version": "1.0", "date": "2016-08-12T12:42:00-07:00", "title": "Great game"}, {"content": "Good wish there was a restart button", "rating": "5", "version": "1.0", "date": "2016-08-12T11:46:00-07:00", "title": "Good"}, {"content": "I love the game... Once I can get it to open. Sometimes it takes 30 minutes for the app to load, but most of the time it just won't open at all. Really annoying and puts me off trying to play.", "rating": "1", "version": "1.0", "date": "2016-08-12T08:23:00-07:00", "title": "App Won't Open"}, {"content": "I can't recommend this enough. I got my whole family playing it and it's great fun. Fantastic to see who can last the longest too. The cards are interesting as are the scenarios. Well worth the money!", "rating": "5", "version": "1.0", "date": "2016-08-12T07:12:00-07:00", "title": "Excellent purchase"}, {"content": "Excellent and amusing gameplay that's deeper than I expected. Graphics, animation and sound are stylish and it feels great to play. Hope it continues to expand!", "rating": "5", "version": "1.0", "date": "2016-08-12T00:54:00-07:00", "title": "Amazing"}, {"content": "Addictive\nSimple\nContains actual depth!\nBest mobile game in such a log time!", "rating": "5", "version": "1.0", "date": "2016-08-11T23:11:00-07:00", "title": "Fantastic Game!"}, {"content": "Super addictive game, I hope at some point they add more cards, that would be great!! *hint* *hint*", "rating": "5", "version": "1.0", "date": "2016-08-11T19:16:00-07:00", "title": "Fantastic"}, {"content": "A brilliant game I've never come across before on the App Store - definitely recommend", "rating": "5", "version": "1.0", "date": "2016-08-11T16:12:00-07:00", "title": "Love it"}, {"content": "Absolutely amazing game!\n\nHard, fair, and complex storytelling with the backing of solid, crisp gameplay and amazing sound.\n\nA swath of text adventures at your finger tips.", "rating": "5", "version": "1.0", "date": "2016-08-11T13:39:00-07:00", "title": "Been waiting for this for a while"}, {"content": "Been playing continuously pretty much since down loading this game. Interesting decision making game similar to Dictator. This is much better and nicely implemented. \n\nWell worth the couple of pounds for a premium title!", "rating": "5", "version": "1.0", "date": "2016-08-11T13:37:00-07:00", "title": "Card Swiping!"}, {"content": "A very simple interaction has a lot of depth!", "rating": "5", "version": "1.0", "date": "2016-08-11T12:53:00-07:00", "title": "Very good!"}, {"content": "Absolutely loved the game totally worth the money but it does seem to get a bit annoying sometimes when you die for no reason ! All in all a great game and i would recommend it to others !", "rating": "5", "version": "1.0", "date": "2016-08-11T12:52:00-07:00", "title": "AMAZING!!!!!!!"}, {"content": "An absolutely extraordinary game. Simple UI leads the way to an engaging and complex experience that is very charming and entertaining. Great fun at a great price. Devolver has done it again!", "rating": "5", "version": "1.0", "date": "2016-08-11T07:42:00-07:00", "title": "Well worth the wait!"}, {"content": "Love this it looks simple on the outside but has got a lot of depth", "rating": "4", "version": "1.0", "date": "2016-08-11T07:06:00-07:00", "title": "Great little game"}]}