{"data": [{"content": "Snapchat is such a good app! If you haven't already, download it immediately! So great! I love the fact that you can add your very own bitmoji to it and the filters! SUCH A GOOD APP😇", "rating": "5", "version": "10.3.1.0", "date": "2017-03-06T13:52:00-07:00", "title": "Wow. Just wow. 😂😆"}, {"content": "Could you fix my slides chat please it won't clear after I've opened it but I love the app tho", "rating": "5", "version": "10.3.1.0", "date": "2017-03-06T13:52:00-07:00", "title": "Great App BUT..."}, {"content": "Snapchat is by far my favourite app! It has many benefits☺️ But one thing that annoys me is the filters changing a lot. You need to keep all filters on the app or have an option to choose which ones people want. Most of the filters now are rubbish. My favourite ones are the butterflies, crown, white stars, bunny, flower crown and the dog one. So I think you should be allowed to choose what filters you want. If this changes then the app will definitely be worth the 5* rating it deserves😊", "rating": "4", "version": "10.3.1.0", "date": "2017-03-06T13:40:00-07:00", "title": "Good"}, {"content": "I love snapchat. I use it a lot personally but recently I can't seem to use Quick add. I love this feature and would like for it to come back.I had it before the new update (March 2017).", "rating": "4", "version": "10.3.1.0", "date": "2017-03-06T11:45:00-07:00", "title": "Bug..."}, {"content": "Filters never work, no fun. And it crashes a lot.", "rating": "1", "version": "10.3.1.0", "date": "2017-03-06T10:57:00-07:00", "title": "FILTERS NEVER WORK!"}, {"content": "This app is amazing but it would be even better if u\nCould change your\nUsername not just your nickname thank you for \nyour time and effort xx", "rating": "4", "version": "10.3.1.0", "date": "2017-03-06T09:49:00-07:00", "title": "Amazing"}, {"content": "Great app, love the new layout & the performance is great only issue is with the filter. When trying to apply them they simply don't load sometimes this has nothing to do with mobile data or wifi just the app performance.", "rating": "5", "version": "10.3.1.0", "date": "2017-03-06T09:36:00-07:00", "title": "♥️👌🏽"}, {"content": "Doesn't work on a HTC One A9, downloaded on iOS now it freezes", "rating": "1", "version": "10.3.1.0", "date": "2017-03-06T09:30:00-07:00", "title": "Garbage"}, {"content": "saying i've got timers with everyone when i haven't and losing streaks with people but only comes up on my phone, tried deleteing the app but still happens", "rating": "3", "version": "10.3.1.0", "date": "2017-03-06T07:34:00-07:00", "title": "Needs a new update"}, {"content": "You need to make an update to send a notification to the phone to say people are about to lose a streak because it's annoying keep losing streaks and no realising", "rating": "4", "version": "10.3.1.0", "date": "2017-03-06T07:14:00-07:00", "title": "Snapchat"}, {"content": "you cant see anyone elses bestfriends anymore and its annoying , bring them back pls 😿😿😿😿", "rating": "1", "version": "10.3.1.0", "date": "2017-03-06T06:35:00-07:00", "title": "BRING BACK BESTFRIENDS"}, {"content": "My notifications don't come through for my snapchat even tho they r turned on", "rating": "4", "version": "10.3.1.0", "date": "2017-03-06T04:13:00-07:00", "title": "Notifications"}, {"content": "Used to be good but now it isn't. Appalling.", "rating": "1", "version": "10.3.1.0", "date": "2017-03-06T02:39:00-07:00", "title": "Video quality was awful"}, {"content": "I originally reviewed saying great but now filters don't work. It was a friend of mine who told me to activate filters I should now just press/tap once on screen rather than hood as before and voila the filters are up 😀\nSo now I know this I thought I should share. Brill app and yes next time Snapchat guys, please tell app users how to activate filters when an update changes how u get them lol.", "rating": "5", "version": "10.3.1.0", "date": "2017-03-05T23:06:00-07:00", "title": "Updated review 👍😊"}, {"content": "Good 😆", "rating": "5", "version": "10.3.1.0", "date": "2017-03-05T22:04:00-07:00", "title": "Snapchat"}, {"content": "got no use for any app that has a stuck notification bubble and no way to clear it. just bad design.", "rating": "1", "version": "10.3.1.0", "date": "2017-03-05T16:24:00-07:00", "title": "buggy"}, {"content": "I think that snapchat should have some sort of indicator to show when a user was last on snapchat and when they are online to see if you are being ignored", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T15:15:00-07:00", "title": "Online notifications"}, {"content": "Bugs since the last update! Saying I don't have snapchats and I do or it's saying I have Snapchats and I don't! So many more that I can't think of off the top of my head but it's ever since the last update, help!! ❤", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T13:08:00-07:00", "title": "Normally amazing?!"}, {"content": "I love snapchat but for some reason since I updated today I can't watch any videos on stories, discover or that people have sent directly to me 🙃🤔😣😠", "rating": "3", "version": "10.3.1.0", "date": "2017-03-05T12:30:00-07:00", "title": "New Update"}, {"content": "This app is soo good !! Make sure u get it . You don't get hacked that is just a rumour 😇😘🥀🥀", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T12:28:00-07:00", "title": "Best app ever"}, {"content": "Fun app. I only use it for the funny faces but each update, my favourite filters get removed. There needs to be a way to save your favourite filters. Thanks", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T11:06:00-07:00", "title": "There needs to be a way to save your favourite filters"}, {"content": "Always adding great new features to an app I use every day. Only problem is the lag. It's a simple app so I don't expect it to lag and crash as much as it does, it also makes my phone quite hot after using it for a few minutes 😐😟", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T10:41:00-07:00", "title": "Great features"}, {"content": "The latest update needs to be fixed. It keeps glitching and it's not my phone. When you go off a group chat the blue or red or purple icon stays and even when I refresh. It is really slow and buggy and this is the first time I have had to write an update review.   It still hasn't been fixed and it says I have a snapchat when I don't in a group.", "rating": "1", "version": "10.3.1.0", "date": "2017-03-05T10:33:00-07:00", "title": "Fixes needed"}, {"content": "Love the app but recent update keeps kicking me out of the app every time I try to take a photo", "rating": "3", "version": "10.3.1.0", "date": "2017-03-05T07:05:00-07:00", "title": "Needs improving"}, {"content": "I'm using snapchat from about 3 years, i found it very enjoyable because you can communicate with your friends any time you can make live videos and post, using filters, bit mojis, read the latest news and much more. To put it briefly there is everything and everything is perfect eccept one thing; battery, it takes so much battery like if i use it for 1 hr continuously my phone just die and it happens just with the snapchat.....", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T06:39:00-07:00", "title": "Battery!!!"}, {"content": "Following the last few updates, my snapchat camera quality has dropped significantly. It's extremely frustrating when I can't take a decent photo/video. My normal iPhone camera works just fine. Please can you fix this it's really bothering me and I don't enjoy snapchat anymore 😢😢😢", "rating": "1", "version": "10.3.1.0", "date": "2017-03-05T06:27:00-07:00", "title": "Back Camera quality is SOOO badddd"}, {"content": "Update it please. The camera quality is the most awful thing ever!!!", "rating": "1", "version": "10.3.1.0", "date": "2017-03-05T05:06:00-07:00", "title": "Camera quality is awful!!!"}, {"content": "Remove streaks", "rating": "5", "version": "10.3.1.0", "date": "2017-03-05T04:45:00-07:00", "title": "67"}, {"content": "Remove streaks please", "rating": "5", "version": "10.3.1.0", "date": "2017-03-05T04:44:00-07:00", "title": "Remove streaks please"}, {"content": "Really good and fun filters", "rating": "5", "version": "10.3.1.0", "date": "2017-03-05T03:41:00-07:00", "title": "Amazing"}, {"content": "I have to keep reloading and refreshing the app in order for videos to play. This includes stories, snap sent to me and items on the discovery bit. Its incredibly annoying and sometimes the videos don't even play. Fix soon.", "rating": "1", "version": "10.3.1.0", "date": "2017-03-05T03:06:00-07:00", "title": "Videos won't play"}, {"content": "PLEASE LET US CHANGE USERNAMES mine is so embarrassing", "rating": "1", "version": "10.3.1.0", "date": "2017-03-05T02:51:00-07:00", "title": "PLEASE READ"}, {"content": "I love this app, I use it all the time to communicate with friends. However, the \"Featured\" section in stories I find so pointless, and it gets in the way. If there was a way of turning it off then that would be good!", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T02:12:00-07:00", "title": "Great app but few tweaks maybe"}, {"content": "I love using the app I use it everyday but ever since I updated it there is so many glitches. I keep getting notifications when there is no snapchat and sometimes the app opens snaps without me opening it so I don't know what it said. Also since I've updated videos don't play.", "rating": "2", "version": "10.3.1.0", "date": "2017-03-05T01:54:00-07:00", "title": "So many glitches"}, {"content": "I've been trying to do snap streaks for so long but it's not working can you please get bak to me", "rating": "4", "version": "10.3.1.0", "date": "2017-03-05T01:25:00-07:00", "title": "Snapstreak"}, {"content": "Was fine before update but now no video snaps are playing on people's stories. Just comes up a frozen snap of the video. Sort it out plz and thanks in advance Xx", "rating": "4", "version": "10.3.1.0", "date": "2017-03-04T17:06:00-07:00", "title": "Videos won't play"}, {"content": "If you dont want your life ruined do not download this worst thing ever made so addictive and its just pointless", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T16:18:00-07:00", "title": "Do not download !!!!!"}, {"content": "I love snapchat it's my favourite app out of them all. I just have one problem and that is that the sad face filter is not there anymore and I miss it😥 it is my fav filter and now it's not there!! Pls bring it back if you do I will be so so so happy 😊 thankyou so much x", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T15:35:00-07:00", "title": "Bring the sad face filter back!!"}, {"content": "The app is brilliant it works all the time but recently I  haven't been receiving notifications through my phone but as i go on the app there are snaps from people but i didn't get notified about it", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T15:30:00-07:00", "title": "Notifications"}, {"content": "Since I updated the app my filters aren't working, sort it out", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T15:12:00-07:00", "title": "Filters"}, {"content": "I love Snapchat normally but the messages I receive from other people are still valid and unopened after I have opened them or there is noting there to open when I open it. I have logged out deleted the app and re downloaded and it still isn't working - please fix this - I wrote this before it was fixed - it was fixed within 1 hour and I am very pleased", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T13:49:00-07:00", "title": "Ineedsnapchattobefixed"}, {"content": "First I didn't have it! I don't know HOW I survived without it!!🤷‍♀️🤷‍♀️", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T12:00:00-07:00", "title": "Schermazing!👍😂❤"}, {"content": "You need to fix the latest version of the app. Updated today and it's draining the life out of my phone and overheating. Sort it out!", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T11:42:00-07:00", "title": "Bug in the bug fix"}, {"content": "Before on my iPhone 6 the filter (lenses) were working after the new update the filters (lenses) are not working I used to be on snapchat a lot but now there's no filters (lenses) and the app is really boring please try to fix it.", "rating": "3", "version": "10.3.1.0", "date": "2017-03-04T10:57:00-07:00", "title": "Filters ( lenses)"}, {"content": "WASNT RECEIVING CUTE PICS FROM MY BBY STUPID APP", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T10:57:00-07:00", "title": "Even worse"}, {"content": "I think that snapchat is a great way to communicate with your friends. I also think that it is much safer for a 12 year old to use this than Instagram where they really should wait until the age of 13. \nThe only flaw with this is when a notification comes up that a friend had snap-chatted you, it only says that who it is from and not what it says. I think if the message did come up with the name that would be a HUGE improvement to the app.", "rating": "4", "version": "10.3.1.0", "date": "2017-03-04T09:54:00-07:00", "title": "Snapchat is great"}, {"content": "App has just been updated but none of the filters are now available", "rating": "2", "version": "10.3.1.0", "date": "2017-03-04T08:00:00-07:00", "title": "Filters not working"}, {"content": "Very good app i don't have a single problem with it. I use it everyday to contact friends", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T07:56:00-07:00", "title": "Very Good"}, {"content": "💕", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T05:29:00-07:00", "title": "Amazinggg"}, {"content": "This is a great app fun to talk to friends.", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T03:58:00-07:00", "title": "New mate"}, {"content": "I mean, it's not a bad app, it's probably the social media I use the most, it's just so glitchy, it will crash for no reason, kick you off the app, the face filters don't work half the time, but it's an okay app", "rating": "3", "version": "10.3.1.0", "date": "2017-03-04T03:44:00-07:00", "title": "It's okay but"}, {"content": "I used to love snapchat for all the filters, but recently, there has been a new update and snapchat won't even load! Can you please fix this? 😓", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T03:39:00-07:00", "title": "Used to love snapchat..."}, {"content": "I don't know what has happened but after the 2 updates I have realised my camera quality is pretty horrible", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T03:26:00-07:00", "title": "Camera Quality"}, {"content": "We need a notification to tell us when we have a timer with our streaks", "rating": "4", "version": "10.3.1.0", "date": "2017-03-04T03:04:00-07:00", "title": "Streaks"}, {"content": "There keeps being no filters. Why???", "rating": "2", "version": "10.3.1.0", "date": "2017-03-04T02:53:00-07:00", "title": "☹️"}, {"content": "good but the fxcking filters don't work which annoys me because i'm ugly asf", "rating": "3", "version": "10.3.1.0", "date": "2017-03-04T02:51:00-07:00", "title": "FXCKING FILTERS DONT WORK"}, {"content": "The filters have still been rubbish for months. They were better around xmas last year. Atleast then you had more to choose from too. What happened to the yellow&white stars above your head filter?that one was so pretty,now it never comes up and were left with the same ones most days. Then there's the crap ones all the time..who wants to be a banana or a vegetable?theyre not even funny! Just crap and stupid. I'm pretty sure most people would like to have nice filters and maybe ones that actually are funny.", "rating": "3", "version": "10.3.1.0", "date": "2017-03-04T02:27:00-07:00", "title": "Filters"}, {"content": "I've had enough of it now tbh you just deleted my 128 day streak with one of my friends when we was snapping for ages yesterday I woke up and it's gone how's that? Stupid app", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T01:25:00-07:00", "title": "Streaks"}, {"content": "Thanks for fixing the filters ☺️", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T01:18:00-07:00", "title": "Filters are back"}, {"content": "SnapChat is one of my most used apps, it is lots of fun and a great way to keep in contact with friends/family. It's amazing how you can share things onto your story instead of sending it to everyone but you can also block people from seeing your story! Its hilarious seeing the filters and people's bitmoji's, and you can even read the latest news on Buzzfeed, Comedy Central, The Sun and so on. SnapChat even has its own game sort of, named 'streaks' all you need to do is SnapChat someone everyday and they must SnapChat you everyday and by the time you get to doing that for 3 days a number 3 will appear beside their name and the number will get bigger everyday! The only thing that I think SnapChat should have is a button that sends to all of your streaks because that would take a lot quicker. I truly recommend SnapChat as its a well protected app and is a great app too.", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T00:38:00-07:00", "title": "Great App!"}, {"content": "Thank you Snapchat for recognising the latest issue that after you updated it all the filters stopped working!! So thank you Snapchat for recognising this and doing another update 🙂🙂 I am now really happy as I've now got all my filters back 🙂🙂🙂🙂", "rating": "5", "version": "10.3.1.0", "date": "2017-03-04T00:34:00-07:00", "title": "Thank you 🙂🙂"}, {"content": "Face recognition has stopped working", "rating": "1", "version": "10.3.1.0", "date": "2017-03-04T00:25:00-07:00", "title": "Face recognition rubbish"}, {"content": "Glad it's free! How do I save pictures? How do I delete comments? It's crap!!", "rating": "1", "version": "10.3.1.0", "date": "2017-03-03T23:37:00-07:00", "title": "Not good"}, {"content": "I pretty much downloaded snapchat for the filters and now ever since the update they won't load! It's not just me I tried on  a different make/model also! Basically don't download until bugs r fixed!", "rating": "2", "version": "10.3.1.0", "date": "2017-03-03T20:35:00-07:00", "title": "Love the filters"}, {"content": "Past three updates I'm unable to create bitmoji which is annoying being as snapchats worth billions of dollars , otherwise it would be bang on", "rating": "4", "version": "10.3.1.0", "date": "2017-03-03T19:14:00-07:00", "title": "Dissatisfied"}, {"content": "The filters don't loads at all 😩😩😩 it doesn't even recognise faces, it's just looks like it's loading! Please help!", "rating": "1", "version": "10.3.1.0", "date": "2017-03-03T16:23:00-07:00", "title": "iPhone 7"}, {"content": "Filters don't work , support doesn't work big time disappointment", "rating": "1", "version": "10.3.1.0", "date": "2017-03-03T16:15:00-07:00", "title": "Crap app"}, {"content": "Snapchat is amazing the camera quality is amazing and I use it more than my normal camera on my phone. I love everything about snapchat", "rating": "5", "version": "10.3.1.0", "date": "2017-03-03T15:34:00-07:00", "title": "I love it"}, {"content": "Please make an update that you can clear messages that the other person has saved", "rating": "4", "version": "10.3.1.0", "date": "2017-03-03T15:12:00-07:00", "title": "It's good but"}, {"content": "I was having trouble with my filters on Snapchat.(after the update on March 1)....I turned off my phone and turned it on again it still didn't work. I logged out deleted the app etc.. But I must say Snapchat was very quick in fixing the problem🙂 Well done keep it up🙂😉", "rating": "5", "version": "10.3.1.0", "date": "2017-03-03T15:12:00-07:00", "title": "Really fast update to fix the filters amazing!!!!"}, {"content": "None of my filters are now working with the new update. I used to live snapchat but now I never use it as the filters won't work! Get it SORTED!!", "rating": "1", "version": "10.3.1.0", "date": "2017-03-03T15:01:00-07:00", "title": "😡😡"}, {"content": "Since updating the app the filters do not work!", "rating": "2", "version": "10.3.1.0", "date": "2017-03-03T14:58:00-07:00", "title": "Filters not working"}, {"content": "Since I have updated my Snapchat, my filters and face recognition is not working ! The update was to fix bugs and errors not cause them ! Please get it sorted asap 😤😡", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T14:35:00-07:00", "title": "Error in update"}, {"content": "Filters have not worked on my iPhone SE since the last update. Never known it to happen before, have downloaded it again and even logged out and back in, turned my phone off and nothing it's still not working. Please fix this as there's not much in having snapchat without the fun filters.", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T14:33:00-07:00", "title": "filters don't work any more"}, {"content": "Tbh the app is good and all but sometimes I don't get all the filters like the dog one is meant to stay forever but I went for like a couple of days also now I can't even use any of the filters which is rlly annoying but except from that I recommend❤️💯💯", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T14:25:00-07:00", "title": "..."}, {"content": "Since updated to newest version my snapchat filters won't work? Just continues to try register my face, have deleted and reinstalled but same problem?", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T14:17:00-07:00", "title": "Updated yesterday can't use filters"}, {"content": "Filters no longer working with the new update!! Not happy no snapping for me!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T14:12:00-07:00", "title": "Filters not working"}, {"content": "Since the update you tap rather than hold your face to get the filters to work. My filters are still slow though", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T14:12:00-07:00", "title": "New update issues"}, {"content": "I have updated my snapchat and have no filters, can you please sort it sooner rather than later", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T13:52:00-07:00", "title": "Not happy"}, {"content": "Not impressed since Snapchat updated on the 1.3.17 none of my lenses are working, tried all the usual trouble shooting but still not working ☹️", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T13:15:00-07:00", "title": "Not happy"}, {"content": "Since the last update none of the Snapchat filters work", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T13:15:00-07:00", "title": "Update"}, {"content": "can't load filters with new update", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T13:07:00-07:00", "title": "michaela"}, {"content": "Great app i used to use this quite a lot for me and kids and now done the update the filters dont come up anymore like face not recognised x", "rating": "4", "version": "10.3.0.0", "date": "2017-03-03T13:05:00-07:00", "title": "Needs fixing"}, {"content": "Face recognition doesn't work on my iPhone 6s but when I log into my galaxy it works fine.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T13:01:00-07:00", "title": "Face recognition problem"}, {"content": "FILTERS DONT WORK MORONS - IPhone 6s latesr iOS update and sc update and stop removing the fken deer one", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:53:00-07:00", "title": "DID YOU EVEN TEST IT???"}, {"content": "Since i updated the app i cant use filters tried everything, updating my phone, logging off and on, deleting the app and re-downloading it, turning my phone on and off and even tried doing it with the other camera", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T12:47:00-07:00", "title": "Filters have stopped working"}, {"content": "I got the new update a few days ago but now the facial recognition has stopped working. I have an IPhone SE, is anyone else having this problem? -_-", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T12:43:00-07:00", "title": "Filters stopped working"}, {"content": "Filters now not working following update", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:43:00-07:00", "title": "Pointless"}, {"content": "Had another update just but it's still the same - no filters grrrr. Sort it out Snapchat!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:36:00-07:00", "title": "NO FILTERS STILL!"}, {"content": "This app is amazing but needs an update. It doesn't recognise my face anymore therefore the filters don't work.Please fix!", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T12:24:00-07:00", "title": "Needs updating!"}, {"content": "🙄🙄🙄 my Snapchat keeps crashing when I use it for 10 seconds!!!! Fix this please", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:23:00-07:00", "title": "CRASHING PROBLEM"}, {"content": "Very disappointed, filters are not working", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:23:00-07:00", "title": "Where are the filters????"}, {"content": "the filters don't work and face recognition has completely gone after the update !!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:19:00-07:00", "title": "rubbish"}, {"content": "My snapchat isnt working!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:19:00-07:00", "title": "Wont load properly"}, {"content": "Having problems coz of new update my filters are not working and getting notifications no network connection. Wifi is working fine I have o2 network. Please help.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:18:00-07:00", "title": "Having problems coz of new update."}, {"content": "❤️❤️❤️❤️❤️", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T12:17:00-07:00", "title": "Filters work tap the screen once and it will work"}, {"content": "Without the filters what's the point?! Dix it before everyone starts using instagrams version instead!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:12:00-07:00", "title": "Filters no longer work 😡"}, {"content": "There's no Snapchat filters/lenses on the new update. Needs fixing...", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:05:00-07:00", "title": "PROBLEM!"}, {"content": "Since I update snapchat it won't let My do any off the funny face now. Im on phone   And ideas off  getting my funny face back ?", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T12:03:00-07:00", "title": "Update"}, {"content": "Snapchat filters aren't working", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T12:00:00-07:00", "title": "Filters aren't working"}, {"content": "Ever since I did the last update, none of my filters work 😔 usually my favourite app but now can't use it! Please get it fixed asap!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:59:00-07:00", "title": "Frustrated"}, {"content": "Sc needs to bring back being able to see other people's bff's!!!!!!", "rating": "4", "version": "10.3.0.0", "date": "2017-03-03T11:57:00-07:00", "title": "Snapchat best friends"}, {"content": "Since I have updated my Snapchat the filters/face recognition doesn't appear to work? All I get is a Shizam of the music playing in the back ground? Has this replaced the filters?", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T11:47:00-07:00", "title": "Needs to be fixed"}, {"content": "The filters have disappeared since I updated the app :(", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:46:00-07:00", "title": "Filters don't work"}, {"content": "Don't download new update. Ever since I downloaded the most recent update the filters aren't working at all. Please fix", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:44:00-07:00", "title": "Filter problem"}, {"content": "Since the update none of the filters are working!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:40:00-07:00", "title": "Filters not working!"}, {"content": "Not been able to use filters since last update", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T11:39:00-07:00", "title": "...."}, {"content": "I loved all the fun filters❤ \nIPhone automatically updates my apps and have lost all the snapchat filters and the face recognition has broken😫😫😫😫", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:35:00-07:00", "title": "I need them back"}, {"content": "Since Snapchat made the new update I cannot use the filters anymore and as I'm reading through the reviews here a lot of people seem to have this problem. Snapchat shouldn't just ignore this error and should rather do something about it.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:23:00-07:00", "title": "Update"}, {"content": "Keeps crashing.. fix this please", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:20:00-07:00", "title": "Help"}, {"content": "My snapchat isn't working anymore because when I open a chat is still says it's still there and I can't take a video and the filters aren't working I hope they can fix this quickly but it \nstarted happening a couple days ago but either than that I love the app", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T11:10:00-07:00", "title": "Please fix this"}, {"content": "I just started using Snapchat recently and it's awesome!", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T11:03:00-07:00", "title": "Awesome!!!"}, {"content": "Bring back best friends, it would make the app so much better", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T10:58:00-07:00", "title": "Bring it back"}, {"content": "After the recent update the filter have disappeared on my iPhone 6S.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T10:58:00-07:00", "title": "No filters"}, {"content": "The new update of Snapchat is absolutely awful. Constantly crashes and filters won't work at all!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T10:53:00-07:00", "title": "New update"}, {"content": ".", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T10:46:00-07:00", "title": "I can't use filters"}, {"content": "I have always been a big of this app but ever since the last update the filters don't work?! Sort it out snapchat!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T10:31:00-07:00", "title": "Filters!!"}, {"content": "since updating the app i cant get the filters to work", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T10:28:00-07:00", "title": "not working"}, {"content": "It would be a lot easier to use snapchat if we were able to unsend messages. This would be a really useful feature if there is a typo error or if you realise you shouldn't have send what you did! Please can you put this improvement in your next update, thanks.", "rating": "4", "version": "10.3.0.0", "date": "2017-03-03T10:24:00-07:00", "title": "Please make it able to unsend messages!"}, {"content": "Filters was working fine yesterday and now all of a sudden it won't recognise my face at all.. :/ been trying all day..", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T10:23:00-07:00", "title": "Filters.."}, {"content": "Fix this filters are gone after new update!!!!!!!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T10:17:00-07:00", "title": "Filtersssgone!!"}, {"content": "My sc filters aren't working", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T10:09:00-07:00", "title": "Snapstreak"}, {"content": "I love this app so much but I just updated it and they took away the filters!!!! Please add them back, I'm very annoyed.", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T09:56:00-07:00", "title": "So confused"}, {"content": "This latest version is useless, facial recognition has stopped working and this needs to be fixed!\nAlso, i hate the way you calculate bestfriends now, i think most people do and nobody will ever understand it, why dont you give people the choice of the amount of best friends they want like you used to? Sending 3 messages to someone and then seeing them on my best friends is pointless, you end up with about 368383 on there at once and it's annoying - sort it out and fix the issues.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T09:56:00-07:00", "title": "What's going on?!"}, {"content": "Since the update, i can not detect faces on either of my cameras!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T09:53:00-07:00", "title": "Since update"}, {"content": "I have had the same problem as many other people wth their snapchat filters- where you hold down the filters and since the upgrade they haven't been working - however today I found the solution all you have to do is simply tap the screen on your face not hold it down 💗 hope this will help!", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T09:17:00-07:00", "title": "FILTER HELP!!! Read!"}, {"content": "MY SNAPCHAT FILTER WONT WORK!!!! IVE BEEN HOLDING MY FACE FOR AGES BUT NOTHING COMES UP. IVE TRIED DELETING THE APP AND DOWNLOADING IT AGAIN BUT NOTHING HAS CHANGED...😡😤😤😤😤", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T09:07:00-07:00", "title": "SNAPCHAT FILTER WONT WORK"}, {"content": "Everything on Snapchat works but the only thing that takes long to come on and sometimes doesn't is the filters. It doesn't recognise you're face it just keep on loading and loading and it's annoying me, so can u please fix the problem", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T08:53:00-07:00", "title": "Good app but has problems"}, {"content": "Filters dont work", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T08:52:00-07:00", "title": "Normally perfect"}, {"content": "Videos don't play on stories", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T08:45:00-07:00", "title": "Crap."}, {"content": "I love this app but ever since I updated it, my filters aren't working it doesn't recognise my face which is so annoying!", "rating": "4", "version": "10.3.0.0", "date": "2017-03-03T08:21:00-07:00", "title": "No filters"}, {"content": "New update ruined the filters. Won't even show up anymore", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T08:14:00-07:00", "title": "Bad"}, {"content": "Since the last update I have no filters at all.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T07:59:00-07:00", "title": "Filtered out"}, {"content": "I thought snapchat was a brilliant app, my children used to love using the filter... that was until the latest update... I now can't access the filters on my iPhone.", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T07:52:00-07:00", "title": "Not impressed."}, {"content": "Been using snapchat for some time now, but since updating the filters have stopped working/ facial recognition has stopped working. I tried uninstalling then reinstalling but it changed nothing and the filters don't work. So now I have to wait for the next update.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T07:27:00-07:00", "title": "Filters gone :("}, {"content": "My filters have disappeared!!  Please fix asap.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T07:26:00-07:00", "title": "Update"}, {"content": "When snapchat recently uploaded I haven't been able to use filters and neither has me friends why would that be?", "rating": "4", "version": "10.3.0.0", "date": "2017-03-03T07:25:00-07:00", "title": "Upset"}, {"content": "Usually love snap chat but I've recently updated it and the face recognition won't work and neither will the filters.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T07:12:00-07:00", "title": "No filters!"}, {"content": "Ever since I've updated the app my face recognition won't work and I can't use any filters. Also each time I've updated I've lost a streak. I don't know if it's my phone I have the SE. But it's becoming more frustrating.", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T06:55:00-07:00", "title": "Love Snapchat but issues after update!"}, {"content": "Where are my filters, I updated and they are gone?", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T06:41:00-07:00", "title": "Filters"}, {"content": "☹️", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T06:05:00-07:00", "title": "it can't find myself to put a filter on"}, {"content": "After updating to the latest version I noticed that I have no filters anymore.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T06:00:00-07:00", "title": "No filters"}, {"content": "My face is apparently not recognisable anymore! The filters no longer work.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T05:53:00-07:00", "title": "I have no face"}, {"content": "FIX THE FILTERS!!! Updated and now no filters!!!! Happens most times!!!!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T05:45:00-07:00", "title": "Filters"}, {"content": "Since update no face filters work 😡", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T05:33:00-07:00", "title": "Was great till recent update"}, {"content": "Broke my face recognition!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T05:28:00-07:00", "title": "Update"}, {"content": "Since the recent update my lenses won't work only every now and then please get it fixed", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T05:16:00-07:00", "title": "Fix it"}, {"content": "Just have to tap the screen for filters to work! Simple as that! 😁", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T05:02:00-07:00", "title": "Filters Are working! 😄"}, {"content": "Filters do not work anymore since the update", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T04:53:00-07:00", "title": "Filters"}, {"content": "Since you released the update.. my phone no longer recognises facial recognition and the filters no longer appear!! I use the iPhone SE and it seems many people with iOS are having the same problem! Please can you fix it soon!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T04:43:00-07:00", "title": "Filters won't work since update!"}, {"content": "My snapchat filters have suddenly stopped working, any ideas on why this might be?", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T04:35:00-07:00", "title": "Filters"}, {"content": "I enjoyed this app until i did the update yesterday which stopped my filters from working, so a new update to fix that would be appreciated please", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T04:15:00-07:00", "title": "No filters"}, {"content": "That point in life when you just look on point so good & think this is gunna be a good selfie for once !! so I go on snapchat to take the perfect filtered selfie & guess what that's right they don't work 😡 cheers Snapchat thank you very much all this goodness gone to waste stupid update !!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T04:10:00-07:00", "title": "Meh"}, {"content": "Since the update my filters don't work. Deleted, reinstalled and still don't work! Sort it out SC", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T04:06:00-07:00", "title": "No filters!!!!!"}, {"content": "Since I updating Snapchat, it doesn't recognise my face! So I can't use any of the filters. So truthfully you need to get it fixed asap! 🙄😡", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T03:56:00-07:00", "title": "Filter ain't working"}, {"content": "Selfie filters not detecting faces", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T03:52:00-07:00", "title": "Filters not working"}, {"content": "What has happened since the last update it's crashing it's not loading the filters please fix!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T03:36:00-07:00", "title": "Snapchat"}, {"content": "The kids and I loved this app but since the update we can't use the filters. Not good 😠 hope it gets sorted soon.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T03:16:00-07:00", "title": "Disappointed"}, {"content": "Since i updated snapchat my face recognition isn't working so i am unable to get any filters up!!!!!!!!!! I deleted the app and restarted my phone and still nothing!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T03:02:00-07:00", "title": "Filters not working!!!!"}, {"content": "I have an iPhone 6s and I've recently updated snapchat and now my lenses do not work, what should I do? I'm not the only one with this problem. Also, every time I try to report my problem via snapchat it keeps taking me back to the home page!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T03:01:00-07:00", "title": "Lenses have stopped working!!!"}, {"content": "Since the update I can't use the affects. Will change rating to 5* when it's fixed", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T02:54:00-07:00", "title": "Fix the bugs"}, {"content": "Great fun, but now filters dont work after automatic update.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T02:53:00-07:00", "title": "Filters stopped working."}, {"content": "Since the update none of my filters are working! It was a good app until this point!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T02:50:00-07:00", "title": "Filters"}, {"content": "Since I've updated the app the face recognition isn't working so I can't use filters 😔 please fix!!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T02:40:00-07:00", "title": "No filters!!"}, {"content": "The filters with face recognition just does not work. Pointless", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T02:14:00-07:00", "title": "Won't work"}, {"content": "I love this app use it all the time but lately I haven't been able to use the Snapchat filters where you press down with your finger for the different effects please sort it out", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T02:03:00-07:00", "title": "Filters"}, {"content": "Since updating my snapchat it won't recognise my face or bring up the snaps. Fix it immediately please", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T02:01:00-07:00", "title": "Not working"}, {"content": "I have all my locations on and the filters won't turn on, they did once but have now stopped, why you do this to me?", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T01:53:00-07:00", "title": "FILTERS NOT WORKING"}, {"content": "Very disappointed since update my snapchat is not working 👎", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T01:42:00-07:00", "title": "Update"}, {"content": "Snapchat isn't detecting my face so I can't use the filters! Tried downloading again and nothing 😩", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T01:40:00-07:00", "title": "Filters gone"}, {"content": "Since the update it's not detecting my face and the filters are not working!!!! ANNOYING !!!!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T01:39:00-07:00", "title": "What's happened????"}, {"content": "I love this app but I can no longer use the filters... the facial recognition isn't working. I'm on an iPhone 5s, is this going to be fixed soon?", "rating": "3", "version": "10.3.0.0", "date": "2017-03-03T01:37:00-07:00", "title": "Lost my facial recognition"}, {"content": "Snapchat my filters are not working I don't know why please fix it.", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T01:33:00-07:00", "title": "Please fix it the filters"}, {"content": "Ever since I've updated my phone the face filters won't work it won't even recognise my face when I try and get the filters help !!!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T01:27:00-07:00", "title": "Annoyed"}, {"content": "I just did the update and when you hold down on your face to add a filter it doesn't work?!?!?!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T01:11:00-07:00", "title": "Update"}, {"content": "Updated a couple days ago and the filters have disappeared!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T01:01:00-07:00", "title": "Update"}, {"content": "Since the last update the filters have gone!! Not good 😡", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T00:57:00-07:00", "title": "Lost the filters!!!"}, {"content": "Since the latest update my filters don't work!!!!  Get it sorted!!!!😡", "rating": "2", "version": "10.3.0.0", "date": "2017-03-03T00:49:00-07:00", "title": "Latest update!!!!"}, {"content": "It's really One of the best social media apps, which is why Instagram and WhatsApp are copying it.", "rating": "5", "version": "10.3.0.0", "date": "2017-03-03T00:46:00-07:00", "title": "One of the best social media apps"}, {"content": "Don't bother only thing worth using it for", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T00:34:00-07:00", "title": "Filters not working"}, {"content": "Terrible the snapchat update deleted my filters", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T00:19:00-07:00", "title": "The Snapchat Update Deleted filters"}, {"content": "since the new bug fix update my filters wont load now so cant really use the app", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T00:06:00-07:00", "title": "wont work!!!!"}, {"content": "snapchat keeps logging me out everytime come off the app and try to go back in. It unlinks my bitmoji so every time I open the app I have to log in and then recreate a bitmoji. Incredibly annoying. Needs a major fix asap.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-03T00:00:00-07:00", "title": "NEEDS A MAJOR FIX."}, {"content": "Since the update, it's took away the icons i.e. Dog n flower ones!", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T23:59:00-07:00", "title": "Update"}, {"content": "it won't update on my phone it's really annoying as i need it for later on, i have an iphone 5s and a 357day streak i don't want to loose help x", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T23:56:00-07:00", "title": "help"}, {"content": "After the recent update the filters have stopped working completely out the iphone7. It also does not work on my other halfs iphone6 either", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T23:54:00-07:00", "title": "Filters have stopped working"}, {"content": "It will not let me use the face filters when taking a selfie! Xx", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T23:47:00-07:00", "title": "Snapchats new update is rubbish!!"}, {"content": "Since I updated all the filters have disappeared and it doesn't recognise my face anymore😫😫", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T22:55:00-07:00", "title": "No filters"}, {"content": "The whole point of this app is to have fun. But now since the latest update to fix bugs, the filters have gone. Rubbish", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T22:25:00-07:00", "title": "Where are the filters???"}, {"content": "My snapchat won't let me use the filters since updating!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T22:05:00-07:00", "title": "New update!"}, {"content": "My phone heats up while I'm using snapchat and after the new update the filters are gone!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T15:53:00-07:00", "title": "Phone heats up! 😤😡😡😡😡😡😡😡😡"}, {"content": "Snapchat wouldn't let me add a friend, so i logged out and now cannot log back in. Reset password and everything. Friend has also experienced the same problem. Sort it out snapchat!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T15:39:00-07:00", "title": "Disappointed"}, {"content": "Good app but none of my filters are working ?", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T15:37:00-07:00", "title": "Help?!?"}, {"content": "Very disappointed that my lenses have stopped working since the update and snapchat is now unable to recognise my face at all, no matter how long i hold my finger or what lighting. I have an iphone 5s and should be able to do this as normal☹️☹️☹️", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T15:03:00-07:00", "title": "Filters/Lenses not working!!"}, {"content": "Love snap chat but latest update has taken all the little face filters away:( sad times please sort it soon :)", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T15:03:00-07:00", "title": "Where's my face filters gone :("}, {"content": "I got a new iPhone a few weeks ago and the filters worked fine but now the face recognition doesn't work anymore on my iPhone SE!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:51:00-07:00", "title": "Disappointed"}, {"content": "Filters not working.", "rating": "5", "version": "10.3.0.0", "date": "2017-03-02T14:38:00-07:00", "title": "iPhone 7 plus."}, {"content": "To get the snapchat effects you need to only tap once on the screen instead of holding down. Took me a while to realise but I love snapchat anyways.💜🎉😍📱", "rating": "5", "version": "10.3.0.0", "date": "2017-03-02T14:38:00-07:00", "title": "Snapchat effects."}, {"content": "Love snapchat but since the update the filters won't work or appear at all 😪", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T14:35:00-07:00", "title": "Filters don't work"}, {"content": "Current update has stopped at filters working.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:31:00-07:00", "title": "Current update"}, {"content": "I have an up to date phone that supports filters. Two days ago my filters stopped showing up. The white waves went round and round nothing happens. I have tried powering off my phone refreshing the app turning filters off and on but nothing works. I've even redownloaded the app a few times. I've had Snapchat for two years and use it to stay in touch with people. Never failed to disappoint me till the other day", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:27:00-07:00", "title": "Filters not working"}, {"content": "the face recognition isn't working as did the recent update, thinking after a few days it would be fixed but still isn't. please sort this out!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:24:00-07:00", "title": "Recent update"}, {"content": "No filters. Pointless.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:12:00-07:00", "title": "Useless after update!!"}, {"content": "For some reason it no longer recognises my face so none of the filters work?", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:08:00-07:00", "title": "Filters don't work"}, {"content": "It's great 1 of my best apps but since the update, the face  recognition is failing to scan my face, a few of my friends have said theirs don't work either,  this needs to be fixed asap 👍🏻", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T14:04:00-07:00", "title": "Gr8 app but problem after up-date"}, {"content": "Does it f*ck , filter doesn't work crashes when I go on it most of the time , I have an iPhone 7 I expect it to work fine but no 🖕", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:04:00-07:00", "title": "Update - fixes bugs"}, {"content": "When I click on my face, they don't appear 😫", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T14:00:00-07:00", "title": "Filters won't work"}, {"content": "I don't know what's happening, but since the latest update, my filters won't work 😐", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:59:00-07:00", "title": "Filters?"}, {"content": "Can we please see when or what time a friend look at our snap, it will be really great.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:57:00-07:00", "title": "Show time when a friend looks at snap!!"}, {"content": "Generally I think snapchat is great and the filters are a laugh... however I dont understand why snaps disappear but messages remain. Doesnt that defeat the point of 'snapchatting'?", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T13:55:00-07:00", "title": "Snapchatting"}, {"content": "Filters not working since last update!! SORT IT OUT", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:55:00-07:00", "title": "Doesn't work since update"}, {"content": "Most confusing interface I've ever seen. It's horrible 👌", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:50:00-07:00", "title": "A Mess"}, {"content": "Omg I feel like the new update has ruined my filters it's not working and I tried everything to fix it HELP!!!! Plzzzz", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:37:00-07:00", "title": "Why is my filters not working"}, {"content": "Since updating they don't work!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:34:00-07:00", "title": "Filters won't work!"}, {"content": "Normally I love this app but since the latest update the face filters no longer work.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T13:30:00-07:00", "title": "Usually love this app but..."}, {"content": "Face recognition and filters don't work since new update. iPhoneSE user. Fix please :)", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:25:00-07:00", "title": "No face recognition"}, {"content": "Good app but my filters always stop working 🙄 drives me mad ... please fix!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T13:24:00-07:00", "title": "Fix filters!"}, {"content": "Filters not working since update, disappointing!! :(", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:23:00-07:00", "title": "Update killed it!"}, {"content": "since the update none of the filters have been working, thanks snapchat. much appreciated", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:22:00-07:00", "title": "No filters"}, {"content": "Filter are literally not working after the update so disappointing", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T13:22:00-07:00", "title": "Filter"}, {"content": "Of course it's a flop. Go to use a filter and it doesn't work! Sort it out please!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:19:00-07:00", "title": "Fail of an update"}, {"content": "Bring back showing other people's top 3 best friends !!!!😊😊😊", "rating": "4", "version": "10.3.0.0", "date": "2017-03-02T13:18:00-07:00", "title": "Best friends"}, {"content": "Since i updated face recognition won't work.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T13:10:00-07:00", "title": "Update"}, {"content": "All filters have disappeared, no word on why anywhere either.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T12:58:00-07:00", "title": "Update"}, {"content": "Overall, this is a great app but my filters are not working. This has never happened before, fix it ..", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T12:43:00-07:00", "title": "Fix the filters !!"}, {"content": "The latest update carried out today has caused the face recognition to stop working. I've noticed a previous review has pointed this out already, I have the iPhone 6s and it's no longer working on mine either.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T12:39:00-07:00", "title": "Latest update"}, {"content": "Since the latest update I haven't been able to get the filters to load at all. I rely on snapchat to communicate with my friend who moved away, we send loads of silly snaps to cheer each other up but sadly she has had to deal with my unfiltered ugly mug for the last 2-3 days. Sort it out please", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T12:23:00-07:00", "title": "Filters not working"}, {"content": "Please get this sorted. Facial recognition is not working at all", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T12:05:00-07:00", "title": "Filters not working since update"}, {"content": "Since the update I can't get the filters to load :( noticed someone else has the same problem on the same phone. I'm using iPhone se", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T12:02:00-07:00", "title": "Face recognition broken 😭"}, {"content": "Bring them back.\n\nIt's the only thing that keeps me looking cute when I've taken my makeup off and need to snap someone.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T11:57:00-07:00", "title": "Still no god damn filters"}, {"content": "Love snapchat but this update has shagged the face recognition which is what I use the most? I have an iPhone 6", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T11:48:00-07:00", "title": "Broken"}, {"content": "I've lost all my filters after re installing on my phone! Very disappointed:(", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T11:40:00-07:00", "title": "Filters"}, {"content": "The face filters do not work with the new update", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T11:34:00-07:00", "title": "Problems with new update"}, {"content": "Love the app, However since the recent update my filters have disappeared! So now I have to wait!", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T11:26:00-07:00", "title": "Filters disappeared due to update"}, {"content": "Please please please get rid of adverts they are becoming more and more common between stories.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T11:11:00-07:00", "title": "Adverts"}, {"content": "So I've just updated my snap chat and now have no filters! Rubbish", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T11:09:00-07:00", "title": "Poor"}, {"content": "The face recognition doesn't work on my iPhone 5s and I cannot use the filters as normal, I use them very often and quite annoyed they don't work😒", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T11:04:00-07:00", "title": "Filters are broken!!!"}, {"content": "Updated app and since have had no filters.. deleted re downloaded several times still doesn't work.. missing the dog filter.. 🙄", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T11:01:00-07:00", "title": "Rubbish"}, {"content": "No filters following update!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T11:00:00-07:00", "title": "Filters gone!"}, {"content": "I love the app but since the new update filters no longer work, other people have had problems with SE please fix this.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T10:46:00-07:00", "title": "Please help"}, {"content": "You need to put back them sexy filters, where the pretty flower headband thing gone??", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T10:42:00-07:00", "title": "Where's them bhum filters at😴"}, {"content": "'Bug fixes and improvements' \nYeah right. It's soooo glitchy now 😭😭😭", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T10:39:00-07:00", "title": "Ew"}, {"content": "I'm really disappointed that I no long have the ability to use the Filters&lenses since I've updated snapchat! I've tried re-installing the app and restarting my phone but nothing seems to work!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T10:36:00-07:00", "title": "Filters&lenses won't work!"}, {"content": "I updated the app, then the filters stopped working.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T10:26:00-07:00", "title": "Filters Do Not Work"}, {"content": "Updated my snapchat to latest update and now I have no lenses! Why has this happen? Pls fix asap!", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T10:24:00-07:00", "title": "Lenses/filter gone after update"}, {"content": "Best app in the world everything about it is sick", "rating": "5", "version": "10.3.0.0", "date": "2017-03-02T10:23:00-07:00", "title": "Best app"}, {"content": "Love it when it works, just done the update, now facial recognition doesn't work! Please fix!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T10:08:00-07:00", "title": "Please Fix!"}, {"content": "Love snapchat! But the new update has taken all the filters! The face recognition doesn't work! The filters are the only reason I use snapchat 😫", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T09:59:00-07:00", "title": "Sad :'("}, {"content": "Ever since the new update my face filters have not been showing up when i scan my face n its not only me happens to my friends mobile too !!!", "rating": "5", "version": "10.3.0.0", "date": "2017-03-02T09:57:00-07:00", "title": "Bug"}, {"content": "Updated the app and now filters won't work. Rubbish update! Needs fixing \n\niPhone 7", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T09:46:00-07:00", "title": "Filters"}, {"content": "Snapchat filters don't work now. Very slow. This update has made it worse not better.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T09:46:00-07:00", "title": "Rubbish 😡"}, {"content": "My filters are no longer working nothing comes up when i press screen sort it out!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T09:31:00-07:00", "title": "No filters since update"}, {"content": "Since updating to 13.3.0.0 the filters don't work anymore. Snapchat please fix this problem as I love the app and it's filters.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T09:28:00-07:00", "title": "Bug needs fixing"}, {"content": "Updated the other day and now filters don't work not impressed", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T09:23:00-07:00", "title": "Not happy"}, {"content": "Lately I have been having problems with snapchat . When I'm using snapchat it decides to crash and then log me out ( thank God I written down my password ) anyways and when I access snapchat it asks me to access my camera . I click \" yes\" and it takes me to my settings however I can't find the \"access camera \" anywhere . The filters load all of the time and the ones that don't load , don't work at all . When I check people's stories it skips at least 5 and it's super annoying . I can't sc my friends now since I can't let snapchat allow my camera. And another thing snapchat uses a lot of my battery and I can't seem to use it too much as my battery is already weak . Snapchat takes up too much of my battery.", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T09:14:00-07:00", "title": "Great app but needs a fix"}, {"content": "App was great until the most recent update. Since then, the lenses don't work! And neither does face recognition!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T09:02:00-07:00", "title": "Lenses...!"}, {"content": "Since the last update it doesn't work. Filters don't work. Facial recognition doesn't work. Takes ages to load snaps. Sort it out please", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T08:50:00-07:00", "title": "Used to love snapchat but..."}, {"content": "I've been using snapchat for over a year now,never had any problems with it until now. I have the iPhone 6s and I'm not sure if other iPhone users are having the same problem,but whenever I want to use the face filters it doesn't detect my face and I can't use it even when I use the back camera.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T08:49:00-07:00", "title": "My filters aren't working☹️"}, {"content": "Filters not working on new update on my iPhone 6s :(", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T08:46:00-07:00", "title": "Filters:("}, {"content": "Whenever I use filters it forces my phone to turn off and can only be turned back on when I plug a charger in ,even when the battery is at 100%. This is the only app that will do this to my iPhone.?", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T08:44:00-07:00", "title": "Forces phone to shut down."}, {"content": "The filters aren't working🙄 and it seems everyone else has this issue as well...", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T08:35:00-07:00", "title": "Filters?"}, {"content": "The filters won't work😕😕", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T08:35:00-07:00", "title": "No filters"}, {"content": "Love this app and even a while back paid for some of the extra filters before charges were stopped and now they've all disappeared. One minute it was working and the next it's not. The face recognition has stopped working. Now I'll have to wait until the next update!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T08:34:00-07:00", "title": "Filters gone"}, {"content": "Loster02 your not on your own! My filters also don't work since update! Not a happy gal, 😥", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T08:20:00-07:00", "title": "Filters don't work :("}, {"content": "I updated the app and since then the face lenses will not work I'm upset about this and hoping it is fixed soon 🙁", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T08:07:00-07:00", "title": "Lenses"}, {"content": "Snapchat was working perfectly prior to updating it. However now the facial recognition feature doesn't work and I can't use any of the filters.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T08:03:00-07:00", "title": "New Update"}, {"content": "First time i have ever updated Snapchat and there are no filters. Besides that still my favourite", "rating": "4", "version": "10.3.0.0", "date": "2017-03-02T08:01:00-07:00", "title": "What has happened to the filters ???"}, {"content": "Last update has broken it and now no facial filters can be used", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T07:41:00-07:00", "title": "Needs a update to fix it"}, {"content": "My Snapchat filters stopped working! I deleted the app,my OS is updated and the filters doesn't work.. For this reason I have to stop using as there's no point to keep it anymore. 👎🏻👎🏻 I'm Very upset", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T07:30:00-07:00", "title": "Disappointed"}, {"content": "Lost the face recognition since the update", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T07:30:00-07:00", "title": "Nope"}, {"content": "Since the new update, I cannot access any filters! Please fix.", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T07:28:00-07:00", "title": "Can't access filters"}, {"content": "Yesterday I updated my snapchat and today I cannot use the filters as it will not recognise my face. My friend said that she is having the same problem ,is there anything you can do to help?", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T07:26:00-07:00", "title": "No filters since update"}, {"content": "Last time I updated the app the camera would stay black when I opened snapchat and the button to take a picture doesn't work I have to close the app to make it work this wasn't fixed in the new update.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T07:06:00-07:00", "title": "Bad"}, {"content": "I love this app but ever since I've updated, I can't use the filters anymore no matter how I angle the camera!! Fix this please!", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T07:04:00-07:00", "title": "Updated the app and now my filters are gone???"}, {"content": "This app is amazing, but ever since I updated it the filters don't work! I have tried logging out and back in and I have also tried downloading it again but I still doesn't work, this needs to be sorted xx", "rating": "5", "version": "10.3.0.0", "date": "2017-03-02T06:55:00-07:00", "title": "Some problems!!!"}, {"content": "The app is very slow on my 7 plus, it also freezes etc. Needs improvements.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T06:08:00-07:00", "title": "needs major bug fixes"}, {"content": "Since the recent update my facial recognition isn't working. Disappointing.", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T06:04:00-07:00", "title": "Snapchat"}, {"content": "Love this app but since the update the filters won't work! The face recognition doesn't pick up! :( x", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T05:48:00-07:00", "title": "Boss but..."}, {"content": "Update for bug fix and now there's no filters. Rubbish", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T05:43:00-07:00", "title": "I'd have given it zero if I could"}, {"content": "Since the upgrade the face recognition is no longer working, so I am unable to use the filters.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T05:34:00-07:00", "title": "Bugs in the upgrade"}, {"content": "Since updating this morning, can't do anything! Shocking!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T05:21:00-07:00", "title": "Update"}, {"content": "Updates always make Snapchat slower & now I can't get any filters as the face recognition doesn't work!! This app is getting worse", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T05:10:00-07:00", "title": "Rubbish"}, {"content": "Since 'upgrading' face recognition is broke and no filters even appear! Happening to a lot of people sort it out 🤔", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T05:02:00-07:00", "title": "Downgrade"}, {"content": "Filters and face recognition not working since update.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T04:46:00-07:00", "title": "Please fix!!"}, {"content": "Filters don't work with latest update- using iPhone SE - not happy at all", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T04:44:00-07:00", "title": "New update not good"}, {"content": "Absolutely love Snapchat, but after updating my Snapchat last night none of my filters work and will not even recognise my face! Please fix ASAP!😫", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T04:36:00-07:00", "title": "Filters are broken!"}, {"content": "Face recognition doesn't work anymore on my iPhone 5", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T04:16:00-07:00", "title": "Filters don't work"}, {"content": "Since last update the snapchat filters aren't working!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T03:47:00-07:00", "title": "Not working"}, {"content": "Filters are not working anymore, its pissing me off", "rating": "3", "version": "10.3.0.0", "date": "2017-03-02T03:37:00-07:00", "title": "Filters missing 😒"}, {"content": "How rubbish!!! What's the point of snapchat now?!?! meh!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T03:35:00-07:00", "title": "Update has removed all the filters"}, {"content": "The filters have vanished and my bitmoji keeps disappearing? This has been since the latest update? I don't wanna see my face without some strange filter half covering it 😱", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T03:11:00-07:00", "title": "Filters have gone?"}, {"content": "Updated to the newest version yesterday and suddenly the filters don't work!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T02:58:00-07:00", "title": "Filters"}, {"content": "Had an update last night for snapchat on my iphone 6 and now my filters have gone! Wtf... sort it out already 😡", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T02:49:00-07:00", "title": "Wheres my filters!!!"}, {"content": "Since updating, this version of the app has no face filters. The app is scanning for my face but it clearly isn't working because it cannot find my face to show me the filters.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T02:35:00-07:00", "title": "No Filters"}, {"content": "I want my filters!! I look awful with out them 😭😭", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T02:34:00-07:00", "title": "No filters"}, {"content": "Since the last update there are no filters.  Surely that's what this app is for ?!?!?!?", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T02:20:00-07:00", "title": "AGHHH"}, {"content": "After this current update for bug fixes all filters have disappeared!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T01:56:00-07:00", "title": "Filters?"}, {"content": "????", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T01:52:00-07:00", "title": "Why don't my filters work?"}, {"content": "Since the latest up date my filters don't work at all, I've tried deleting and reloading, and still nothing :(", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T01:32:00-07:00", "title": "Filters not working"}, {"content": "Filters don't work! Need a new update to sort this out!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T01:24:00-07:00", "title": "Awfullll"}, {"content": "WHERE HAVE THE FILTERS GONE!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T01:11:00-07:00", "title": "Filter have disappeared?!?"}, {"content": "Filters stopped working after last update", "rating": "2", "version": "10.3.0.0", "date": "2017-03-02T01:01:00-07:00", "title": "Filters"}, {"content": "Since the new update filters aren't working 😭", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T01:01:00-07:00", "title": "Hmm"}, {"content": "Filters not working after new update", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T00:53:00-07:00", "title": "Filters"}, {"content": "Since the new update my filters don't work 😢but great when it's all working", "rating": "4", "version": "10.3.0.0", "date": "2017-03-02T00:29:00-07:00", "title": "Filters"}, {"content": "I love Snapchat, it's one of my favourite apps. But recently I've noticed that face swap has gone? I love faceswap more than any filter on the app as it's so funny to use with family and friends. So please put it back!", "rating": "4", "version": "10.3.0.0", "date": "2017-03-02T00:23:00-07:00", "title": "Where's Face Swap?"}, {"content": "Short and simple review. This app has become 🐶💩.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T00:16:00-07:00", "title": "Oh dear"}, {"content": "Filters aren't working with the next update", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T00:15:00-07:00", "title": "Bad update"}, {"content": "Filters aren't working 😐", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T00:15:00-07:00", "title": "Latest update..."}, {"content": "Filters no longer working since update!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-02T00:04:00-07:00", "title": "????!!!!"}, {"content": "Brilliant", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T23:34:00-07:00", "title": "Snapchat"}, {"content": "So I had my hair curled today and I wanted to take a selfie with the dog filter. The filters wouldn't come up!!! I was so annoyed because I always use sc. fix it nowwwww", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T23:29:00-07:00", "title": "FILTERS BROKE"}, {"content": "filter wont scan my face, the camera quality is bad and also streak number keep disapearring and only come when you message the person in chat form", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T22:52:00-07:00", "title": "streaks&filters"}, {"content": "I love snapchat it is so cool and fun it is also very attractive I got my family into snapchat and now they can't leave it alone there is only one issue with it sometimes it take like half an hour to load a effect but however it is very fun keep it up", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T22:31:00-07:00", "title": "Keep it up"}, {"content": "Since the last update the filters for your face has gone", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T22:24:00-07:00", "title": "Terrible"}, {"content": "Nudes only last for 10 seconds. No way I can finish in that time.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T19:11:00-07:00", "title": "Awful"}, {"content": "FILTERS NOT WORKING!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T17:43:00-07:00", "title": "Snapchat"}, {"content": "Updated today and now filters don't work", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T16:43:00-07:00", "title": "Emmmmmaaaaaa"}, {"content": "Videos will not play !!! Neither on private or my story videos!!!! Do something !!!! I cannot watch any !!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T16:15:00-07:00", "title": "HELP"}, {"content": "Ever since you did a update my filters dont work?!?? I love snap chat but right now its only a 1* but i marked it 5 as normally great.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T16:08:00-07:00", "title": "Filters"}, {"content": "After the newest update I have lost all the filters it just keeps scanning my face", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T15:42:00-07:00", "title": "Lost filters!!!"}, {"content": "Since the update my filters don't work! Sort it ooouuttt!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T15:37:00-07:00", "title": "Filters are gone"}, {"content": "All filters gone. Sort it out😘!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T15:34:00-07:00", "title": "Poo"}, {"content": "since latest update, lost all the filters. fix it", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T15:23:00-07:00", "title": "all gone"}, {"content": "This app gets worse and worse with every update. The search bar at the top is SO annoying and pointless! Remove it. And my camera quality has gone so bad in the recent updates like wtf", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T15:17:00-07:00", "title": "Pointless s***"}, {"content": "No filters now since update???", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T15:06:00-07:00", "title": "Nooooooooo"}, {"content": "My filters won't work :(", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:51:00-07:00", "title": "Filters"}, {"content": "Lost all filters since update. It scans but doesn't recognise any face.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:42:00-07:00", "title": "Poor update"}, {"content": "Since the new update today I have lost all my filters. It's a shame because it's my favourite app! Please fix this! :(", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:40:00-07:00", "title": "FILTERS"}, {"content": "Where the filters? One of the best thing about snap an there gone apps gunna have to go ✋🏼", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:28:00-07:00", "title": "Filters"}, {"content": "The filters don't work anymore !!!😭😭😭", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:10:00-07:00", "title": "TERRIBLE"}, {"content": "Since update the camera doesn't scan my face and no filters appear on iPhone SE.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:10:00-07:00", "title": "No filters"}, {"content": "The new Shazam feature is absolutely atrocious, every single time I try to do something I get an annoying notification from Shazam telling me what song I'm listening to.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:08:00-07:00", "title": "Shazam on snapchat"}, {"content": "None of my filters work like it'll scan my face but not bring up any filters", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T14:08:00-07:00", "title": "Filters"}, {"content": "The most recent update for snapchat is terrible 😡 I can no longer get any filters even though it tries to scan my face! Such a disappointment.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:07:00-07:00", "title": "New Update"}, {"content": "Filters were the best part and they no longer work. Wish I never updated!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T14:05:00-07:00", "title": "Awful"}, {"content": "Since the new update I have lost all my filters 😩", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T13:54:00-07:00", "title": "No filters"}, {"content": "After the latest update, it doesn't show any of the filters at all! Please fix this!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T13:53:00-07:00", "title": "Too bad"}, {"content": "Rubbish, filters are gone with no warning.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T13:47:00-07:00", "title": "Filters"}, {"content": "When I first updated my filters where fine now they just scan my face but don't come up", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T13:46:00-07:00", "title": "Filters just stopped working"}, {"content": "Snapchat filters have gone😩 can't have any of the filters that change your face", "rating": "3", "version": "10.3.0.0", "date": "2017-03-01T13:37:00-07:00", "title": "Okay"}, {"content": "I have lost all my filters 😭😰", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T13:37:00-07:00", "title": "NO FILTERS 😭"}, {"content": "Don't understand why it updated now the other faces don't work like before . Pathetic", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T13:35:00-07:00", "title": "Missy p"}, {"content": "Updated today and now no face recognition so no filters!!! Love snap chat but this needs sorting asap!", "rating": "4", "version": "10.3.0.0", "date": "2017-03-01T13:33:00-07:00", "title": "DON'T UPDATE. LOSS OF FILTERS"}, {"content": "Love snapchat but where have the filters gone???", "rating": "4", "version": "10.3.0.0", "date": "2017-03-01T13:32:00-07:00", "title": "Filters?!?!"}, {"content": "Since updating I have lost all the face filters !! Don't update !! Hurry up snapchat and fix this!!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T13:11:00-07:00", "title": "Don't update"}, {"content": "Since this update my filters will not work. Can we undo the update?!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T13:08:00-07:00", "title": "Filters lost after update!!"}, {"content": "Every time Snapchat updates on my phone my filters go. Now I have to wait for it to update again till I get them back. Other than that I really like this app.", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T13:02:00-07:00", "title": "Updates"}, {"content": "It keeps on crashing after the new update. I'm on IOS 10 as well. FIX ASAP", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T12:57:00-07:00", "title": "WTF KEEPS CRASHING"}, {"content": "Snapchat is the best app i use but theres only one thing missing. Being able to change your username!! Please make an update were we can change our usernames!!", "rating": "4", "version": "10.3.0.0", "date": "2017-03-01T12:55:00-07:00", "title": "Missing a star"}, {"content": "overall it is a really good app and i go on it loads but my group chats aren't working and i think this a problem snapchat need to fix", "rating": "4", "version": "10.3.0.0", "date": "2017-03-01T12:53:00-07:00", "title": "OVERALL"}, {"content": "Snapchat is a great communication device and I love it dearly,however I have recently updated it and the filters have suddenly stoped working.If this could be resolved that would be great.👌🏻", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T12:47:00-07:00", "title": "Amazing however..."}, {"content": "I no longer have snapchat filters since the new update (march 1st) :(", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T12:37:00-07:00", "title": ":/"}, {"content": "I thought the filters on the app snapchat is awesome I love them because each day the filters are different and it is ace🙂🙂", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T12:07:00-07:00", "title": "Astonishing App"}, {"content": "Great social media, maybe add in story notifications so you can see when people put stuff on when you turn their notifications on", "rating": "4", "version": "10.3.0.0", "date": "2017-03-01T11:49:00-07:00", "title": "Story"}, {"content": "Please Snapchat I recently upgraded my Snapchat however the filters have stopped working no matter what angle I place it in or the amount of times I have to hold on to the screen so please sort that out.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T11:46:00-07:00", "title": "Fix the filters!!! 😡"}, {"content": "Can you please fix the bug that has now appeared on my app.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T11:45:00-07:00", "title": "Since update on 28 Feb it's not working properly"}, {"content": "It will not let me use the filters so I'm not sure what happened there👎", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T11:44:00-07:00", "title": "Problem"}, {"content": "Ever since the update my face filter hasn't been working and I've got a good phone and when I just fished the update it doesn't work !!! Snapchat get ur **it together", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T11:15:00-07:00", "title": "Wow"}, {"content": "After an update today Snapchat doesn't work at all!! Not just me but all of my Snapchat friends are experiencing the same. Helllllp get us back online!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T11:13:00-07:00", "title": "What have you done???"}, {"content": "used to love snapchat i updated it yesterday and all the filters have disappeared i hold down to try see the filters and nothing shows, whats going on where have all my filters gone like seriously sort it out.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T10:45:00-07:00", "title": "filters"}, {"content": "My snapchat filters have all disappeared since the latest update :-(", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T10:44:00-07:00", "title": "Filters"}, {"content": "Used to love snap chat. Since the update my filters have all disappeared. Deleted the app now. Stay away", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T10:24:00-07:00", "title": "Not worth 1 star"}, {"content": "Since the latest update I've lost all filters. Please fix", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T10:24:00-07:00", "title": "No filters :("}, {"content": "After the newest update, it takes so long for snapchat to recognise my face and so i have to wait a long time just to have the filters. Fix the asap", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T10:14:00-07:00", "title": "about the filters"}, {"content": "There should be a send to all friends button where you could send a snap to all your friends without tapping on everyone's name in your list which takes forever if you have a lot of friends", "rating": "3", "version": "10.3.0.0", "date": "2017-03-01T10:11:00-07:00", "title": "Good app but needs one thing is missing"}, {"content": "The app overall is really good, but since i have updated the app to its latest version the face recognition has completely broken. I use snapchat on my Iphone SE, so im not sure if other phones have the same issue. I have re-installed the app but face recognition is still broken and i still can't get the filters to come up :(", "rating": "3", "version": "10.3.0.0", "date": "2017-03-01T10:03:00-07:00", "title": "Filters won't work :("}, {"content": "When I go to send a video it won't let me, I can't use filters and when I open a snapchat it stays unread", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T10:03:00-07:00", "title": "Snapchat is broken!!!!!"}, {"content": "I logged on today to find my filters have gone :( hope this is just a bug ?", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T10:02:00-07:00", "title": "Filters ?"}, {"content": "Some of the videos don't play and it's annoying and it's hard to know what's happening 🤕", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T09:57:00-07:00", "title": "Wth"}, {"content": "So annoying", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T09:48:00-07:00", "title": "FILTERS don't work"}, {"content": "Great when it works every time i update it i cant get any filters nothing works 😝😝😝😝😝😝😝😡", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T09:47:00-07:00", "title": "Terrible at times"}, {"content": "Can you bring the feature where you can see other people's best friends back please, it's needed desperately in some situations and was possibly the best feature ever made on this app. Please please bring it back !", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T09:43:00-07:00", "title": "Bestfriends"}, {"content": "I just updated and now can't use it as the camera no longer recognises there is a face there", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T09:38:00-07:00", "title": "Stopped working"}, {"content": "For some reason, the updated version, as of w/c 27/02/2017, my snapchat has no filters. When I press and hold, I only see Shazam? Even with no song playing.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T09:38:00-07:00", "title": "No filters"}, {"content": "Why have I no filters since updating it", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T09:33:00-07:00", "title": "No filters!"}, {"content": "It won't track my face at all. \nI've taken my glasses off, pinned back my fringe and stood in 3 different lightings, in 4 different positions", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T09:23:00-07:00", "title": "It won't track my face"}, {"content": "Only installed half way. Now can't delete or install.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T09:19:00-07:00", "title": "Doesn't work"}, {"content": "Love it", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T09:17:00-07:00", "title": "Great"}, {"content": "snapchat constantly opens snaps automatically and it also crashes - please fix this its seriously annoying !!!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T09:09:00-07:00", "title": "needs improvement"}, {"content": "I love the app, it looks cool, great features. My only problem with the app is that it doesn't always show the Snapchat streak I have with myself. I have to send a snap to myself to refresh it. Otherwise no problems.", "rating": "4", "version": "10.3.0.0", "date": "2017-03-01T09:04:00-07:00", "title": "Great, but..."}, {"content": "So I can't get any of the snap filters anymore. Pressing on my face does nothing...!!! Sort it out...!!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T08:49:00-07:00", "title": "Doesn't work"}, {"content": "I updated the app when it first came out and no face filters appear? Numerous others have experienced this.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T08:48:00-07:00", "title": "Filters???"}, {"content": "My filters are not working since I updated", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T08:45:00-07:00", "title": "Blaaaa"}, {"content": "I love this app I have been using it for about 3 years now every update get better", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T08:07:00-07:00", "title": "Amazing app"}, {"content": "After the update today I can't access any filters 😔", "rating": "4", "version": "10.3.0.0", "date": "2017-03-01T08:03:00-07:00", "title": "Love but..."}, {"content": "As soon as I updated the app, the filters have stopped working for me and idk why?", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T07:58:00-07:00", "title": "Ugh"}, {"content": "Since updating today all my filters have disappeared!", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T07:54:00-07:00", "title": "No filters!"}, {"content": "Nothing is working anymore, filters not showing up at all", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T07:34:00-07:00", "title": "Terrible update"}, {"content": "Do not update your Snapchat. Mine updated itself and now none of the filter / lenses work! They won't even show up", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T07:08:00-07:00", "title": "New update"}, {"content": "After I did this update all of my snapchat filters wouldn't show up! I'm on a iPhone 5s and they previously worked before the update please sort it out!!", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T06:02:00-07:00", "title": ":("}, {"content": "They need to make it a permanent filter. Snapchat is always crashing no matter how many times you re download. Need an easer for the drawing. Need more geofilters in locations. But it's funny app especially if you're snapchatting your best mate", "rating": "3", "version": "10.3.0.0", "date": "2017-03-01T05:49:00-07:00", "title": "Butterfly filter.."}, {"content": "Since updating my filters such as the dog face don't work. It won't even recognise on my face", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T05:46:00-07:00", "title": "Update"}, {"content": "The latest update has broken or removed the filters.", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T05:11:00-07:00", "title": "Broken filters"}, {"content": "I updated the app last night 28th feb. and now my filters won't work, I just get the loading sign when I tap and hold my face.", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T04:49:00-07:00", "title": "Filters"}, {"content": "New update to Snapchat isn't working properly", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T03:23:00-07:00", "title": "Problem"}, {"content": "Face detection not working can't active moods", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T03:02:00-07:00", "title": "Face detection not working"}, {"content": "Doesn't work since the update. Filters were slow before but they are non existent now ..just loads and loads and doesn't work! Rubbish", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T03:01:00-07:00", "title": "Not working"}, {"content": "New update is awful. Filters dont work", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T02:57:00-07:00", "title": "Awful"}, {"content": "Since the last update it will no longer recognise faces?!", "rating": "5", "version": "10.3.0.0", "date": "2017-03-01T02:09:00-07:00", "title": "Stopped recognising face!!"}, {"content": "I am very disappointed in that fact that snapchat always talks about the kardashians. Why do you do this ? Do you want us to idolise them ? I'm sick of seeing kyLIE jenners face every time I go on cosmopolitan or people , it's so annoying and makes me want to delete the app , do you not wonder how this makes younger girls feel , young girls who believe that these beauty standards are attainable but then realise they are not and hate themselves . You widely flaunt their medically enhanced bodies and the titles are about health and fitness , it's setting unrealistic beauty standards to girls and women everywhere . Not cool .", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T01:18:00-07:00", "title": "Disappointed"}, {"content": "No filters on the new update?", "rating": "1", "version": "10.3.0.0", "date": "2017-03-01T01:01:00-07:00", "title": "Mr"}, {"content": "Since the latest update the filters are no longer working. 😔", "rating": "2", "version": "10.3.0.0", "date": "2017-03-01T00:20:00-07:00", "title": "Filters not working 😒"}, {"content": "This happened way too many times now since IOS10 came out. Every couple times theres an update the filters don't work at all and Snapchat needs another update to fix it. Annoying!", "rating": "2", "version": "10.3.0.0", "date": "2017-02-28T23:54:00-07:00", "title": "Filters dont work!"}, {"content": "Recent update have lost filters that change your face e.g. Dog face click in it and no filters", "rating": "1", "version": "10.3.0.0", "date": "2017-02-28T14:53:00-07:00", "title": "Lost filters"}, {"content": "It's terrible, Snapchat is good though", "rating": "2", "version": "10.3.0.0", "date": "2017-02-28T14:29:00-07:00", "title": "Don't update! Filters stop working!"}, {"content": "The face recognition for the filters isn't working, WHAT IS EVEN THE POINT", "rating": "1", "version": "10.3.0.0", "date": "2017-02-28T13:08:00-07:00", "title": "Filters not working"}, {"content": "Since todays update I've lost all my filters it's scanning for my face but not showing any filters at all", "rating": "1", "version": "10.3.0.0", "date": "2017-02-28T13:00:00-07:00", "title": "new update"}, {"content": "THE ADVERT MAKES ME WANT TO SCREAM AND CRY-\n\nDhhdjdjdjlowjdjdjdjdjdjd\n\nGreat app tho- :D", "rating": "4", "version": "10.3.0.0", "date": "2017-02-28T10:35:00-07:00", "title": "Cringe"}, {"content": "Problem with the group chats, need updating as it always tells me i have a notification even though i don't. Sort it please", "rating": "3", "version": "10.3.0.0", "date": "2017-02-28T10:15:00-07:00", "title": "GC ERROR"}, {"content": "I was extremely dissatisfied with the Snapchat as my 99 day streak did not go up even tho me and my bud sent stuff multiple times back and forth and nothing happened therefore Snapchat is blocking us from gaining the ultimate life goal the 100 day streak", "rating": "1", "version": "10.2.0", "date": "2017-02-27T23:27:00-07:00", "title": "Would give it 0 stars if I could"}, {"content": "At first I thought my wifi was acting up, turns out it's fine. It's just Snapchat won't let me use chat to send messages, I have to send actual snapchats to talk to people. Even then, I don't get notifications. This needs fixing. Not happy.", "rating": "1", "version": "10.2.0", "date": "2017-02-27T19:13:00-07:00", "title": "Bad update"}, {"content": "i have a lot of streak and i have that many, when i send my streaks out i press recents and select all my streaks on there and then it doesn't include some so i have to go through all my contacts and it's annoying so i think snapchat should add a button where you can take a picture and then when you press the button it will select all your streaks and then you can select anyone else or like un select people from it almost like a group chat but not and then it will send to all your streaks without you going through all the contacts \n\ni hope you read this and thanks for taking the time to do so", "rating": "5", "version": "10.2.0", "date": "2017-02-27T17:11:00-07:00", "title": "SOMETHING NEW TO ADD"}, {"content": "Hey, I use Snapchat a LOT, daily. Its really good, really fun to use for chatting and sending stuff on. The only problems i have with it is that: 1) \n\nit takes up wayyy too much storage. It takes up at least 1GB of memory and I keep having to reinstall it to free up that space again. \n\n2) The other problem I have with it, is that it takes up a crap load of battery when you use it too, you could be at 100% and at 40% by the time you have opened snapchat for 5-10 minutes, which I believe is absurd. Sometimes you have to turn your phone off and on again so the battery comes back. \n\n3) The new bitmoji thing is really annoying and cringey as heck\n\nBut apart from those, the app is pretty good.", "rating": "3", "version": "10.2.0", "date": "2017-02-27T14:56:00-07:00", "title": "too much storage"}, {"content": "Every time I type in my verification code for my account it just shuts the app down!!! Fix this now!!", "rating": "1", "version": "10.2.0", "date": "2017-02-27T11:45:00-07:00", "title": "FIX!!"}, {"content": "Your app is a piece of sh*t", "rating": "1", "version": "10.2.0", "date": "2017-02-27T11:37:00-07:00", "title": "Shiii"}, {"content": "I would rate it 5 stars, but my camera quality on snapchat is so poor considering I have an iphone6, why doesn't it work and why is it such low quality!? Please fix this it's really bugging me. Can't even take mirror selfies because they're so blurry", "rating": "4", "version": "10.2.0", "date": "2017-02-27T10:56:00-07:00", "title": "Great"}, {"content": "I made my snapchat username a while ago and I really want to change my username as it's rather silly / cringey but I don't want to make a new account from scratch. This would be really helpful if you could do this. \nThanks :)", "rating": "4", "version": "10.2.0", "date": "2017-02-27T10:21:00-07:00", "title": "Please put a \"change username\" setting"}, {"content": "Bring back being able to see when someone last posted a snap to they're story. With the new update where you press and hold to see someone's profile, you can no longer see when someone last posted a snap which is really annoying, as this was more useful than being able to see someones profile!!! Also the seconds of a story and being able to see best friends should make a return. Sometimes sending text snaps to people constantly fails and the app sometimes crashes other than that the app is fine.\n\n***\nKeeps causing my phone to die at any charge when i open the app", "rating": "1", "version": "10.2.0", "date": "2017-02-27T02:10:00-07:00", "title": "\"Posted ___ minutes ago\""}, {"content": "Honestly what is happening none of the videos play and people say they can't see my story 😩", "rating": "3", "version": "10.2.0", "date": "2017-02-27T02:06:00-07:00", "title": "NONE OF THE VIDEOS PLAY"}, {"content": "Keeps removing friends and not re-adding them back it's really annoying !!!!!", "rating": "2", "version": "10.2.0", "date": "2017-02-26T23:57:00-07:00", "title": "Sort your app out !!!"}, {"content": "Whenever I try and open my memories it will crash after a few seconds. Other features work fine though .. 😔", "rating": "1", "version": "10.2.0", "date": "2017-02-26T23:28:00-07:00", "title": "Keeps crashing"}, {"content": "Review", "rating": "5", "version": "10.2.0", "date": "2017-02-26T16:01:00-07:00", "title": "Title"}, {"content": "the app itself id great, however it drains my phone battery very quickly, often it will have used more of my battery with background activity than it will when i am on the actual app, even though i have background app refreshing off and also i have the travel mode turned on, i think this app is so good but it would be even better if it used less battery life!", "rating": "4", "version": "10.2.0", "date": "2017-02-26T15:30:00-07:00", "title": "Battery life"}, {"content": "My battery goes way too fast when I use snapchat it's a joke. Because of that I hardly use it because it's annoying how fast it goes. Can you try do something to make it use less battery.", "rating": "1", "version": "10.2.0", "date": "2017-02-26T14:39:00-07:00", "title": "Battery"}, {"content": "I love Snapchat.. I go on it daily,However it would be great if you didn't make the app take way to much storage also on your next update PLEASE PLEASE PLEASE bring up the best friends on the other peoples accounts so everyone can see who your best friends are ( I was really upset when you took that away and I'm sure many people were ) so it would be amazing if you guys brought it back.. thanks", "rating": "4", "version": "10.2.0", "date": "2017-02-26T14:33:00-07:00", "title": "Memories?Bestfriends?"}, {"content": "Snapchat was honestly such an good app, good way to keep in contact with your friends, filters made you look stunning and no one would know who you were graftin, but my friend and I had over an 300 days streak and she forgot her password, she's honestly such an dafty sometimes though so I don't blame her but I kindly messaged team snapchat to see if they could help out, they actually patched my message and made me look like a mug, not impressed therefore leaving this bad review.", "rating": "1", "version": "10.2.0", "date": "2017-02-26T14:14:00-07:00", "title": "Ragin"}, {"content": "I don't want it to show when u screen shot it is really annoying and when u log out it does not let u log back in", "rating": "3", "version": "10.2.0", "date": "2017-02-26T12:22:00-07:00", "title": "Screenshot📸"}, {"content": "Love snap chat, use all the time but since the last update everyone is able to get memories except me, iPhone 5c", "rating": "5", "version": "10.2.0", "date": "2017-02-26T10:35:00-07:00", "title": "Memories"}, {"content": "BRING BACK THE ADD TO MEMORIES OPTION PLEASE TO MAKE THIS APP 5 STARS!!!!", "rating": "2", "version": "10.2.0", "date": "2017-02-26T10:08:00-07:00", "title": "Bring back the add to memories option"}, {"content": "Omg the new update is not letting me to reset my pass as soon I verify my account the app crash plz fix it", "rating": "3", "version": "10.2.0", "date": "2017-02-26T09:45:00-07:00", "title": "Forgot password"}, {"content": "It's so laggy on the iPhone 6 Plus and I felt the need to review the app because of it! Please optimise the app for the iPhone 6 Plus as soon as possible! Snapchat is huge I'm sure you have the resources to do it! Please do and I hope to have a lag free experience with the coming updates.", "rating": "1", "version": "10.2.0", "date": "2017-02-26T09:24:00-07:00", "title": "Embarrassingly laggy!"}, {"content": "When I see a video that my friends sent me I watch it then it comes back making it seem like I have something to watch when I already watched and it's so annoying", "rating": "1", "version": "10.2.0", "date": "2017-02-26T06:41:00-07:00", "title": "I'm angry!!"}, {"content": "I love this app so much, one of the best.\nPllleeaaassee could you add an option to upload memories to computer easily?? I have very little storage and I want to my photos to go onto my computer but to do that I have to save them all first in little groups and it's very long winded. \nThank you ❤️", "rating": "4", "version": "10.2.0", "date": "2017-02-26T05:31:00-07:00", "title": "Memories"}, {"content": "snapchat is a good app for texting and all of a sudden when I open a text... the 'tap to chat' notification is still there. It is quite distracting because our not too sure if your message has has been sent. Please fix this because it can cause some fights between freinds. 🙏🙏🙏🙏🙏", "rating": "3", "version": "10.2.0", "date": "2017-02-26T05:26:00-07:00", "title": "What is going on! .... it's very annoying!!!"}, {"content": "It is epic", "rating": "5", "version": "10.2.0", "date": "2017-02-26T04:31:00-07:00", "title": "Epic"}, {"content": "Great app, have no problems with it. I have had this app since it almost began and have never had a problem. Wish there was a Apple Watch version though", "rating": "5", "version": "10.2.0", "date": "2017-02-26T03:44:00-07:00", "title": "GREAT APP!!!"}, {"content": "There's a glitch that I've recently noticed where I can't see videos on people's stories and instead of playing a video it freezes and plays as if it's a photo, please fix this!", "rating": "4", "version": "10.2.0", "date": "2017-02-26T03:01:00-07:00", "title": "Glitch"}, {"content": "I love snapchat it is one of my favourite apps but recently it has been playing up loosing all my streaks even if I've sent streaks and every time I go to use a bitmoji or a sticker or a normal emoji it kicks me off snapchat and takes me to my front screen, it's actually really annoying, please sort it out soon!", "rating": "3", "version": "10.2.0", "date": "2017-02-26T01:12:00-07:00", "title": "Grr"}, {"content": "Everything's amazing about snapchat right now. The only thing that would make it PERFECT is... if you could add more people into a group chat, at least more than 20.", "rating": "4", "version": "10.2.0", "date": "2017-02-25T20:43:00-07:00", "title": "MORE PEOPLE IN GROUPCHATS."}, {"content": "It stinks I don't like the new search thing at the top with the Bitmoji", "rating": "1", "version": "10.2.0", "date": "2017-02-25T17:33:00-07:00", "title": "Lastest update"}, {"content": "Please can snapchat invest in boomerang where you can still use the filters I don't know how but it will be a massive hit and people will love it thanks babe x", "rating": "4", "version": "10.2.0", "date": "2017-02-25T17:19:00-07:00", "title": "Boomerang"}, {"content": "Have used snapchat for some time now and it keeps exiting the app without reason in addition it has shut down my phone several times. Update needs to happen constantly crashing and lagging in reaction time please fix this", "rating": "3", "version": "10.2.0", "date": "2017-02-25T14:28:00-07:00", "title": "..."}, {"content": "Haha", "rating": "5", "version": "10.2.0", "date": "2017-02-25T14:20:00-07:00", "title": "Lol too good to explain why"}, {"content": "Snapchat is a great app and I've never felt the need to write a review until now. Recently I have noticed a lag when opening the app. It takes a second or two to adjust; other apps don't have this same problem. \n\nPlease fix as soon as possible.", "rating": "3", "version": "10.2.0", "date": "2017-02-25T10:47:00-07:00", "title": "Bug"}, {"content": "I love snapchat as a platform but this latest update is just horrendous. The app is fast enough but things constantly get stuck for example I could be on the camera and it won't let me swipe to stories but I can swipe to messages. It was fine before the ugly UI change.", "rating": "1", "version": "10.2.0", "date": "2017-02-25T10:12:00-07:00", "title": "Buggy"}, {"content": "The new update is stupid i cant type someone name to view there story i have to look for them which is so annyoing🙄😫😡", "rating": "1", "version": "10.2.0", "date": "2017-02-25T10:01:00-07:00", "title": "New update"}, {"content": "Best app ever only if you have friends", "rating": "5", "version": "10.2.0", "date": "2017-02-25T09:58:00-07:00", "title": "Best app"}, {"content": "this app is brilliant, and by far my favorite social media. but pleaseeeeeee make a live feature!", "rating": "2", "version": "10.2.0", "date": "2017-02-25T05:15:00-07:00", "title": "amazing, but one thing"}, {"content": "Good but it doesn't connect with Bitmoji", "rating": "4", "version": "10.2.0", "date": "2017-02-25T04:40:00-07:00", "title": "Good but"}, {"content": "When uploading a video from your camera roll you should be able to put text on it as it doesn't allow you to do that", "rating": "5", "version": "10.2.0", "date": "2017-02-25T03:48:00-07:00", "title": "Ideas"}, {"content": "Why did you remove the faceswap filter, i am utterly disappointed im gonna be boycotting your app", "rating": "1", "version": "10.2.0", "date": "2017-02-25T03:23:00-07:00", "title": "WHERE IS FACESWAP??!?!!?!!"}, {"content": "It's greattttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttttt:)", "rating": "5", "version": "10.2.0", "date": "2017-02-25T02:47:00-07:00", "title": "Snappppyyy"}, {"content": "Any videos that are posted on stories, sent to me or I record, they don't play!! It is so annoying because when I send a video to someone it doesn't play, but every other video plays for them. When I receive a video they don't play. Sort it out please.", "rating": "1", "version": "10.2.0", "date": "2017-02-25T01:53:00-07:00", "title": "Absolutely not impressed"}, {"content": "Great app", "rating": "5", "version": "10.2.0", "date": "2017-02-24T17:56:00-07:00", "title": "Great"}, {"content": "The app always crashes and goes randomly off and you can't load certain peoples snapchat stories. It's annoying! Some people notifications don't come through either. i have a problem with the streaks always been on timers, they're always disappearing but them coming back", "rating": "1", "version": "10.2.0", "date": "2017-02-24T17:17:00-07:00", "title": "Poor"}, {"content": "If you press the three little circles at the bottom, all the stories should then be selected.", "rating": "5", "version": "10.2.0", "date": "2017-02-24T16:00:00-07:00", "title": "Just a quick heads up"}, {"content": "Snapchat used to be great and still it now. For example all the snaps are sending fine and the filters are great! However, for quite a while now the videos just freeze and don't play. This videos range from videos on stories to the videos on the article like Cosmopolitan. It's so annoying, Snapchat have to fix it!!", "rating": "2", "version": "10.2.0", "date": "2017-02-24T14:12:00-07:00", "title": "Videos won't play!"}, {"content": "With each update I keep hoping you're going to include the capability to remove the Daily Mail and The Sun from Discover, but nothing yet. These two \"newspapers\" (if you can call them that) publish sexist, racist, homophobic rubbish and it's disappointing that you not only give them a platform but also don't give Snapchat users who have morals the freedom to remove these two \"news\" outlets and enjoy the app without having to see them feature in Snapchat Discover.", "rating": "1", "version": "10.2.0", "date": "2017-02-24T13:16:00-07:00", "title": "Remove Daily Mail and The Sun from Discover"}, {"content": "Since the update I've had to reset my phone and now when I try to log in the app just crashes!", "rating": "1", "version": "10.2.0", "date": "2017-02-24T13:13:00-07:00", "title": "Can't log in"}, {"content": "I love this app it is so good for young children to interact with there junior school friends", "rating": "5", "version": "10.2.0", "date": "2017-02-24T13:11:00-07:00", "title": "Love it"}, {"content": "Friend emojis aren't working...", "rating": "1", "version": "10.2.0", "date": "2017-02-24T12:43:00-07:00", "title": "Smh"}, {"content": "Snapchat has been crashing all morning!! I think you need to debug???? Or fix something please lol", "rating": "1", "version": "10.2.0", "date": "2017-02-24T10:40:00-07:00", "title": "Keeps crashing"}, {"content": "Ok so I recently downloaded snap chat and everytime I get try, snapchat filters will NOT come up!! It won't let me update either so please help! And my best friends have only got IOS 7.4 so please make this app for IOS 7 thanks", "rating": "1", "version": "10.2.0", "date": "2017-02-24T08:59:00-07:00", "title": "HELP! No filters?"}, {"content": "Dear Snapchat,\n\nYou guys have done a great job over these past few years with developing this app and updating it frequently with innovative ideas. I think the next step for you guys is to improve the recording of video with audio casted from a Bluetooth connection. I'm sure you guys are aware that you cannot maintain the connection whilst recording on Snapchat. Competitors such as Instagram have achieved this so I think it should be at the top of your developer's list of priorities come the next update. Keep up the great work!", "rating": "5", "version": "10.2.0", "date": "2017-02-24T08:04:00-07:00", "title": "Best Social Media App"}, {"content": "I am not happpy with my username, I made the snapchat about two years ago and I find my username very childish for my age. I would love it if there was an option to change and I'm sure most of the users would appreciate it too, or else they're just going to move on from snap to insta.", "rating": "2", "version": "10.2.0", "date": "2017-02-24T05:46:00-07:00", "title": "Username issue"}, {"content": "Great app & Ive been using it for ages now, but I think you should make a streak section instead of having to search on the chats to find the person you're having a streak with.\n\nAlso you should add more emojis on the snapstickers area.\n\nAlso you should make us have at least 2 emojis represent our streaks on the 'manage preferences' area.", "rating": "5", "version": "10.2.0", "date": "2017-02-24T01:35:00-07:00", "title": "Great App"}, {"content": "For the past 3-4 weeks my story says \"adding 1 snap to your story...\" but it doesnt let me see it or delete it. Its very annoying as i cannot view my whole story all together🙄 fix ittttt pls", "rating": "1", "version": "10.2.0", "date": "2017-02-23T19:38:00-07:00", "title": "Bit mad tbh"}, {"content": "I love snapchat because I've been using it for a long time I wish there was a add to all button", "rating": "4", "version": "10.2.0", "date": "2017-02-23T13:07:00-07:00", "title": "😎"}, {"content": "Snapchat has gotten really slow lately , the filters come on late , and everything just lags , my groupe messages don't show", "rating": "3", "version": "10.2.0", "date": "2017-02-23T10:24:00-07:00", "title": "Slow"}, {"content": "I updated the app, and all my snaps and stories from this year are gone from my memories. Sort it out 🙄", "rating": "1", "version": "10.2.0", "date": "2017-02-23T09:26:00-07:00", "title": "Memories have disappeared"}, {"content": "This new update is Wack, won't let me send chats keeps sending and sending.. FIX IT", "rating": "1", "version": "10.2.0", "date": "2017-02-23T09:21:00-07:00", "title": "Bugs"}, {"content": "Crashes the whole phone even turns the phone off and says there's no battery when plugged in and powered up the battery is as it was? Weird. It's just when I use the filters and happens every time. Really annoying and I  don't use it cause of it crashing my phone.", "rating": "1", "version": "10.2.0", "date": "2017-02-23T09:00:00-07:00", "title": "Crashes"}, {"content": "I've been having issues were if someone puts a video on there story or sends me a video, it just comes up as a simple picture also if I take a video it takes ages to load so the video won't  start for like 30 secs and sometimes it doesn't even play the video, want to know if it is happening to anyone else?", "rating": "2", "version": "10.2.0", "date": "2017-02-23T08:15:00-07:00", "title": "Having minor issues!"}, {"content": "Great app only recently me and my friends streaks have jumped from say 24 to 14 days and some have even had days added to them streaks are also being lost even with snaps being sent and no timer showing", "rating": "4", "version": "10.2.0", "date": "2017-02-23T08:02:00-07:00", "title": "Streaks are glitched"}, {"content": "Hi, I love Snapchat but were has the yellow butterfly gone that was one of my favourite filters, and now it's just gone. Can you put it back on, it is really annoying to see my favourite filter is gone. Apart from that it's great.", "rating": "4", "version": "10.2.0", "date": "2017-02-23T07:58:00-07:00", "title": "Filters"}, {"content": "When I spam my mates for a while, it says 'Failed To Send'. I have no idea why it does this. But it's whenever my score increases by 1000 in a few hours. My friend has experienced the same thing as myself and wondering if this is a problem that can be fixed. If I left Snapchat for an hour it continues to work again. No idea why.", "rating": "3", "version": "10.2.0", "date": "2017-02-23T03:43:00-07:00", "title": "Snaps Won't Send Sometimes"}, {"content": "A mark as read feature should be added to Snapchat. This would be beneficial for people who have lots of friends who post a lot of Snapchats.", "rating": "5", "version": "10.2.0", "date": "2017-02-23T01:28:00-07:00", "title": "Mark as read feature"}, {"content": "Hmm so you waste your time speaking to someone and they turn out to be a snake tar social  media for the depression", "rating": "1", "version": "10.2.0", "date": "2017-02-22T16:58:00-07:00", "title": "Why?"}, {"content": "Snapchat does not help when there app has clearly got a fault with its snapstreak system and when you contact them directly they basically are useless. I think snapchat need assistance off other social media giants to do with user services\nAbsolutely appalling.", "rating": "1", "version": "10.2.0", "date": "2017-02-22T14:18:00-07:00", "title": "Snapstreaks- snapchats problem"}, {"content": "Wheres the send all button been waiting for ages? & ADD SNAPCHAT LIVE", "rating": "5", "version": "10.2.0", "date": "2017-02-22T13:26:00-07:00", "title": "SNAPCHAT LIVE SEND ALL"}, {"content": "Downloaded this app, it crashed my phone repeatedly. Battery 30%+ the last two times and couldn't get the phone back on. Deleted.", "rating": "1", "version": "10.2.0", "date": "2017-02-22T13:25:00-07:00", "title": "Deleted"}, {"content": "ive got a group chat & everyone's happy with the colours that they are but one of them is pink & im orange? i wanted to be pink but you just assume what i wanted to be, should be able to choose\nsort it out Snapchat", "rating": "1", "version": "10.2.0", "date": "2017-02-22T13:15:00-07:00", "title": "COLOURIST"}, {"content": "I love snapchat most of the time but sometimes I will take a snap then the app will close and then when I go back on to the app my snap is gone😠.", "rating": "4", "version": "10.2.0", "date": "2017-02-22T10:29:00-07:00", "title": "Snapchat"}, {"content": "Love snapchat to bits but guys but there are loads more you could do with the app, would be great to see the featured section get real live votes over certain issues so people can express their opinions. Still going to give 5 stars keep up the great work at Snapchat Inc.", "rating": "5", "version": "10.2.0", "date": "2017-02-22T08:34:00-07:00", "title": "Great app"}, {"content": "Every time I go onto the camera it goes super bright- as if there is too much light but there really isn't.\n\nIt adjusts itself after a while but takes about 15 seconds to fully focus.\n\nPlease fix !", "rating": "2", "version": "10.2.0", "date": "2017-02-22T07:49:00-07:00", "title": "Camera doesn't work"}, {"content": "Why has my rear camera changed and gone blurry and fuzzy on iPhone?!! It's only with Snapchat camera and I hate it! Please fix asap!!", "rating": "1", "version": "10.2.0", "date": "2017-02-22T07:47:00-07:00", "title": "Rear camera horrible"}, {"content": "Love snapchat but on the next update you should make it so that you can name a group chat whatever you want just on your phone and the other people can have a different name on their phone so there's no arguments over the name😂👯🍭recently I can't send people messages on snapchat!", "rating": "4", "version": "10.2.0", "date": "2017-02-22T07:20:00-07:00", "title": "Next update? PLEASE READ"}, {"content": "SNAPCHAT IS LOOSING NY STREAKS", "rating": "1", "version": "10.2.0", "date": "2017-02-22T06:39:00-07:00", "title": "Snapchat !!"}, {"content": "Well , I like Snapchat but this is my first time writing a review because I have a suggestion . Well , I'm adding some young people of my family members & others , & sometimes when I take a vid someone swears or says a bad word by mistake . So instead of making me retake the vid , why don't you add some ( BEEPS ) that we can use ? So we can edit our video by adding some beeps on it to avoid the swearing words in the video . & thanks a lot 💙 - Quartz", "rating": "5", "version": "10.2.0", "date": "2017-02-22T02:55:00-07:00", "title": "I have a suggestion"}, {"content": "I honestly love snapchat and enjoy using it. One thing I recommend adding is more emojis. I'd like to be able to see who other peoples best friends are !!", "rating": "4", "version": "10.2.0", "date": "2017-02-22T02:15:00-07:00", "title": "More emojis!"}, {"content": "Every app trying to copying snapchat are just gonna flop, you can't beat the original", "rating": "5", "version": "10.2.0", "date": "2017-02-22T01:48:00-07:00", "title": "Purely because"}, {"content": "Please add a button (or something like that) so that you can clear out all snapchat stories that you don't want to read. Otherwise its really annoying to have to tap on all the stories to get rid of them.", "rating": "4", "version": "10.2.0", "date": "2017-02-22T00:39:00-07:00", "title": "Suggestion"}, {"content": "App is great part from the fact that I've tried in my phone and snapchat settings to turn on notifications and still I receive the snapchats but no notification with it, can anyone help ?", "rating": "5", "version": "10.2.0", "date": "2017-02-21T16:51:00-07:00", "title": "Help plz"}, {"content": "Would love to see an option for sending a snap to the contacts I have snap streaks with. This would mean I could keep all of my snap streaks (as I have a lot of them) without having to scroll through and select their names. People I have spoken too say the same thing.\nThank you!", "rating": "4", "version": "10.2.0", "date": "2017-02-21T15:08:00-07:00", "title": "App Improvement Idea"}, {"content": "I mean who wouldn't", "rating": "5", "version": "10.2.0", "date": "2017-02-21T14:00:00-07:00", "title": "LOVE IT"}, {"content": "For some reason every so often Snapchat freezes while I'm typing, and then resumes like 10 seconds later catching up with the words. I have a new 7 plus and all my other apps are fine so I'm sure it's just a snapchat bug. If it freezes for an exceptionally long time, a popup saying \"Pasting from iMac\" appears and my computer airdrops the words I was typing to my phone; which is also really weird.", "rating": "4", "version": "10.2.0", "date": "2017-02-21T14:00:00-07:00", "title": "Weird bug"}, {"content": "Love the app, but would love even more if there was an update where it would let you change your username!", "rating": "4", "version": "10.2.0", "date": "2017-02-21T13:35:00-07:00", "title": "Update please!"}, {"content": "I would of given this app 5* all day long! Till I did an update, I now can't even access Timehop 😞 why fix what wasn't broken!! Please sort this out, I love looking back on my yesteryear", "rating": "1", "version": "10.2.0", "date": "2017-02-21T13:12:00-07:00", "title": "Please fix these problems!!"}, {"content": "I love this app but I think you should allow everyone to change their username as I hate my one but I don't want to make a new snapchat", "rating": "5", "version": "10.2.0", "date": "2017-02-21T12:45:00-07:00", "title": "Great"}]}